{"text": "DistilBERT, a distilled version of BERT: smaller, faster, cheaper and lighter\n\nAbstract:\nAs Transfer Learning from large-scale pre-trained models becomes more prevalent in Natural Language Processing (NLP), operating these large models in on-theedge and/or under constrained computational training or inference budgets remains challenging. In this work, we propose a method to pre-train a smaller generalpurpose language representation model, called DistilBERT, which can then be finetuned with good performances on a wide range of tasks like its larger counterparts. While most prior work investigated the use of distillation for building task-specific models, we leverage knowledge distillation during the pre-training phase and show that it is possible to reduce the size of a BERT model by 40%, while retaining 97% of its language understanding capabilities and being 60% faster. To leverage the inductive biases learned by larger models during pre-training, we introduce a triple loss combining language modeling, distillation and cosine-distance losses. Our smaller, faster and lighter model is cheaper to pre-train and we demonstrate its capabilities for on-device computations in a proof-of-concept experiment and a comparative on-device study.\n\n\n1 Introduction\nThe last two years have seen the rise of Transfer Learning approaches in Natural Language Processing (NLP) with large-scale pre-trained language models becoming a basic tool in many NLP tasks [Devlin et al., 2018, Radford et al., 2019, Liu et al., 2019]. While these models lead to significant improvement, they often have several hundred million parameters and current research 1 on pre-trained models indicates that training even larger models still leads to better performances on downstream tasks.\nThe trend toward bigger models raises several concerns. First is the environmental cost of exponentially scaling these models' computational requirements as mentioned in Schwartz et al. [2019], Strubell et al. [2019]. Second, while operating these models on-device in real-time has the potential to enable novel and interesting language processing applications, the growing computational and memory requirements of these models may hamper wide adoption.\nIn this paper, we show that it is possible to reach similar performances on many downstream-tasks using much smaller language models pre-trained with knowledge distillation, resulting in models that are lighter and faster at inference time, while also requiring a smaller computational training budget. Our general-purpose pre-trained models can be fine-tuned with good performances on several downstream tasks, keeping the flexibility of larger models. We also show that our compressed models are small enough to run on the edge, e.g. on mobile devices.\nUsing a triple loss, we show that a 40% smaller Transformer (Vaswani et al. [2017]) pre-trained through distillation via the supervision of a bigger Transformer language model can achieve similar performance on a variety of downstream tasks, while being 60% faster at inference time. Further ablation studies indicate that all the components of the triple loss are important for best performances.\nWe have made the trained weights available along with the training code in the Transformers 2 library from HuggingFace [Wolf et al., 2019].\n\n2 Knowledge distillation\nKnowledge distillation [Bucila et al., 2006, Hinton et al., 2015] is a compression technique in which a compact model -the student -is trained to reproduce the behaviour of a larger model -the teacheror an ensemble of models.\nIn supervised learning, a classification model is generally trained to predict an instance class by maximizing the estimated probability of gold labels. A standard training objective thus involves minimizing the cross-entropy between the model's predicted distribution and the one-hot empirical distribution of training labels. A model performing well on the training set will predict an output distribution with high probability on the correct class and with near-zero probabilities on other classes. But some of these \"near-zero\" probabilities are larger than others and reflect, in part, the generalization capabilities of the model and how well it will perform on the test set 3.\nTraining loss The student is trained with a distillation loss over the soft target probabilities of the teacher: L ce = i t i * log(s i ) where t i (resp. s i ) is a probability estimated by the teacher (resp. the student). This objective results in a rich training signal by leveraging the full teacher distribution. Following Hinton et al. [2015] we used a softmax-temperature:p i = exp(zi/T ) j exp(zj /T )\nwhere T controls the smoothness of the output distribution and z i is the model score for the class i. The same temperature T is applied to the student and the teacher at training time, while at inference, T is set to 1 to recover a standard softmax.\nThe final training objective is a linear combination of the distillation loss L ce with the supervised training loss, in our case the masked language modeling loss L mlm [Devlin et al., 2018]. We found it beneficial to add a cosine embedding loss (L cos ) which will tend to align the directions of the student and teacher hidden states vectors.\n3 DistilBERT: a distilled version of BERT Student architecture In the present work, the student -DistilBERT -has the same general architecture as BERT. The token-type embeddings and the pooler are removed while the number of layers is reduced by a factor of 2. Most of the operations used in the Transformer architecture (linear layer and layer normalisation) are highly optimized in modern linear algebra frameworks and our investigations showed that variations on the last dimension of the tensor (hidden size dimension) have a smaller impact on computation efficiency (for a fixed parameters budget) than variations on other factors like the number of layers. Thus we focus on reducing the number of layers.\n\nStudent initialization\nIn addition to the previously described optimization and architectural choices, an important element in our training procedure is to find the right initialization for the sub-network to converge. Taking advantage of the common dimensionality between teacher and student networks, we initialize the student from the teacher by taking one layer out of two.\n\nData and compute power\nWe train DistilBERT on the same corpus as the original BERT model: a concatenation of English Wikipedia and Toronto Book Corpus [Zhu et al., 2015]. DistilBERT was trained on 8 16GB V100 GPUs for approximately 90 hours. For the sake of comparison, the RoBERTa model [Liu et al., 2019] required 1 day of training on 1024 32GB V100.\n\n4 Experiments\nGeneral Language Understanding We assess the language understanding and generalization capabilities of DistilBERT on the General Language Understanding Evaluation (GLUE) benchmark [Wang et al., 2018], a collection of 9 datasets for evaluating natural language understanding systems. We report scores on the development sets for each task by fine-tuning DistilBERT without the use of ensembling or multi-tasking scheme for fine-tuning (which are mostly orthogonal to the present work). We compare the results to the baseline provided by the authors of GLUE: an ELMo (Peters et al. [2018]) encoder followed by two BiLSTMs. 4 he results on each of the 9 tasks are showed on Table 1 along with the macro-score (average of individual scores). Among the 9 tasks, DistilBERT is always on par or improving over the ELMo baseline (up to 19 points of accuracy on STS-B). DistilBERT also compares surprisingly well to BERT, retaining 97% of the performance with 40% fewer parameters.\n\n4.1 Downstream task benchmark\nDownstream tasks We further study the performances of DistilBERT on several downstream tasks under efficient inference constraints: a classification task (IMDb sentiment classification - Maas et al. [2011]) and a question answering task (SQuAD v1.1 -Rajpurkar et al. [2016]).\nAs shown in Table 2, DistilBERT is only 0.6% point behind BERT in test accuracy on the IMDb benchmark while being 40% smaller. On SQuAD, DistilBERT is within 3.9 points of the full BERT.\nWe also studied whether we could add another step of distillation during the adaptation phase by fine-tuning DistilBERT on SQuAD using a BERT model previously fine-tuned on SQuAD as a\n\nAblation\nVariation on GLUE macro-score∅ -L cos -L mlm -2.96 L ce -∅ -L mlm -1.46 L ce -L cos -∅\n-0.31 Triple loss + random weights initialization -3.69\nteacher for an additional term in the loss (knowledge distillation). In this setting, there are thus two successive steps of distillation, one during the pre-training phase and one during the adaptation phase.\nIn this case, we were able to reach interesting performances given the size of the model: 79.8 F1 and 70.4 EM, i.e. within 3 points of the full model.\n\nSize and inference speed\nTo further investigate the speed-up/size trade-off of DistilBERT, we compare (in Table 3) the number of parameters of each model along with the inference time needed to do a full pass on the STS-B development set on CPU (Intel Xeon E5-2690 v3 Haswell @2.9GHz) using a batch size of 1. DistilBERT has 40% fewer parameters than BERT and is 60% faster than BERT.\nOn device computation We studied whether DistilBERT could be used for on-the-edge applications by building a mobile application for question answering. We compare the average inference time on a recent smartphone (iPhone 7 Plus) against our previously trained question answering model based on BERT-base. Excluding the tokenization step, DistilBERT is 71% faster than BERT, and the whole model weighs 207 MB (which could be further reduced with quantization). Our code is available 5.\n\n4.2 Ablation study\nIn this section, we investigate the influence of various components of the triple loss and the student initialization on the performances of the distilled model. We report the macro-score on GLUE. Table 4 presents the deltas with the full triple loss: removing the Masked Language Modeling loss has little impact while the two distillation losses account for a large portion of the performance.\n\n5 Related work\nTask-specific distillation Most of the prior works focus on building task-specific distillation setups.  Tang et al. [2019] transfer fine-tune classification model BERT to an LSTM-based classifier.  Chatterjee [2019] distill BERT model fine-tuned on SQuAD in a smaller Transformer model previously initialized from BERT. In the present work, we found it beneficial to use a general-purpose pre-training distillation rather than a task-specific distillation.  Turc et al. [2019] use the original pretraining objective to train smaller student, then fine-tuned via distillation. As shown in the ablation study, we found it beneficial to leverage the teacher's knowledge to pre-train with additional distillation signal.\nMulti-distillation Yang et al. [2019] combine the knowledge of an ensemble of teachers using multi-task learning to regularize the distillation. The authors apply Multi-Task Knowledge Distillation to learn a compact question answering model from a set of large question answering models. An application of multi-distillation is multi-linguality: Tsai et al. [2019] adopts a similar approach to us by pre-training a multilingual model from scratch solely through distillation. However, as shown in the ablation study, leveraging the teacher's knowledge with initialization and additional losses leads to substantial gains.\nOther compression techniques have been studied to compress large models. Recent developments in weights pruning reveal that it is possible to remove some heads in the self-attention at test time without significantly degrading the performance Michel et al. [2019]. Some layers can be reduced to one head. A separate line of study leverages quantization to derive smaller models (Gupta et al. [2015]). Pruning and quantization are orthogonal to the present work.\n\n6 Conclusion and future work\nWe introduced DistilBERT, a general-purpose pre-trained version of BERT, 40% smaller, 60% faster, that retains 97% of the language understanding capabilities. We showed that a general-purpose language model can be successfully trained with distillation and analyzed the various components with an ablation study. We further demonstrated that DistilBERT is a compelling option for edge applications.\n\nFootnotes:\n1: See for instance the recently released MegatronLM (https://nv-adlr.github.io/MegatronLM) EMC^2: 5th Edition Co-located with NeurIPS'19\n2: https://github.com/huggingface/transformers\n3: E.g. BERT-base's predictions for a masked token in \"I think this is the beginning of a beautiful [MASK]\" comprise two high probability tokens (day and life) and a long tail of valid predictions (future, story, world. . . ).\n4: We use jiant [Wang et al., 2019] to compute the baseline.\n5: https://github.com/huggingface/swift-coreml-transformers\n\nReferences:\n\n- Jacob Devlin, Ming-Wei Chang, Kenton Lee, and Kristina Toutanova. Bert: Pre-training of deep bidirectional transformers for language understanding. In NAACL-HLT, 2018.- Alec Radford, Jeffrey Wu, Rewon Child, David Luan, Dario Amodei, and Ilya Sutskever. Language models are unsupervised multitask learners. 2019.\n\n- Yinhan Liu, Myle Ott, Naman Goyal, Jingfei Du, Mandar S. Joshi, Danqi Chen, Omer Levy, Mike Lewis, Luke S. Zettlemoyer, and Veselin Stoyanov. Roberta: A robustly optimized bert pretraining approach. ArXiv, abs/1907.11692, 2019.\n\n- Roy Schwartz, Jesse Dodge, Noah A. Smith, and Oren Etzioni. Green ai. ArXiv, abs/1907.10597, 2019.\n\n- Emma Strubell, Ananya Ganesh, and Andrew McCallum. Energy and policy considerations for deep learning in nlp. In ACL, 2019.\n\n- Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N. Gomez, Lukasz Kaiser, and Illia Polosukhin. Attention is all you need. In NIPS, 2017.\n\n- Thomas Wolf, Lysandre Debut, Victor Sanh, Julien Chaumond, Clement Delangue, Anthony Moi, Pierric Cistac, Tim Rault, Rémi Louf, Morgan Funtowicz, and Jamie Brew. Transformers: State-of-the-art natural language processing, 2019.\n\n- Cristian Bucila, Rich Caruana, and Alexandru Niculescu-Mizil. Model compression. In KDD, 2006.\n\n- Geoffrey E. Hinton, Oriol Vinyals, and Jeffrey Dean. Distilling the knowledge in a neural network. ArXiv, abs/1503.02531, 2015.\n\n- Yukun Zhu, Ryan Kiros, Richard S. Zemel, Ruslan Salakhutdinov, Raquel Urtasun, Antonio Torralba, and Sanja Fidler. Aligning books and movies: Towards story-like visual explanations by watching movies and reading books. 2015 IEEE International Conference on Computer Vision (ICCV), pages 19-27, 2015.\n\n- Alex Wang, Amanpreet Singh, Julian Michael, Felix Hill, Omer Levy, and Samuel R. Bowman. Glue: A multi-task benchmark and analysis platform for natural language understanding. In ICLR, 2018.\n\n- Matthew E. Peters, Mark Neumann, Mohit Iyyer, Matt Gardner, Christopher Clark, Kenton Lee, and Luke Zettlemoyer. Deep contextualized word representations. In NAACL, 2018.\n\n- Alex Wang, Ian F. Tenney, Yada Pruksachatkun, Katherin Yu, Jan Hula, Patrick Xia, Raghu Pappagari, Shuning Jin, R. Thomas McCoy, Roma Patel, Yinghui Huang, Jason Phang, Edouard Grave, Najoung Kim, Phu Mon Htut, Thibault F'evry, Berlin Chen, Nikita Nangia, Haokun Liu, Anhad Mohananey, Shikha Bordia, Nicolas Patry, Ellie Pavlick, and Samuel R. Bowman. jiant 1.1: A software toolkit for research on general-purpose text understanding models. http://jiant.info/, 2019.\n\n- Andrew L. Maas, Raymond E. Daly, Peter T. Pham, Dan Huang, Andrew Y. Ng, and Christopher Potts. Learning word vectors for sentiment analysis. In ACL, 2011.\n\n- Pranav Rajpurkar, Jian Zhang, Konstantin Lopyrev, and Percy Liang. Squad: 100, 000+ questions for machine comprehension of text. In EMNLP, 2016.\n\n- Raphael Tang, Yao Lu, Linqing Liu, Lili Mou, Olga Vechtomova, and Jimmy Lin. Distilling task-specific knowledge from bert into simple neural networks. ArXiv, abs/1903.12136, 2019.\n\n- Debajyoti Chatterjee. Making neural machine reading comprehension faster. ArXiv, abs/1904.00796, 2019.\n\n- Iulia Turc, Ming-Wei Chang, Kenton Lee, and Kristina Toutanova. Well-read students learn better: The impact of student initialization on knowledge distillation. ArXiv, abs/1908.08962, 2019.\n\n- Ze Yang, Linjun Shou, Ming Gong, Wutao Lin, and Daxin Jiang. Model compression with multi-task knowledge distillation for web-scale question answering system. ArXiv, abs/1904.09636, 2019.\n\n- Henry Tsai, Jason Riesa, Melvin Johnson, Naveen Arivazhagan, Xin Li, and Amelia Archer. Small and practical bert models for sequence labeling. In EMNLP-IJCNLP, 2019.\n\n- Paul Michel, Omer Levy, and Graham Neubig. Are sixteen heads really better than one? In NeurIPS, 2019.\n\n- Suyog Gupta, Ankur Agrawal, Kailash Gopalakrishnan, and Pritish Narayanan. Deep learning with limited numerical precision. In ICML, 2015.\n\n", "annotations": {"Abstract": [{"begin": 79, "end": 1252, "idx": 0}], "Head": [{"begin": 1255, "end": 1269, "n": "1", "idx": 0}, {"begin": 3320, "end": 3344, "n": "2", "idx": 1}, {"begin": 5974, "end": 5996, "idx": 2}, {"begin": 6353, "end": 6375, "idx": 3}, {"begin": 6707, "end": 6720, "n": "4", "idx": 4}, {"begin": 7695, "end": 7724, "n": "4.1", "idx": 5}, {"begin": 8373, "end": 8381, "idx": 6}, {"begin": 8887, "end": 8911, "idx": 7}, {"begin": 9758, "end": 9776, "n": "4.2", "idx": 8}, {"begin": 10173, "end": 10187, "n": "5", "idx": 9}, {"begin": 11991, "end": 12019, "n": "6", "idx": 10}], "ReferenceToBib": [{"begin": 1462, "end": 1482, "target": "#b0", "idx": 0}, {"begin": 1482, "end": 1504, "target": "#b1", "idx": 1}, {"begin": 1504, "end": 1523, "idx": 2}, {"begin": 1942, "end": 1964, "target": "#b3", "idx": 3}, {"begin": 1966, "end": 1988, "target": "#b4", "idx": 4}, {"begin": 2841, "end": 2863, "target": "#b5", "idx": 5}, {"begin": 3298, "end": 3317, "target": "#b6", "idx": 6}, {"begin": 3368, "end": 3388, "target": "#b7", "idx": 7}, {"begin": 3388, "end": 3409, "target": "#b8", "idx": 8}, {"begin": 4583, "end": 4603, "target": "#b8", "idx": 9}, {"begin": 5086, "end": 5107, "target": "#b0", "idx": 10}, {"begin": 6504, "end": 6522, "target": "#b9", "idx": 11}, {"begin": 6641, "end": 6659, "target": "#b2", "idx": 12}, {"begin": 6901, "end": 6920, "target": "#b10", "idx": 13}, {"begin": 7286, "end": 7307, "target": "#b11", "idx": 14}, {"begin": 7912, "end": 7930, "target": "#b13", "idx": 15}, {"begin": 7962, "end": 7998, "idx": 16}, {"begin": 10293, "end": 10311, "target": "#b15", "idx": 17}, {"begin": 10387, "end": 10404, "target": "#b16", "idx": 18}, {"begin": 10647, "end": 10665, "target": "#b17", "idx": 19}, {"begin": 10925, "end": 10943, "target": "#b18", "idx": 20}, {"begin": 11252, "end": 11270, "target": "#b19", "idx": 21}, {"begin": 11771, "end": 11791, "target": "#b20", "idx": 22}, {"begin": 11906, "end": 11926, "target": "#b21", "idx": 23}, {"begin": 12859, "end": 12878, "target": "#b12", "idx": 24}], "ReferenceToFootnote": [{"begin": 1649, "end": 1650, "target": "#foot_0", "idx": 0}, {"begin": 3271, "end": 3272, "target": "#foot_1", "idx": 1}, {"begin": 4252, "end": 4253, "target": "#foot_2", "idx": 2}, {"begin": 7342, "end": 7343, "target": "#foot_3", "idx": 3}, {"begin": 9754, "end": 9755, "target": "#foot_4", "idx": 4}], "SectionFootnote": [{"begin": 12420, "end": 12963, "idx": 0}], "ReferenceString": [{"begin": 12980, "end": 13147, "id": "b0", "idx": 0}, {"begin": 13149, "end": 13292, "id": "b1", "idx": 1}, {"begin": 13296, "end": 13523, "id": "b2", "idx": 2}, {"begin": 13527, "end": 13625, "id": "b3", "idx": 3}, {"begin": 13629, "end": 13752, "id": "b4", "idx": 4}, {"begin": 13756, "end": 13923, "id": "b5", "idx": 5}, {"begin": 13927, "end": 14154, "id": "b6", "idx": 6}, {"begin": 14158, "end": 14252, "id": "b7", "idx": 7}, {"begin": 14256, "end": 14383, "id": "b8", "idx": 8}, {"begin": 14387, "end": 14686, "id": "b9", "idx": 9}, {"begin": 14690, "end": 14880, "id": "b10", "idx": 10}, {"begin": 14884, "end": 15054, "id": "b11", "idx": 11}, {"begin": 15058, "end": 15524, "id": "b12", "idx": 12}, {"begin": 15528, "end": 15683, "id": "b13", "idx": 13}, {"begin": 15687, "end": 15831, "id": "b14", "idx": 14}, {"begin": 15835, "end": 16014, "id": "b15", "idx": 15}, {"begin": 16018, "end": 16120, "id": "b16", "idx": 16}, {"begin": 16124, "end": 16313, "id": "b17", "idx": 17}, {"begin": 16317, "end": 16504, "id": "b18", "idx": 18}, {"begin": 16508, "end": 16673, "id": "b19", "idx": 19}, {"begin": 16677, "end": 16779, "id": "b20", "idx": 20}, {"begin": 16783, "end": 16920, "id": "b21", "idx": 21}], "ReferenceToTable": [{"begin": 7398, "end": 7399, "target": "#tab_0", "idx": 0}, {"begin": 8019, "end": 8020, "idx": 1}, {"begin": 8999, "end": 9000, "idx": 2}, {"begin": 9980, "end": 9981, "target": "#tab_1", "idx": 3}], "Footnote": [{"begin": 12431, "end": 12568, "id": "foot_0", "n": "1", "idx": 0}, {"begin": 12569, "end": 12615, "id": "foot_1", "n": "2", "idx": 1}, {"begin": 12616, "end": 12842, "id": "foot_2", "n": "3", "idx": 2}, {"begin": 12843, "end": 12903, "id": "foot_3", "n": "4", "idx": 3}, {"begin": 12904, "end": 12963, "id": "foot_4", "n": "5", "idx": 4}], "Paragraph": [{"begin": 89, "end": 1252, "idx": 0}, {"begin": 1270, "end": 1771, "idx": 1}, {"begin": 1772, "end": 2225, "idx": 2}, {"begin": 2226, "end": 2780, "idx": 3}, {"begin": 2781, "end": 3178, "idx": 4}, {"begin": 3179, "end": 3318, "idx": 5}, {"begin": 3345, "end": 3570, "idx": 6}, {"begin": 3571, "end": 4254, "idx": 7}, {"begin": 4255, "end": 4634, "idx": 8}, {"begin": 4665, "end": 4915, "idx": 9}, {"begin": 4916, "end": 5261, "idx": 10}, {"begin": 5262, "end": 5972, "idx": 11}, {"begin": 5997, "end": 6351, "idx": 12}, {"begin": 6376, "end": 6705, "idx": 13}, {"begin": 6721, "end": 7693, "idx": 14}, {"begin": 7725, "end": 8000, "idx": 15}, {"begin": 8001, "end": 8187, "idx": 16}, {"begin": 8188, "end": 8371, "idx": 17}, {"begin": 8382, "end": 8411, "idx": 18}, {"begin": 8469, "end": 8524, "idx": 19}, {"begin": 8525, "end": 8734, "idx": 20}, {"begin": 8735, "end": 8885, "idx": 21}, {"begin": 8912, "end": 9271, "idx": 22}, {"begin": 9272, "end": 9756, "idx": 23}, {"begin": 9777, "end": 10171, "idx": 24}, {"begin": 10188, "end": 10905, "idx": 25}, {"begin": 10906, "end": 11527, "idx": 26}, {"begin": 11528, "end": 11989, "idx": 27}, {"begin": 12020, "end": 12418, "idx": 28}], "SectionHeader": [{"begin": 0, "end": 1252, "idx": 0}], "SectionReference": [{"begin": 12965, "end": 16922, "idx": 0}], "Sentence": [{"begin": 89, "end": 339, "idx": 0}, {"begin": 340, "end": 567, "idx": 1}, {"begin": 568, "end": 883, "idx": 2}, {"begin": 884, "end": 1059, "idx": 3}, {"begin": 1060, "end": 1252, "idx": 4}, {"begin": 1270, "end": 1524, "idx": 5}, {"begin": 1525, "end": 1771, "idx": 6}, {"begin": 1772, "end": 1827, "idx": 7}, {"begin": 1828, "end": 1989, "idx": 8}, {"begin": 1990, "end": 2225, "idx": 9}, {"begin": 2226, "end": 2528, "idx": 10}, {"begin": 2529, "end": 2679, "idx": 11}, {"begin": 2680, "end": 2780, "idx": 12}, {"begin": 2781, "end": 3064, "idx": 13}, {"begin": 3065, "end": 3178, "idx": 14}, {"begin": 3179, "end": 3318, "idx": 15}, {"begin": 3345, "end": 3570, "idx": 16}, {"begin": 3571, "end": 3723, "idx": 17}, {"begin": 3724, "end": 3898, "idx": 18}, {"begin": 3899, "end": 4072, "idx": 19}, {"begin": 4073, "end": 4254, "idx": 20}, {"begin": 4255, "end": 4409, "idx": 21}, {"begin": 4410, "end": 4464, "idx": 22}, {"begin": 4465, "end": 4478, "idx": 23}, {"begin": 4479, "end": 4572, "idx": 24}, {"begin": 4573, "end": 4634, "idx": 25}, {"begin": 4665, "end": 4767, "idx": 26}, {"begin": 4768, "end": 4915, "idx": 27}, {"begin": 4916, "end": 5108, "idx": 28}, {"begin": 5109, "end": 5261, "idx": 29}, {"begin": 5262, "end": 5413, "idx": 30}, {"begin": 5414, "end": 5924, "idx": 31}, {"begin": 5925, "end": 5972, "idx": 32}, {"begin": 5997, "end": 6192, "idx": 33}, {"begin": 6193, "end": 6351, "idx": 34}, {"begin": 6376, "end": 6523, "idx": 35}, {"begin": 6524, "end": 6594, "idx": 36}, {"begin": 6595, "end": 6705, "idx": 37}, {"begin": 6721, "end": 7003, "idx": 38}, {"begin": 7004, "end": 7205, "idx": 39}, {"begin": 7206, "end": 7343, "idx": 40}, {"begin": 7344, "end": 7458, "idx": 41}, {"begin": 7459, "end": 7581, "idx": 42}, {"begin": 7582, "end": 7693, "idx": 43}, {"begin": 7725, "end": 8000, "idx": 44}, {"begin": 8001, "end": 8127, "idx": 45}, {"begin": 8128, "end": 8187, "idx": 46}, {"begin": 8188, "end": 8371, "idx": 47}, {"begin": 8382, "end": 8411, "idx": 48}, {"begin": 8469, "end": 8524, "idx": 49}, {"begin": 8525, "end": 8593, "idx": 50}, {"begin": 8594, "end": 8734, "idx": 51}, {"begin": 8735, "end": 8885, "idx": 52}, {"begin": 8912, "end": 9271, "idx": 53}, {"begin": 9272, "end": 9423, "idx": 54}, {"begin": 9424, "end": 9576, "idx": 55}, {"begin": 9577, "end": 9731, "idx": 56}, {"begin": 9732, "end": 9756, "idx": 57}, {"begin": 9777, "end": 9938, "idx": 58}, {"begin": 9939, "end": 9973, "idx": 59}, {"begin": 9974, "end": 10171, "idx": 60}, {"begin": 10188, "end": 10291, "idx": 61}, {"begin": 10292, "end": 10385, "idx": 62}, {"begin": 10386, "end": 10508, "idx": 63}, {"begin": 10509, "end": 10645, "idx": 64}, {"begin": 10646, "end": 10764, "idx": 65}, {"begin": 10765, "end": 10905, "idx": 66}, {"begin": 10906, "end": 11050, "idx": 67}, {"begin": 11051, "end": 11193, "idx": 68}, {"begin": 11194, "end": 11381, "idx": 69}, {"begin": 11382, "end": 11527, "idx": 70}, {"begin": 11528, "end": 11600, "idx": 71}, {"begin": 11601, "end": 11792, "idx": 72}, {"begin": 11793, "end": 11832, "idx": 73}, {"begin": 11833, "end": 11928, "idx": 74}, {"begin": 11929, "end": 11989, "idx": 75}, {"begin": 12020, "end": 12178, "idx": 76}, {"begin": 12179, "end": 12332, "idx": 77}, {"begin": 12333, "end": 12418, "idx": 78}], "Div": [{"begin": 89, "end": 1252, "idx": 0}, {"begin": 1255, "end": 3318, "idx": 1}, {"begin": 3320, "end": 5972, "idx": 2}, {"begin": 5974, "end": 6351, "idx": 3}, {"begin": 6353, "end": 6705, "idx": 4}, {"begin": 6707, "end": 7693, "idx": 5}, {"begin": 7695, "end": 8371, "idx": 6}, {"begin": 8373, "end": 8885, "idx": 7}, {"begin": 8887, "end": 9756, "idx": 8}, {"begin": 9758, "end": 10171, "idx": 9}, {"begin": 10173, "end": 11989, "idx": 10}, {"begin": 11991, "end": 12418, "idx": 11}], "SectionMain": [{"begin": 1252, "end": 12418, "idx": 0}]}}