{"text": "BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding\n\nAbstract:\nWe introduce a new language representation model called BERT, which stands for Bidirectional Encoder Representations from Transformers. Unlike recent language representation models (Peters et al., 2018a; Radford et al., 2018), BERT is designed to pretrain deep bidirectional representations from unlabeled text by jointly conditioning on both left and right context in all layers. As a result, the pre-trained BERT model can be finetuned with just one additional output layer to create state-of-the-art models for a wide range of tasks, such as question answering and language inference, without substantial taskspecific architecture modifications.\nBERT is conceptually simple and empirically powerful. It obtains new state-of-the-art results on eleven natural language processing tasks, including pushing the GLUE score to 80.5% (7.7% point absolute improvement), MultiNLI accuracy to 86.7% (4.6% absolute improvement), SQuAD v1.1 question answering Test F1 to 93.2 (1.5 point absolute improvement) and SQuAD v2.0 Test F1 to 83.1 (5.1 point absolute improvement).\n\n\n1 Introduction\nLanguage model pre-training has been shown to be effective for improving many natural language processing tasks (Dai and Le, 2015; Peters et al., 2018a; Radford et al., 2018; Howard and Ruder, 2018). These include sentence-level tasks such as natural language inference (Bowman et al., 2015; Williams et al., 2018) and paraphrasing (Dolan and Brockett, 2005), which aim to predict the relationships between sentences by analyzing them holistically, as well as token-level tasks such as named entity recognition and question answering, where models are required to produce fine-grained output at the token level (Tjong Kim Sang and De Meulder, 2003; Rajpurkar et al., 2016).\nThere are two existing strategies for applying pre-trained language representations to downstream tasks: feature-based and fine-tuning. The feature-based approach, such as ELMo (Peters et al., 2018a), uses task-specific architectures that include the pre-trained representations as additional features. The fine-tuning approach, such as the Generative Pre-trained Transformer (OpenAI GPT) (Radford et al., 2018), introduces minimal task-specific parameters, and is trained on the downstream tasks by simply fine-tuning all pretrained parameters. The two approaches share the same objective function during pre-training, where they use unidirectional language models to learn general language representations.\nWe argue that current techniques restrict the power of the pre-trained representations, especially for the fine-tuning approaches. The major limitation is that standard language models are unidirectional, and this limits the choice of architectures that can be used during pre-training. For example, in OpenAI GPT, the authors use a left-toright architecture, where every token can only attend to previous tokens in the self-attention layers of the Transformer (Vaswani et al., 2017). Such restrictions are sub-optimal for sentence-level tasks, and could be very harmful when applying finetuning based approaches to token-level tasks such as question answering, where it is crucial to incorporate context from both directions.\nIn this paper, we improve the fine-tuning based approaches by proposing BERT: Bidirectional Encoder Representations from Transformers. BERT alleviates the previously mentioned unidirectionality constraint by using a \"masked language model\" (MLM) pre-training objective, inspired by the Cloze task (Taylor, 1953). The masked language model randomly masks some of the tokens from the input, and the objective is to predict the original vocabulary id of the masked word based only on its context. Unlike left-toright language model pre-training, the MLM objective enables the representation to fuse the left and the right context, which allows us to pretrain a deep bidirectional Transformer. In addition to the masked language model, we also use a \"next sentence prediction\" task that jointly pretrains text-pair representations. The contributions of our paper are as follows:\n• We demonstrate the importance of bidirectional pre-training for language representations. Unlike Radford et al. (2018), which uses unidirectional language models for pre-training, BERT uses masked language models to enable pretrained deep bidirectional representations. This is also in contrast to Peters et al. (2018a), which uses a shallow concatenation of independently trained left-to-right and right-to-left LMs.\n• We show that pre-trained representations reduce the need for many heavily-engineered taskspecific architectures. BERT is the first finetuning based representation model that achieves state-of-the-art performance on a large suite of sentence-level and token-level tasks, outperforming many task-specific architectures.\n• BERT advances the state of the art for eleven NLP tasks. The code and pre-trained models are available at https://github.com/ google-research/bert.\n\n2 Related Work\nThere is a long history of pre-training general language representations, and we briefly review the most widely-used approaches in this section.\n\n2.1 Unsupervised Feature-based Approaches\nLearning widely applicable representations of words has been an active area of research for decades, including non-neural (Brown et al., 1992; Ando and Zhang, 2005; Blitzer et al., 2006) and neural (Mikolov et al., 2013; Pennington et al., 2014) methods. Pre-trained word embeddings are an integral part of modern NLP systems, offering significant improvements over embeddings learned from scratch (Turian et al., 2010). To pretrain word embedding vectors, left-to-right language modeling objectives have been used (Mnih and Hinton, 2009), as well as objectives to discriminate correct from incorrect words in left and right context (Mikolov et al., 2013).\nThese approaches have been generalized to coarser granularities, such as sentence embeddings (Kiros et al., 2015; Logeswaran and Lee, 2018) or paragraph embeddings (Le and Mikolov, 2014). To train sentence representations, prior work has used objectives to rank candidate next sentences (Jernite et al., 2017; Logeswaran and Lee, 2018), left-to-right generation of next sentence words given a representation of the previous sentence (Kiros et al., 2015), or denoising autoencoder derived objectives (Hill et al., 2016).\nELMo and its predecessor (Peters et al., 2017 (Peters et al., , 2018a) ) generalize traditional word embedding research along a different dimension. They extract context-sensitive features from a left-to-right and a right-to-left language model. The contextual representation of each token is the concatenation of the left-to-right and right-to-left representations. When integrating contextual word embeddings with existing task-specific architectures, ELMo advances the state of the art for several major NLP benchmarks (Peters et al., 2018a) including question answering (Rajpurkar et al., 2016), sentiment analysis (Socher et al., 2013), and named entity recognition (Tjong Kim Sang and De Meulder, 2003).  Melamud et al. (2016) proposed learning contextual representations through a task to predict a single word from both left and right context using LSTMs. Similar to ELMo, their model is feature-based and not deeply bidirectional.  Fedus et al. (2018) shows that the cloze task can be used to improve the robustness of text generation models.\n\n2.2 Unsupervised Fine-tuning Approaches\nAs with the feature-based approaches, the first works in this direction only pre-trained word embedding parameters from unlabeled text (Collobert and Weston, 2008).\nMore recently, sentence or document encoders which produce contextual token representations have been pre-trained from unlabeled text and fine-tuned for a supervised downstream task (Dai and Le, 2015; Howard and Ruder, 2018; Radford et al., 2018). The advantage of these approaches is that few parameters need to be learned from scratch. At least partly due to this advantage, OpenAI GPT (Radford et al., 2018) achieved previously state-of-the-art results on many sentencelevel tasks from the GLUE benchmark (Wang et al., 2018a). Left-to-right language model-BERT BERTE [CLS] E 1 E [SEP]\n...E N E 1 ' ... E M ' C T 1 T [SEP]\n... ... ...E N E 1 ' ... E M ' C T 1 T [SEP]\n... ing and auto-encoder objectives have been used for pre-training such models (Howard and Ruder, 2018; Radford et al., 2018; Dai and Le, 2015).\n\n2.3 Transfer Learning from Supervised Data\nThere has also been work showing effective transfer from supervised tasks with large datasets, such as natural language inference (Conneau et al., 2017) and machine translation (McCann et al., 2017). Computer vision research has also demonstrated the importance of transfer learning from large pre-trained models, where an effective recipe is to fine-tune models pre-trained with Ima-geNet (Deng et al., 2009; Yosinski et al., 2014).\n\n3 BERT\nWe introduce BERT and its detailed implementation in this section. There are two steps in our framework: pre-training and fine-tuning. During pre-training, the model is trained on unlabeled data over different pre-training tasks. For finetuning, the BERT model is first initialized with the pre-trained parameters, and all of the parameters are fine-tuned using labeled data from the downstream tasks. Each downstream task has separate fine-tuned models, even though they are initialized with the same pre-trained parameters. The question-answering example in Figure 1 will serve as a running example for this section.\nA distinctive feature of BERT is its unified architecture across different tasks. There is mini-mal difference between the pre-trained architecture and the final downstream architecture.\nModel Architecture BERT's model architecture is a multi-layer bidirectional Transformer encoder based on the original implementation described in Vaswani et al. (2017) and released in the tensor2tensor library. 1 Because the use of Transformers has become common and our implementation is almost identical to the original, we will omit an exhaustive background description of the model architecture and refer readers to Vaswani et al. (2017) as well as excellent guides such as \"The Annotated Transformer.\" 2 n this work, we denote the number of layers (i.e., Transformer blocks) as L, the hidden size as H, and the number of self-attention heads as A. 3 We primarily report results on two model sizes: BERT BASE (L=12, H=768, A=12, Total Param-eters=110M) and BERT LARGE (L=24, H=1024, A=16, Total Parameters=340M).\nBERT BASE was chosen to have the same model size as OpenAI GPT for comparison purposes. Critically, however, the BERT Transformer uses bidirectional self-attention, while the GPT Transformer uses constrained self-attention where every token can only attend to context to its left. 4 nput/Output Representations To make BERT handle a variety of down-stream tasks, our input representation is able to unambiguously represent both a single sentence and a pair of sentences (e.g., Question, Answer ) in one token sequence. Throughout this work, a \"sentence\" can be an arbitrary span of contiguous text, rather than an actual linguistic sentence. A \"sequence\" refers to the input token sequence to BERT, which may be a single sentence or two sentences packed together.\nWe use WordPiece embeddings (Wu et al., 2016) with a 30,000 token vocabulary. The first token of every sequence is always a special classification token ([CLS]). The final hidden state corresponding to this token is used as the aggregate sequence representation for classification tasks. Sentence pairs are packed together into a single sequence. We differentiate the sentences in two ways. First, we separate them with a special token ([SEP]). Second, we add a learned embedding to every token indicating whether it belongs to sentence A or sentence B. As shown in Figure 1, we denote input embedding as E, the final hidden vector of the special [CLS] token as C ∈ R H , and the final hidden vector for the i th input token asT i ∈ R H .\nFor a given token, its input representation is constructed by summing the corresponding token, segment, and position embeddings. A visualization of this construction can be seen in Figure 2.\n\n3.1 Pre-training BERT\nUnlike Peters et al. (2018a) and Radford et al. (2018), we do not use traditional left-to-right or right-to-left language models to pre-train BERT. Instead, we pre-train BERT using two unsupervised tasks, described in this section. This step is presented in the left part of Figure 1.\nTask #1: Masked LM Intuitively, it is reasonable to believe that a deep bidirectional model is strictly more powerful than either a left-to-right model or the shallow concatenation of a left-toright and a right-to-left model. Unfortunately, standard conditional language models can only be trained left-to-right or right-to-left, since bidirectional conditioning would allow each word to indirectly \"see itself\", and the model could trivially predict the target word in a multi-layered context.\nformer is often referred to as a \"Transformer encoder\" while the left-context-only version is referred to as a \"Transformer decoder\" since it can be used for text generation.\nIn order to train a deep bidirectional representation, we simply mask some percentage of the input tokens at random, and then predict those masked tokens. We refer to this procedure as a \"masked LM\" (MLM), although it is often referred to as a Cloze task in the literature (Taylor, 1953). In this case, the final hidden vectors corresponding to the mask tokens are fed into an output softmax over the vocabulary, as in a standard LM. In all of our experiments, we mask 15% of all WordPiece tokens in each sequence at random. In contrast to denoising auto-encoders (Vincent et al., 2008), we only predict the masked words rather than reconstructing the entire input.\nAlthough this allows us to obtain a bidirectional pre-trained model, a downside is that we are creating a mismatch between pre-training and fine-tuning, since the [MASK] token does not appear during fine-tuning. To mitigate this, we do not always replace \"masked\" words with the actual [MASK] token. The training data generator chooses 15% of the token positions at random for prediction. If the i-th token is chosen, we replace the i-th token with (1) the [MASK] token 80% of the time (2) a random token 10% of the time (3) the unchanged i-th token 10% of the time. Then, T i will be used to predict the original token with cross entropy loss. We compare variations of this procedure in Appendix C.2.\nTask #2: Next Sentence Prediction (NSP) Many important downstream tasks such as Question Answering (QA) and Natural Language Inference (NLI) are based on understanding the relationship between two sentences, which is not directly captured by language modeling. In order to train a model that understands sentence relationships, we pre-train for a binarized next sentence prediction task that can be trivially generated from any monolingual corpus. Specifically, when choosing the sentences A and B for each pretraining example, 50% of the time B is the actual next sentence that follows A (labeled as IsNext), and 50% of the time it is a random sentence from the corpus (labeled as NotNext). As we show in Figure 1, C is used for next sentence prediction (NSP). 5 Despite its simplicity, we demonstrate in Section 5.1 that pre-training towards this task is very beneficial to both QA and NLI. 6he likes play ##ing [SEP] my dog is cute [SEP] Input E [CLS] E he E likes E play E ##ing E [SEP] E my E dog E is E cute E [SEP] Token Embeddings E A E B E B E B E B E B E A E A E A E A E A Segment Embeddings E 0 E 6 E 7 E 8 E 9 E 10 E 1 E 2 E 3 E 4 E 5\nPosition Embeddings The NSP task is closely related to representationlearning objectives used in Jernite et al. (2017) and Logeswaran and Lee (2018). However, in prior work, only sentence embeddings are transferred to down-stream tasks, where BERT transfers all parameters to initialize end-task model parameters.\n\nPre-training data\nThe pre-training procedure largely follows the existing literature on language model pre-training. For the pre-training corpus we use the BooksCorpus (800M words) (Zhu et al., 2015) and English Wikipedia (2,500M words).\nFor Wikipedia we extract only the text passages and ignore lists, tables, and headers. It is critical to use a document-level corpus rather than a shuffled sentence-level corpus such as the Billion Word Benchmark (Chelba et al., 2013) in order to extract long contiguous sequences.\n\n3.2 Fine-tuning BERT\nFine-tuning is straightforward since the selfattention mechanism in the Transformer allows BERT to model many downstream taskswhether they involve single text or text pairs-by swapping out the appropriate inputs and outputs.\nFor applications involving text pairs, a common pattern is to independently encode text pairs before applying bidirectional cross attention, such as Parikh et al. ( 2016); Seo et al. (2017). BERT instead uses the self-attention mechanism to unify these two stages, as encoding a concatenated text pair with self-attention effectively includes bidirectional cross attention between two sentences.\nFor each task, we simply plug in the taskspecific inputs and outputs into BERT and finetune all the parameters end-to-end. At the input, sentence A and sentence B from pre-training are analogous to (1) sentence pairs in paraphrasing, (2) hypothesis-premise pairs in entailment, (3) question-passage pairs in question answering, and (4) a degenerate text-∅ pair in text classification or sequence tagging. At the output, the token representations are fed into an output layer for tokenlevel tasks, such as sequence tagging or question answering, and the [CLS] representation is fed into an output layer for classification, such as entailment or sentiment analysis.\nCompared to pre-training, fine-tuning is relatively inexpensive. All of the results in the paper can be replicated in at most 1 hour on a single Cloud TPU, or a few hours on a GPU, starting from the exact same pre-trained model. 7 We describe the task-specific details in the corresponding subsections of Section 4. More details can be found in Appendix A.5.\n\n4 Experiments\nIn this section, we present BERT fine-tuning results on 11 NLP tasks.\n\n4.1 GLUE\nThe General Language Understanding Evaluation (GLUE) benchmark (Wang et al., 2018a) is a collection of diverse natural language understanding tasks. Detailed descriptions of GLUE datasets are included in Appendix B.1.\nTo fine-tune on GLUE, we represent the input sequence (for single sentence or sentence pairs) as described in Section 3, and use the final hidden vector C ∈ R H corresponding to the first input token ([CLS]) as the aggregate representation. The only new parameters introduced during fine-tuning are classification layer weights W ∈ R K×H , where K is the number of labels. We compute a standard classification loss with C and W , i.e., log(softmax(CW T )). We use a batch size of 32 and fine-tune for 3 epochs over the data for all GLUE tasks. For each task, we selected the best fine-tuning learning rate (among 5e-5, 4e-5, 3e-5, and 2e-5) on the Dev set. Additionally, for BERT LARGE we found that finetuning was sometimes unstable on small datasets, so we ran several random restarts and selected the best model on the Dev set. With random restarts, we use the same pre-trained checkpoint but perform different fine-tuning data shuffling and classifier layer initialization. 9 Results are presented in Table 1. Both BERT BASE and BERT LARGE outperform all systems on all tasks by a substantial margin, obtaining 4.5% and 7.0% respective average accuracy improvement over the prior state of the art. Note that BERT BASE and OpenAI GPT are nearly identical in terms of model architecture apart from the attention masking. For the largest and most widely reported GLUE task, MNLI, BERT obtains a 4.6% absolute accuracy improvement. On the official GLUE leaderboard 10 , BERT LARGE obtains a score of 80.5, compared to OpenAI GPT, which obtains 72.8 as of the date of writing.\nWe find that BERT LARGE significantly outperforms BERT BASE across all tasks, especially those with very little training data. The effect of model size is explored more thoroughly in Section 5.2.\n\n4.2 SQuAD v1.1\nThe Stanford Question Answering Dataset (SQuAD v1.1) is a collection of 100k crowdsourced question/answer pairs (Rajpurkar et al., 2016). Given a question and a passage from 9 The GLUE data set distribution does not include the Test labels, and we only made a single GLUE evaluation server submission for each of BERTBASE and BERTLARGE.\n10 https://gluebenchmark.com/leaderboard\nWikipedia containing the answer, the task is to predict the answer text span in the passage.\nAs shown in Figure 1, in the question answering task, we represent the input question and passage as a single packed sequence, with the question using the A embedding and the passage using the B embedding. We only introduce a start vector S ∈ R H and an end vector E ∈ R H during fine-tuning. The probability of word i being the start of the answer span is computed as a dot product between T i and S followed by a softmax over all of the words in the paragraph: P i = e S•T i j e S•T j . The analogous formula is used for the end of the answer span. The score of a candidate span from position i to position j is defined as S•T i + E•T j , and the maximum scoring span where j ≥ i is used as a prediction. The training objective is the sum of the log-likelihoods of the correct start and end positions. We fine-tune for 3 epochs with a learning rate of 5e-5 and a batch size of 32.\nTable 2 shows top leaderboard entries as well as results from top published systems (Seo et al., 2017; Clark and Gardner, 2018; Peters et al., 2018a; Hu et al., 2018). The top results from the SQuAD leaderboard do not have up-to-date public system descriptions available, 11 and are allowed to use any public data when training their systems. We therefore use modest data augmentation in our system by first fine-tuning on TriviaQA (Joshi et al., 2017) befor fine-tuning on SQuAD.\nOur best performing system outperforms the top leaderboard system by +1.5 F1 in ensembling and +1.3 F1 as a single system. In fact, our single BERT model outperforms the top ensemble system in terms of F1 score. tuning data, we only lose 0.1-0.4 F1, still outperforming all existing systems by a wide margin. 12 4.3 SQuAD v2.0\nThe SQuAD 2.0 task extends the SQuAD 1.1 problem definition by allowing for the possibility that no short answer exists in the provided paragraph, making the problem more realistic.\nWe use a simple approach to extend the SQuAD v1.1 BERT model for this task. We treat questions that do not have an answer as having an answer span with start and end at the [CLS] token. The probability space for the start and end answer span positions is extended to include the position of the [CLS] token. For prediction, we compare the score of the no-answer span: s null = S•C + E•C to the score of the best non-null span 12 The TriviaQA data we used consists of paragraphs from TriviaQA-Wiki formed of the first 400 tokens in documents, that contain at least one of the provided possible answers. ŝ i,j = max j≥i S•T i + E•T j . We predict a non-null answer when ŝ i,j > s null + τ , where the threshold τ is selected on the dev set to maximize F1. We did not use TriviaQA data for this model. We fine-tuned for 2 epochs with a learning rate of 5e-5 and a batch size of 48.\n\nSystem\nThe results compared to prior leaderboard entries and top published work (Sun et al., 2018; Wang et al., 2018b) are shown in Table 3, excluding systems that use BERT as one of their components. We observe a +5.1 F1 improvement over the previous best system.\n\n4.4 SWAG\nThe Situations With Adversarial Generations (SWAG) dataset contains 113k sentence-pair completion examples that evaluate grounded commonsense inference (Zellers et al., 2018). Given a sentence, the task is to choose the most plausible continuation among four choices.\nWhen fine-tuning on the SWAG dataset, we construct four input sequences, each containing the concatenation of the given sentence (sentence A) and a possible continuation (sentence B). The only task-specific parameters introduced is a vector whose dot product with the [CLS] token representation C denotes a score for each choice which is normalized with a softmax layer.\nWe fine-tune the model for 3 epochs with a learning rate of 2e-5 and a batch size of 16. Results are presented in Table 4. BERT LARGE outperforms the authors' baseline ESIM+ELMo system by +27.1% and OpenAI GPT by 8.3%.\n\n5 Ablation Studies\nIn this section, we perform ablation experiments over a number of facets of BERT in order to better understand their relative importance. Additional ablation studies can be found in Appendix C.\n\n5.1 Effect of Pre-training Tasks\nWe demonstrate the importance of the deep bidirectionality of BERT by evaluating two pretraining objectives using exactly the same pretraining data, fine-tuning scheme, and hyperparameters as BERT BASE :\nNo NSP: A bidirectional model which is trained using the \"masked LM\" (MLM) but without the \"next sentence prediction\" (NSP) task.\n\nLTR & No NSP:\nA left-context-only model which is trained using a standard Left-to-Right (LTR) LM, rather than an MLM. The left-only constraint was also applied at fine-tuning, because removing it introduced a pre-train/fine-tune mismatch that degraded downstream performance. Additionally, this model was pre-trained without the NSP task. This is directly comparable to OpenAI GPT, but using our larger training dataset, our input representation, and our fine-tuning scheme.\nWe first examine the impact brought by the NSP task. In Table 5, we show that removing NSP hurts performance significantly on QNLI, MNLI, and SQuAD 1.1. Next, we evaluate the impact of training bidirectional representations by comparing \"No NSP\" to \"LTR & No NSP\". The LTR model performs worse than the MLM model on all tasks, with large drops on MRPC and SQuAD.\nFor SQuAD it is intuitively clear that a LTR model will perform poorly at token predictions, since the token-level hidden states have no rightside context. In order to make a good faith attempt at strengthening the LTR system, we added a randomly initialized BiLSTM on top. This does significantly improve results on SQuAD, but the results are still far worse than those of the pretrained bidirectional models. The BiLSTM hurts performance on the GLUE tasks.\nWe recognize that it would also be possible to train separate LTR and RTL models and represent each token as the concatenation of the two models, as ELMo does. However: (a) this is twice as expensive as a single bidirectional model; (b) this is non-intuitive for tasks like QA, since the RTL model would not be able to condition the answer on the question; (c) this it is strictly less powerful than a deep bidirectional model, since it can use both left and right context at every layer.\n\n5.2 Effect of Model Size\nIn this section, we explore the effect of model size on fine-tuning task accuracy. We trained a number of BERT models with a differing number of layers, hidden units, and attention heads, while otherwise using the same hyperparameters and training procedure as described previously.\nResults on selected GLUE tasks are shown in Table 6. In this table, we report the average Dev Set accuracy from 5 random restarts of fine-tuning. We can see that larger models lead to a strict accuracy improvement across all four datasets, even for MRPC which only has 3,600 labeled training examples, and is substantially different from the pre-training tasks. It is also perhaps surprising that we are able to achieve such significant improvements on top of models which are already quite large relative to the existing literature. For example, the largest Transformer explored in Vaswani et al. (2017) is (L=6, H=1024, A=16) with 100M parameters for the encoder, and the largest Transformer we have found in the literature is (L=64, H=512, A=2) with 235M parameters (Al-Rfou et al., 2018). By contrast, BERT BASE contains 110M parameters and BERT LARGE contains 340M parameters.\nIt has long been known that increasing the model size will lead to continual improvements on large-scale tasks such as machine translation and language modeling, which is demonstrated by the LM perplexity of held-out training data shown in Table 6. However, we believe that this is the first work to demonstrate convincingly that scaling to extreme model sizes also leads to large improvements on very small scale tasks, provided that the model has been sufficiently pre-trained.  Peters et al. (2018b) presented mixed results on the downstream task impact of increasing the pre-trained bi-LM size from two to four layers and Melamud et al. (2016) mentioned in passing that increasing hidden dimension size from 200 to 600 helped, but increasing further to 1,000 did not bring further improvements. Both of these prior works used a featurebased approach -we hypothesize that when the model is fine-tuned directly on the downstream tasks and uses only a very small number of randomly initialized additional parameters, the taskspecific models can benefit from the larger, more expressive pre-trained representations even when downstream task data is very small.\n\n5.3 Feature-based Approach with BERT\nAll of the BERT results presented so far have used the fine-tuning approach, where a simple classification layer is added to the pre-trained model, and all parameters are jointly fine-tuned on a downstream task. However, the feature-based approach, where fixed features are extracted from the pretrained model, has certain advantages. First, not all tasks can be easily represented by a Transformer encoder architecture, and therefore require a task-specific model architecture to be added. Second, there are major computational benefits to pre-compute an expensive representation of the training data once and then run many experiments with cheaper models on top of this representation.\nIn this section, we compare the two approaches by applying BERT to the CoNLL-2003 Named Entity Recognition (NER) task (Tjong Kim Sang and De Meulder, 2003). In the input to BERT, we use a case-preserving WordPiece model, and we include the maximal document context provided by the data. Following standard practice, we formulate this as a tagging task but do not use a CRF layer in the output. We use the representation of the first sub-token as the input to the token-level classifier over the NER label set.\nTo ablate the fine-tuning approach, we apply the feature-based approach by extracting the activations from one or more layers without fine-tuning any parameters of BERT. These contextual embeddings are used as input to a randomly initialized two-layer 768-dimensional BiLSTM before the classification layer.\nResults are presented in Table 7. BERT LARGE performs competitively with state-of-the-art methods. The best performing method concatenates the token representations from the top four hidden layers of the pre-trained Transformer, which is only 0.3 F1 behind fine-tuning the entire model. This demonstrates that BERT is effective for both finetuning and feature-based approaches.\n\n6 Conclusion\nRecent empirical improvements due to transfer learning with language models have demonstrated that rich, unsupervised pre-training is an integral part of many language understanding systems. In particular, these results enable even low-resource tasks to benefit from deep unidirectional architectures. Our major contribution is further generalizing these findings to deep bidirectional architectures, allowing the same pre-trained model to successfully tackle a broad set of NLP tasks. To generate each training input sequence, we sample two spans of text from the corpus, which we refer to as \"sentences\" even though they are typically much longer than single sentences (but can be shorter also). The first sentence receives the A embedding and the second receives the B embedding. 50% of the time B is the actual next sentence that follows A and 50% of the time it is a random sentence, which is done for the \"next sentence prediction\" task. They are sampled such that the combined length is ≤ 512 tokens. The LM masking is applied after WordPiece tokenization with a uniform masking rate of 15%, and no special consideration given to partial word pieces. We train with batch size of 256 sequences (256 sequences * 512 tokens = 128,000 tokens/batch) for 1,000,000 steps, which is approximately 40 epochs over the 3.3 billion word corpus. We use Adam with learning rate of 1e-4, β 1 = 0.9, β 2 = 0.999, L2 weight decay of 0.01, learning rate warmup over the first 10,000 steps, and linear decay of the learning rate. We use a dropout probability of 0.1 on all layers. We use a gelu activation (Hendrycks and Gimpel, 2016) rather than the standard relu, following OpenAI GPT. The training loss is the sum of the mean masked LM likelihood and the mean next sentence prediction likelihood.E N ... T 1 T 2 T N ... E 1 E 2 E N ... T 1 T 2 T N ... E 1 E 2 E N ...\nTraining of BERT BASE was performed on 4 Cloud TPUs in Pod configuration (16 TPU chips total). 13 Training of BERT LARGE was performed on 16 Cloud TPUs (64 TPU chips total). Each pretraining took 4 days to complete.\nLonger sequences are disproportionately expensive because attention is quadratic to the sequence length. To speed up pretraing in our experiments, we pre-train the model with sequence length of 128 for 90% of the steps. Then, we train the rest 10% of the steps of sequence of 512 to learn the positional embeddings.\n\nA.3 Fine-tuning Procedure\nFor fine-tuning, most model hyperparameters are the same as in pre-training, with the exception of the batch size, learning rate, and number of training epochs. The dropout probability was always kept at 0.1. The optimal hyperparameter values are task-specific, but we found the following range of possible values to work well across all tasks:\n• Batch size: 16, 32\n• Learning rate (Adam): 5e-5, 3e-5, 2e-5 • Number of epochs: 2, 3, 4\nWe also observed that large data sets (e.g., 100k+ labeled training examples) were far less sensitive to hyperparameter choice than small data sets. Fine-tuning is typically very fast, so it is reasonable to simply run an exhaustive search over the above parameters and choose the model that performs best on the development set.\nA.4 Comparison of BERT, ELMo ,and OpenAI GPT\nHere we studies the differences in recent popular representation learning models including ELMo, OpenAI GPT and BERT. The comparisons between the model architectures are shown visually in Figure 3. Note that in addition to the architecture differences, BERT and OpenAI GPT are finetuning approaches, while ELMo is a feature-based approach.\nThe most comparable existing pre-training method to BERT is OpenAI GPT, which trains a left-to-right Transformer LM on a large text corpus. In fact, many of the design decisions in BERT were intentionally made to make it as close to GPT as possible so that the two methods could be minimally compared. The core argument of this work is that the bi-directionality and the two pretraining tasks presented in Section 3.1 account for the majority of the empirical improvements, but we do note that there are several other differences between how BERT and GPT were trained:\n• GPT is trained on the BooksCorpus (800M words); BERT is trained on the BooksCorpus (800M words) and Wikipedia (2,500M words).\n• GPT uses a sentence separator ([SEP]) and classifier token ([CLS]) which are only introduced at fine-tuning time; BERT learns [SEP], [CLS] and sentence A/B embeddings during pre-training.\n• GPT was trained for 1M steps with a batch size of 32,000 words; BERT was trained for 1M steps with a batch size of 128,000 words.\n• GPT used the same learning rate of 5e-5 for all fine-tuning experiments; BERT chooses a task-specific fine-tuning learning rate which performs the best on the development set.\nTo isolate the effect of these differences, we perform ablation experiments in Section 5.1 which demonstrate that the majority of the improvements are in fact coming from the two pre-training tasks and the bidirectionality they enable.\n\nA.5 Illustrations of Fine-tuning on Different Tasks\nThe illustration of fine-tuning BERT on different tasks can be seen in Figure 4. Our task-specific models are formed by incorporating BERT with one additional output layer, so a minimal number of parameters need to be learned from scratch. MNLI Multi-Genre Natural Language Inference is a large-scale, crowdsourced entailment classification task (Williams et al., 2018). Given a pair of sentences, the goal is to predict whether the second sentence is an entailment, contradiction, or neutral with respect to the first one.\nQQP Quora Question Pairs is a binary classification task where the goal is to determine if two questions asked on Quora are semantically equivalent (Chen et al., 2018). QNLI Question Natural Language Inference is a version of the Stanford Question Answering Dataset (Rajpurkar et al., 2016) which has been converted to a binary classification task (Wang et al., 2018a). The positive examples are (question, sentence) pairs which do contain the correct answer, and the negative examples are (question, sentence) from the same paragraph which do not contain the answer.\n\nBERT E\n[CLS] E 1 E [SEP] ... E N E 1 ' ... E M ' C T 1 T [SEP] ... T N T 1 ' ... T M ' [CLS] Tok 1 [SEP] ... Tok N Tok 1 ... Tok M Question Paragraph BERT E [CLS] E 1 E 2 E N C T 1 T 2 T N Single Sentence ... ... BERT Tok 1 Tok 2 Tok N ... [CLS] E [CLS] E 1 E 2 E N C T 1 T 2 T N Single Sentence B-PER O O ... ... E [CLS] E 1 E [SEP] Class Label ... E N E 1 ' ... E M ' C T 1 T [SEP]...\n\nSST-2\nThe Stanford Sentiment Treebank is a binary single-sentence classification task consisting of sentences extracted from movie reviews with human annotations of their sentiment (Socher et al., 2013).\nCoLA The Corpus of Linguistic Acceptability is a binary single-sentence classification task, where the goal is to predict whether an English sentence is linguistically \"acceptable\" or not (Warstadt et al., 2018).\n\nSTS-B\nThe Semantic Textual Similarity Benchmark is a collection of sentence pairs drawn from news headlines and other sources (Cer et al., 2017). They were annotated with a score from 1 to 5 denoting how similar the two sentences are in terms of semantic meaning.\nMRPC Microsoft Research Paraphrase Corpus consists of sentence pairs automatically extracted from online news sources, with human annotations for whether the sentences in the pair are semantically equivalent (Dolan and Brockett, 2005).\nRTE Recognizing Textual Entailment is a binary entailment task similar to MNLI, but with much less training data (Bentivogli et al., 2009). 14 WNLI Winograd NLI is a small natural language inference dataset (Levesque et al., 2011).\nThe GLUE webpage notes that there are issues with the construction of this dataset, 15 and every trained system that's been submitted to GLUE has performed worse than the 65.1 baseline accuracy of predicting the majority class. We therefore exclude this set to be fair to OpenAI GPT. For our GLUE submission, we always predicted the ma-jority class.\n\nC Additional Ablation Studies\n\n\nC.2 Ablation for Different Masking Procedures\nIn Section 3.1, we mention that BERT uses a mixed strategy for masking the target tokens when pre-training with the masked language model (MLM) objective. The following is an ablation study to evaluate the effect of different masking strategies. Note that the purpose of the masking strategies is to reduce the mismatch between pre-training and fine-tuning, as the [MASK] symbol never appears during the fine-tuning stage. We report the Dev results for both MNLI and NER. For NER, we report both fine-tuning and feature-based approaches, as we expect the mismatch will be amplified for the feature-based approach as the model will not have the chance to adjust the representations. The results are presented in Table 8. In the table, MASK means that we replace the target token with the [MASK] symbol for MLM; SAME means that we keep the target token as is; RND means that we replace the target token with another random token.\nThe numbers in the left part of the table represent the probabilities of the specific strategies used during MLM pre-training (BERT uses 80%, 10%, 10%). The right part of the paper represents the Dev set results. For the feature-based approach, we concatenate the last 4 layers of BERT as the features, which was shown to be the best approach in Section 5.3.\nFrom the table it can be seen that fine-tuning is surprisingly robust to different masking strategies. However, as expected, using only the MASK strategy was problematic when applying the featurebased approach to NER. Interestingly, using only the RND strategy performs much worse than our strategy as well.\n\nFootnotes:\n1: https://github.com/tensorflow/tensor2tensor\n2: http://nlp.seas.harvard.edu/2018/04/03/attention.html\n3: In all cases we set the feed-forward/filter size to be\n4: 4H,  i.e., 3072  for the H = 768 and 4096 for the H = 1024.\n5: The final model achieves 97%-98% accuracy on NSP.\n6: The vector C is not a meaningful sentence representation without fine-tuning, since it was trained with NSP.\n7: For example, the BERT SQuAD model can be trained in around 30 minutes on a single Cloud TPU to achieve a Dev F1 score of 91.0%.\n8: See (10)  in https://gluebenchmark.com/faq.\n11: QANet is described in Yu et al. (2018), but the system has improved substantially after publication.\n13: https://cloudplatform.googleblog.com/2018/06/Cloud-TPU-now-offers-preemptible-pricing-and-globalavailability.html\n14: Note that we only report single-task fine-tuning results in this paper. A multitask fine-tuning approach could potentially push the performance even further. For example, we did observe substantial improvements on RTE from multitask training with\n15: MNLI.  15  https://gluebenchmark.com/faq\n\nReferences:\n\n- Alan Akbik, Duncan Blythe, and Roland Vollgraf. 2018. Contextual string embeddings for sequence labeling. In Proceedings of the 27th International Conference on Computational Linguistics, pages 1638-1649.- Rami Al-Rfou, Dokook Choe, Noah Constant, Mandy Guo, and Llion Jones. 2018. Character-level lan- guage modeling with deeper self-attention. arXiv preprint arXiv:1808.04444.\n\n- Rie Kubota Ando and Tong Zhang. 2005. A framework for learning predictive structures from multiple tasks and unlabeled data. Journal of Machine Learning Research, 6(Nov):1817-1853.\n\n- Luisa Bentivogli, Bernardo Magnini, Ido Dagan, Hoa Trang Dang, and Danilo Giampiccolo. 2009. The fifth PASCAL recognizing textual entailment challenge. In TAC. NIST.\n\n- John Blitzer, Ryan McDonald, and Fernando Pereira. 2006. Domain adaptation with structural correspon- dence learning. In Proceedings of the 2006 confer- ence on empirical methods in natural language pro- cessing, pages 120-128. Association for Computa- tional Linguistics.\n\n- Samuel R. Bowman, Gabor Angeli, Christopher Potts, and Christopher D. Manning. 2015. A large anno- tated corpus for learning natural language inference. In EMNLP. Association for Computational Linguis- tics.\n\n- Peter F Brown, Peter V Desouza, Robert L Mercer, Vincent J Della Pietra, and Jenifer C Lai. 1992. Class-based n-gram models of natural language. Computational linguistics, 18(4):467-479.\n\n- Daniel Cer, Mona Diab, Eneko Agirre, Inigo Lopez- Gazpio, and Lucia Specia. 2017. Semeval-2017 task 1: Semantic textual similarity multilingual and crosslingual focused evaluation. In Proceedings of the 11th International Workshop on Semantic Evaluation (SemEval-2017), pages 1-14, Vancou- ver, Canada. Association for Computational Lin- guistics.\n\n- Ciprian Chelba, Tomas Mikolov, Mike Schuster, Qi Ge, Thorsten Brants, Phillipp Koehn, and Tony Robin- son. 2013. One billion word benchmark for measur- ing progress in statistical language modeling. arXiv preprint arXiv:1312.3005.\n\n- Z. Chen, H. Zhang, X. Zhang, and L. Zhao. 2018. Quora question pairs.\n\n- Christopher Clark and Matt Gardner. 2018. Simple and effective multi-paragraph reading comprehen- sion. In ACL.\n\n- Kevin Clark, Minh-Thang Luong, Christopher D Man- ning, and Quoc Le. 2018. Semi-supervised se- quence modeling with cross-view training. In Pro- ceedings of the 2018 Conference on Empirical Meth- ods in Natural Language Processing, pages 1914- 1925.\n\n- Ronan Collobert and Jason Weston. 2008. A unified architecture for natural language processing: Deep neural networks with multitask learning. In Pro- ceedings of the 25th international conference on Machine learning, pages 160-167. ACM.\n\n- Alexis Conneau, Douwe Kiela, Holger Schwenk, Loïc Barrault, and Antoine Bordes. 2017. Supervised learning of universal sentence representations from natural language inference data. In Proceedings of the 2017 Conference on Empirical Methods in Nat- ural Language Processing, pages 670-680, Copen- hagen, Denmark. Association for Computational Linguistics.\n\n- Andrew M Dai and Quoc V Le. 2015. Semi-supervised sequence learning. In Advances in neural informa- tion processing systems, pages 3079-3087.\n\n- J. Deng, W. Dong, R. Socher, L.-J. Li, K. Li, and L. Fei- Fei. 2009. ImageNet: A Large-Scale Hierarchical Image Database. In CVPR09.\n\n- William B Dolan and Chris Brockett. 2005. Automati- cally constructing a corpus of sentential paraphrases. In Proceedings of the Third International Workshop on Paraphrasing (IWP2005).\n\n- William Fedus, Ian Goodfellow, and Andrew M Dai. 2018. Maskgan: Better text generation via filling in the . arXiv preprint arXiv:1801.07736.\n\n- Dan Hendrycks and Kevin Gimpel. 2016. Bridging nonlinearities and stochastic regularizers with gaus- sian error linear units. CoRR, abs/1606.08415. Felix Hill, Kyunghyun Cho, and Anna Korhonen. 2016. Learning distributed representations of sentences from unlabelled data. In Proceedings of the 2016 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies. Association for Computa- tional Linguistics.\n\n- Jeremy Howard and Sebastian Ruder. 2018. Universal language model fine-tuning for text classification. In ACL. Association for Computational Linguistics.\n\n- Minghao Hu, Yuxing Peng, Zhen Huang, Xipeng Qiu, Furu Wei, and Ming Zhou. 2018. Reinforced mnemonic reader for machine reading comprehen- sion. In IJCAI.\n\n- Yacine Jernite, Samuel R. Bowman, and David Son- tag. 2017. Discourse-based objectives for fast un- supervised sentence representation learning. CoRR, abs/1705.00557.\n\n- Mandar Joshi, Eunsol Choi, Daniel S Weld, and Luke Zettlemoyer. 2017. Triviaqa: A large scale distantly supervised challenge dataset for reading comprehen- sion. In ACL.\n\n- Ryan Kiros, Yukun Zhu, Ruslan R Salakhutdinov, Richard Zemel, Raquel Urtasun, Antonio Torralba, and Sanja Fidler. 2015. Skip-thought vectors. In Advances in neural information processing systems, pages 3294-3302.\n\n- Quoc Le and Tomas Mikolov. 2014. Distributed rep- resentations of sentences and documents. In Inter- national Conference on Machine Learning, pages 1188-1196.\n\n- Hector J Levesque, Ernest Davis, and Leora Morgen- stern. 2011. The winograd schema challenge. In Aaai spring symposium: Logical formalizations of commonsense reasoning, volume 46, page 47.\n\n- Lajanugen Logeswaran and Honglak Lee. 2018. An efficient framework for learning sentence represen- tations. In International Conference on Learning Representations.\n\n- Bryan McCann, James Bradbury, Caiming Xiong, and Richard Socher. 2017. Learned in translation: Con- textualized word vectors. In NIPS.\n\n- Oren Melamud, Jacob Goldberger, and Ido Dagan. 2016. context2vec: Learning generic context em- bedding with bidirectional LSTM. In CoNLL.\n\n- Tomas Mikolov, Ilya Sutskever, Kai Chen, Greg S Cor- rado, and Jeff Dean. 2013. Distributed representa- tions of words and phrases and their compositional- ity. In Advances in Neural Information Processing Systems 26, pages 3111-3119. Curran Associates, Inc.\n\n- Andriy Mnih and Geoffrey E Hinton. 2009. A scal- able hierarchical distributed language model. In D. Koller, D. Schuurmans, Y. Bengio, and L. Bot- tou, editors, Advances in Neural Information Pro- cessing Systems 21, pages 1081-1088. Curran As- sociates, Inc.\n\n- Ankur P Parikh, Oscar Täckström, Dipanjan Das, and Jakob Uszkoreit. 2016. A decomposable attention model for natural language inference. In EMNLP.\n\n- Jeffrey Pennington, Richard Socher, and Christo- pher D. Manning. 2014. Glove: Global vectors for word representation. In Empirical Methods in Nat- ural Language Processing (EMNLP), pages 1532- 1543.\n\n- Matthew Peters, Waleed Ammar, Chandra Bhagavat- ula, and Russell Power. 2017. Semi-supervised se- quence tagging with bidirectional language models. In ACL.\n\n- Matthew Peters, Mark Neumann, Mohit Iyyer, Matt Gardner, Christopher Clark, Kenton Lee, and Luke Zettlemoyer. 2018a. Deep contextualized word rep- resentations. In NAACL.\n\n- Matthew Peters, Mark Neumann, Luke Zettlemoyer, and Wen-tau Yih. 2018b. Dissecting contextual word embeddings: Architecture and representation. In Proceedings of the 2018 Conference on Empiri- cal Methods in Natural Language Processing, pages 1499-1509.\n\n- Alec Radford, Karthik Narasimhan, Tim Salimans, and Ilya Sutskever. 2018. Improving language under- standing with unsupervised learning. Technical re- port, OpenAI.\n\n- Pranav Rajpurkar, Jian Zhang, Konstantin Lopyrev, and Percy Liang. 2016. Squad: 100,000+ questions for machine comprehension of text. In Proceedings of the 2016 Conference on Empirical Methods in Nat- ural Language Processing, pages 2383-2392.\n\n- Minjoon Seo, Aniruddha Kembhavi, Ali Farhadi, and Hannaneh Hajishirzi. 2017. Bidirectional attention flow for machine comprehension. In ICLR.\n\n- Richard Socher, Alex Perelygin, Jean Wu, Jason Chuang, Christopher D Manning, Andrew Ng, and Christopher Potts. 2013. Recursive deep models for semantic compositionality over a sentiment tree- bank. In Proceedings of the 2013 conference on empirical methods in natural language processing, pages 1631-1642.\n\n- Fu Sun, Linyang Li, Xipeng Qiu, and Yang Liu. 2018. U-net: Machine reading comprehension with unanswerable questions. arXiv preprint arXiv:1810.06638.\n\n- Wilson L Taylor. 1953. Cloze procedure: A new tool for measuring readability. Journalism Bulletin, 30(4):415-433.\n\n- Erik F Tjong Kim Sang and Fien De Meulder. 2003. Introduction to the conll-2003 shared task: Language-independent named entity recognition. In CoNLL.\n\n- Joseph Turian, Lev Ratinov, and Yoshua Bengio. 2010. Word representations: A simple and general method for semi-supervised learning. In Proceedings of the 48th Annual Meeting of the Association for Compu- tational Linguistics, ACL '10, pages 384-394.\n\n- Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N Gomez, Lukasz Kaiser, and Illia Polosukhin. 2017. Attention is all you need. In Advances in Neural Information Pro- cessing Systems, pages 6000-6010.\n\n- Pascal Vincent, Hugo Larochelle, Yoshua Bengio, and Pierre-Antoine Manzagol. 2008. Extracting and composing robust features with denoising autoen- coders. In Proceedings of the 25th international conference on Machine learning, pages 1096-1103. ACM.\n\n- Alex Wang, Amanpreet Singh, Julian Michael, Fe- lix Hill, Omer Levy, and Samuel Bowman. 2018a. Glue: A multi-task benchmark and analysis platform for natural language understanding. In Proceedings of the 2018 EMNLP Workshop BlackboxNLP: An- alyzing and Interpreting Neural Networks for NLP, pages 353-355.\n\n- Wei Wang, Ming Yan, and Chen Wu. 2018b. Multi- granularity hierarchical attention fusion networks for reading comprehension and question answering. In Proceedings of the 56th Annual Meeting of the As- sociation for Computational Linguistics (Volume 1: Long Papers). Association for Computational Lin- guistics.\n\n- Alex Warstadt, Amanpreet Singh, and Samuel R Bow- man. 2018. Neural network acceptability judg- ments. arXiv preprint arXiv:1805.12471.\n\n- Adina Williams, Nikita Nangia, and Samuel R Bow- man. 2018. A broad-coverage challenge corpus for sentence understanding through inference. In NAACL.\n\n- Yonghui Wu, Mike Schuster, Zhifeng Chen, Quoc V Le, Mohammad Norouzi, Wolfgang Macherey, Maxim Krikun, Yuan Cao, Qin Gao, Klaus Macherey, et al. 2016. Google's neural ma- chine translation system: Bridging the gap between human and machine translation. arXiv preprint arXiv:1609.08144.\n\n- Jason Yosinski, Jeff Clune, Yoshua Bengio, and Hod Lipson. 2014. How transferable are features in deep neural networks? In Advances in neural information processing systems, pages 3320-3328.\n\n- Adams Wei Yu, David Dohan, Minh-Thang Luong, Rui Zhao, Kai Chen, Mohammad Norouzi, and Quoc V Le. 2018. QANet: Combining local convolution with global self-attention for reading comprehen- sion. In ICLR.\n\n- Rowan Zellers, Yonatan Bisk, Roy Schwartz, and Yejin Choi. 2018. Swag: A large-scale adversarial dataset for grounded commonsense inference. In Proceed- ings of the 2018 Conference on Empirical Methods in Natural Language Processing (EMNLP).\n\n- Yukun Zhu, Ryan Kiros, Rich Zemel, Ruslan Salakhut- dinov, Raquel Urtasun, Antonio Torralba, and Sanja Fidler. 2015. Aligning books and movies: Towards story-like visual explanations by watching movies and reading books. In Proceedings of the IEEE international conference on computer vision, pages 19-27.\n\n", "annotations": {"Abstract": [{"begin": 82, "end": 1156, "idx": 0}], "Head": [{"begin": 1159, "end": 1173, "n": "1", "idx": 0}, {"begin": 5050, "end": 5064, "n": "2", "idx": 1}, {"begin": 5211, "end": 5252, "n": "2.1", "idx": 2}, {"begin": 7483, "end": 7522, "n": "2.2", "idx": 3}, {"begin": 8505, "end": 8547, "n": "2.3", "idx": 4}, {"begin": 8983, "end": 8989, "n": "3", "idx": 5}, {"begin": 12308, "end": 12329, "n": "3.1", "idx": 6}, {"begin": 16115, "end": 16132, "idx": 7}, {"begin": 16636, "end": 16656, "n": "3.2", "idx": 8}, {"begin": 18302, "end": 18315, "n": "4", "idx": 9}, {"begin": 18387, "end": 18395, "n": "4.1", "idx": 10}, {"begin": 20387, "end": 20401, "n": "4.2", "idx": 11}, {"begin": 23626, "end": 23632, "idx": 12}, {"begin": 23892, "end": 23900, "n": "4.4", "idx": 13}, {"begin": 24760, "end": 24778, "n": "5", "idx": 14}, {"begin": 24974, "end": 25006, "n": "5.1", "idx": 15}, {"begin": 25342, "end": 25355, "idx": 16}, {"begin": 27129, "end": 27153, "n": "5.2", "idx": 17}, {"begin": 29481, "end": 29517, "n": "5.3", "idx": 18}, {"begin": 31403, "end": 31415, "n": "6", "idx": 19}, {"begin": 33808, "end": 33833, "idx": 20}, {"begin": 36418, "end": 36469, "idx": 21}, {"begin": 37563, "end": 37569, "idx": 22}, {"begin": 37951, "end": 37956, "idx": 23}, {"begin": 38369, "end": 38374, "idx": 24}, {"begin": 39452, "end": 39481, "idx": 25}, {"begin": 39484, "end": 39529, "idx": 26}], "ReferenceToBib": [{"begin": 273, "end": 295, "target": "#b34", "idx": 0}, {"begin": 296, "end": 317, "target": "#b36", "idx": 1}, {"begin": 1295, "end": 1304, "target": "#b14", "idx": 2}, {"begin": 1305, "end": 1326, "target": "#b34", "idx": 3}, {"begin": 1327, "end": 1348, "target": "#b36", "idx": 4}, {"begin": 1349, "end": 1372, "target": "#b19", "idx": 5}, {"begin": 1444, "end": 1465, "target": "#b5", "idx": 6}, {"begin": 1466, "end": 1488, "target": "#b49", "idx": 7}, {"begin": 1506, "end": 1532, "target": "#b16", "idx": 8}, {"begin": 1785, "end": 1822, "target": "#b42", "idx": 9}, {"begin": 1823, "end": 1846, "target": "#b37", "idx": 10}, {"begin": 2025, "end": 2047, "target": "#b34", "idx": 11}, {"begin": 2237, "end": 2259, "target": "#b36", "idx": 12}, {"begin": 3018, "end": 3040, "target": "#b44", "idx": 13}, {"begin": 3581, "end": 3595, "target": "#b41", "idx": 14}, {"begin": 4258, "end": 4279, "target": "#b36", "idx": 15}, {"begin": 4459, "end": 4480, "target": "#b34", "idx": 16}, {"begin": 5375, "end": 5395, "target": "#b6", "idx": 17}, {"begin": 5396, "end": 5417, "target": "#b2", "idx": 18}, {"begin": 5418, "end": 5439, "target": "#b4", "idx": 19}, {"begin": 5451, "end": 5473, "target": "#b29", "idx": 20}, {"begin": 5474, "end": 5498, "target": "#b32", "idx": 21}, {"begin": 5651, "end": 5672, "target": "#b43", "idx": 22}, {"begin": 5768, "end": 5791, "target": "#b30", "idx": 23}, {"begin": 5886, "end": 5908, "target": "#b29", "idx": 24}, {"begin": 6003, "end": 6023, "target": "#b23", "idx": 25}, {"begin": 6024, "end": 6049, "target": "#b26", "idx": 26}, {"begin": 6074, "end": 6096, "target": "#b24", "idx": 27}, {"begin": 6197, "end": 6219, "target": "#b21", "idx": 28}, {"begin": 6220, "end": 6245, "target": "#b26", "idx": 29}, {"begin": 6343, "end": 6363, "target": "#b23", "idx": 30}, {"begin": 6409, "end": 6428, "target": "#b18", "idx": 31}, {"begin": 6455, "end": 6475, "target": "#b33", "idx": 32}, {"begin": 6476, "end": 6502, "target": "#b34", "idx": 33}, {"begin": 6952, "end": 6974, "target": "#b34", "idx": 34}, {"begin": 7004, "end": 7028, "target": "#b37", "idx": 35}, {"begin": 7049, "end": 7070, "target": "#b39", "idx": 36}, {"begin": 7101, "end": 7138, "target": "#b42", "idx": 37}, {"begin": 7141, "end": 7162, "target": "#b28", "idx": 38}, {"begin": 7371, "end": 7390, "target": "#b17", "idx": 39}, {"begin": 7658, "end": 7686, "target": "#b12", "idx": 40}, {"begin": 7879, "end": 7888, "target": "#b14", "idx": 41}, {"begin": 7889, "end": 7912, "target": "#b19", "idx": 42}, {"begin": 7913, "end": 7934, "target": "#b36", "idx": 43}, {"begin": 8076, "end": 8098, "target": "#b36", "idx": 44}, {"begin": 8196, "end": 8216, "target": "#b46", "idx": 45}, {"begin": 8438, "end": 8462, "target": "#b19", "idx": 46}, {"begin": 8463, "end": 8484, "target": "#b36", "idx": 47}, {"begin": 8485, "end": 8502, "target": "#b14", "idx": 48}, {"begin": 8678, "end": 8700, "target": "#b13", "idx": 49}, {"begin": 8725, "end": 8746, "target": "#b27", "idx": 50}, {"begin": 8938, "end": 8957, "target": "#b15", "idx": 51}, {"begin": 8958, "end": 8980, "target": "#b51", "idx": 52}, {"begin": 9942, "end": 9963, "target": "#b44", "idx": 53}, {"begin": 10216, "end": 10237, "target": "#b44", "idx": 54}, {"begin": 11405, "end": 11422, "target": "#b50", "idx": 55}, {"begin": 11530, "end": 11536, "idx": 56}, {"begin": 11813, "end": 11819, "idx": 57}, {"begin": 12337, "end": 12358, "target": "#b34", "idx": 58}, {"begin": 12363, "end": 12384, "target": "#b36", "idx": 59}, {"begin": 13558, "end": 13572, "target": "#b41", "idx": 60}, {"begin": 13849, "end": 13871, "target": "#b45", "idx": 61}, {"begin": 15897, "end": 15918, "target": "#b21", "idx": 62}, {"begin": 15923, "end": 15948, "target": "#b26", "idx": 63}, {"begin": 16296, "end": 16314, "target": "#b54", "idx": 64}, {"begin": 16566, "end": 16587, "target": "#b8", "idx": 65}, {"begin": 17054, "end": 17071, "target": "#b38", "idx": 66}, {"begin": 18459, "end": 18478, "target": "#b46", "idx": 67}, {"begin": 20514, "end": 20538, "target": "#b37", "idx": 68}, {"begin": 21840, "end": 21858, "target": "#b38", "idx": 69}, {"begin": 21859, "end": 21883, "target": "#b10", "idx": 70}, {"begin": 21884, "end": 21905, "target": "#b34", "idx": 71}, {"begin": 21906, "end": 21922, "target": "#b20", "idx": 72}, {"begin": 22188, "end": 22208, "target": "#b22", "idx": 73}, {"begin": 23706, "end": 23724, "target": "#b40", "idx": 74}, {"begin": 23725, "end": 23744, "target": "#b47", "idx": 75}, {"begin": 24053, "end": 24075, "target": "#b53", "idx": 76}, {"begin": 28020, "end": 28041, "target": "#b44", "idx": 77}, {"begin": 28206, "end": 28228, "target": "#b1", "idx": 78}, {"begin": 28800, "end": 28821, "target": "#b35", "idx": 79}, {"begin": 28945, "end": 28966, "target": "#b28", "idx": 80}, {"begin": 30324, "end": 30361, "target": "#b42", "idx": 81}, {"begin": 33010, "end": 33038, "target": "#b18", "idx": 82}, {"begin": 34617, "end": 34632, "idx": 83}, {"begin": 36816, "end": 36839, "target": "#b49", "idx": 84}, {"begin": 37142, "end": 37161, "target": "#b9", "idx": 85}, {"begin": 37260, "end": 37284, "target": "#b37", "idx": 86}, {"begin": 37342, "end": 37362, "target": "#b46", "idx": 87}, {"begin": 38132, "end": 38153, "target": "#b39", "idx": 88}, {"begin": 38343, "end": 38366, "target": "#b48", "idx": 89}, {"begin": 38495, "end": 38513, "target": "#b7", "idx": 90}, {"begin": 38841, "end": 38867, "target": "#b16", "idx": 91}, {"begin": 38982, "end": 39007, "target": "#b3", "idx": 92}, {"begin": 39076, "end": 39099, "target": "#b25", "idx": 93}], "ReferenceToFootnote": [{"begin": 10007, "end": 10008, "target": "#foot_0", "idx": 0}, {"begin": 10303, "end": 10304, "target": "#foot_1", "idx": 1}, {"begin": 10449, "end": 10450, "target": "#foot_2", "idx": 2}, {"begin": 10894, "end": 10895, "target": "#foot_3", "idx": 3}, {"begin": 15415, "end": 15416, "target": "#foot_4", "idx": 4}, {"begin": 15546, "end": 15547, "target": "#foot_5", "idx": 5}, {"begin": 18171, "end": 18172, "target": "#foot_6", "idx": 6}, {"begin": 22028, "end": 22030, "target": "#foot_8", "idx": 7}, {"begin": 33370, "end": 33372, "target": "#foot_9", "idx": 8}, {"begin": 39009, "end": 39011, "target": "#foot_10", "idx": 9}], "SectionFootnote": [{"begin": 41126, "end": 42223, "idx": 0}], "ReferenceString": [{"begin": 42240, "end": 42444, "id": "b0", "idx": 0}, {"begin": 42446, "end": 42618, "id": "b1", "idx": 1}, {"begin": 42622, "end": 42802, "id": "b2", "idx": 2}, {"begin": 42806, "end": 42971, "id": "b3", "idx": 3}, {"begin": 42975, "end": 43247, "id": "b4", "idx": 4}, {"begin": 43251, "end": 43458, "id": "b5", "idx": 5}, {"begin": 43462, "end": 43648, "id": "b6", "idx": 6}, {"begin": 43652, "end": 43999, "id": "b7", "idx": 7}, {"begin": 44003, "end": 44233, "id": "b8", "idx": 8}, {"begin": 44237, "end": 44306, "id": "b9", "idx": 9}, {"begin": 44310, "end": 44421, "id": "b10", "idx": 10}, {"begin": 44425, "end": 44674, "id": "b11", "idx": 11}, {"begin": 44678, "end": 44914, "id": "b12", "idx": 12}, {"begin": 44918, "end": 45273, "id": "b13", "idx": 13}, {"begin": 45277, "end": 45418, "id": "b14", "idx": 14}, {"begin": 45422, "end": 45554, "id": "b15", "idx": 15}, {"begin": 45558, "end": 45742, "id": "b16", "idx": 16}, {"begin": 45746, "end": 45886, "id": "b17", "idx": 17}, {"begin": 45890, "end": 46353, "id": "b18", "idx": 18}, {"begin": 46357, "end": 46510, "id": "b19", "idx": 19}, {"begin": 46514, "end": 46667, "id": "b20", "idx": 20}, {"begin": 46671, "end": 46837, "id": "b21", "idx": 21}, {"begin": 46841, "end": 47010, "id": "b22", "idx": 22}, {"begin": 47014, "end": 47226, "id": "b23", "idx": 23}, {"begin": 47230, "end": 47388, "id": "b24", "idx": 24}, {"begin": 47392, "end": 47581, "id": "b25", "idx": 25}, {"begin": 47585, "end": 47749, "id": "b26", "idx": 26}, {"begin": 47753, "end": 47887, "id": "b27", "idx": 27}, {"begin": 47891, "end": 48028, "id": "b28", "idx": 28}, {"begin": 48032, "end": 48290, "id": "b29", "idx": 29}, {"begin": 48294, "end": 48553, "id": "b30", "idx": 30}, {"begin": 48557, "end": 48703, "id": "b31", "idx": 31}, {"begin": 48707, "end": 48906, "id": "b32", "idx": 32}, {"begin": 48910, "end": 49066, "id": "b33", "idx": 33}, {"begin": 49070, "end": 49240, "id": "b34", "idx": 34}, {"begin": 49244, "end": 49497, "id": "b35", "idx": 35}, {"begin": 49501, "end": 49665, "id": "b36", "idx": 36}, {"begin": 49669, "end": 49912, "id": "b37", "idx": 37}, {"begin": 49916, "end": 50057, "id": "b38", "idx": 38}, {"begin": 50061, "end": 50367, "id": "b39", "idx": 39}, {"begin": 50371, "end": 50521, "id": "b40", "idx": 40}, {"begin": 50525, "end": 50638, "id": "b41", "idx": 41}, {"begin": 50642, "end": 50791, "id": "b42", "idx": 42}, {"begin": 50795, "end": 51045, "id": "b43", "idx": 43}, {"begin": 51049, "end": 51279, "id": "b44", "idx": 44}, {"begin": 51283, "end": 51532, "id": "b45", "idx": 45}, {"begin": 51536, "end": 51841, "id": "b46", "idx": 46}, {"begin": 51845, "end": 52155, "id": "b47", "idx": 47}, {"begin": 52159, "end": 52294, "id": "b48", "idx": 48}, {"begin": 52298, "end": 52447, "id": "b49", "idx": 49}, {"begin": 52451, "end": 52736, "id": "b50", "idx": 50}, {"begin": 52740, "end": 52930, "id": "b51", "idx": 51}, {"begin": 52934, "end": 53137, "id": "b52", "idx": 52}, {"begin": 53141, "end": 53382, "id": "b53", "idx": 53}, {"begin": 53386, "end": 53691, "id": "b54", "idx": 54}], "ReferenceToTable": [{"begin": 19625, "end": 19626, "target": "#tab_2", "idx": 0}, {"begin": 21762, "end": 21763, "target": "#tab_3", "idx": 1}, {"begin": 23764, "end": 23765, "target": "#tab_4", "idx": 2}, {"begin": 24660, "end": 24661, "target": "#tab_5", "idx": 3}, {"begin": 25879, "end": 25880, "idx": 4}, {"begin": 27487, "end": 27488, "target": "#tab_7", "idx": 5}, {"begin": 28565, "end": 28566, "target": "#tab_7", "idx": 6}, {"begin": 31055, "end": 31056, "target": "#tab_8", "idx": 7}, {"begin": 40247, "end": 40248, "target": "#tab_12", "idx": 8}], "Footnote": [{"begin": 41137, "end": 41183, "id": "foot_0", "n": "1", "idx": 0}, {"begin": 41184, "end": 41240, "id": "foot_1", "n": "2", "idx": 1}, {"begin": 41241, "end": 41298, "id": "foot_2", "n": "3", "idx": 2}, {"begin": 41299, "end": 41361, "id": "foot_3", "n": "4", "idx": 3}, {"begin": 41362, "end": 41414, "id": "foot_4", "n": "5", "idx": 4}, {"begin": 41415, "end": 41526, "id": "foot_5", "n": "6", "idx": 5}, {"begin": 41527, "end": 41657, "id": "foot_6", "n": "7", "idx": 6}, {"begin": 41658, "end": 41704, "id": "foot_7", "n": "8", "idx": 7}, {"begin": 41705, "end": 41809, "id": "foot_8", "n": "11", "idx": 8}, {"begin": 41810, "end": 41927, "id": "foot_9", "n": "13", "idx": 9}, {"begin": 41928, "end": 42178, "id": "foot_10", "n": "14", "idx": 10}, {"begin": 42179, "end": 42223, "id": "foot_11", "n": "15", "idx": 11}], "ReferenceToFormula": [{"begin": 17047, "end": 17051, "idx": 0}], "Paragraph": [{"begin": 92, "end": 740, "idx": 0}, {"begin": 741, "end": 1156, "idx": 1}, {"begin": 1174, "end": 1847, "idx": 2}, {"begin": 1848, "end": 2556, "idx": 3}, {"begin": 2557, "end": 3283, "idx": 4}, {"begin": 3284, "end": 4158, "idx": 5}, {"begin": 4159, "end": 4578, "idx": 6}, {"begin": 4579, "end": 4898, "idx": 7}, {"begin": 4899, "end": 5048, "idx": 8}, {"begin": 5065, "end": 5209, "idx": 9}, {"begin": 5253, "end": 5909, "idx": 10}, {"begin": 5910, "end": 6429, "idx": 11}, {"begin": 6430, "end": 7481, "idx": 12}, {"begin": 7523, "end": 7687, "idx": 13}, {"begin": 7688, "end": 8256, "idx": 14}, {"begin": 8276, "end": 8279, "idx": 15}, {"begin": 8313, "end": 8324, "idx": 16}, {"begin": 8358, "end": 8503, "idx": 17}, {"begin": 8548, "end": 8981, "idx": 18}, {"begin": 8990, "end": 9608, "idx": 19}, {"begin": 9609, "end": 9795, "idx": 20}, {"begin": 9796, "end": 10612, "idx": 21}, {"begin": 10613, "end": 11376, "idx": 22}, {"begin": 11377, "end": 12104, "idx": 23}, {"begin": 12116, "end": 12306, "idx": 24}, {"begin": 12330, "end": 12614, "idx": 25}, {"begin": 12615, "end": 13109, "idx": 26}, {"begin": 13110, "end": 13284, "idx": 27}, {"begin": 13285, "end": 13950, "idx": 28}, {"begin": 13951, "end": 14652, "idx": 29}, {"begin": 14653, "end": 15547, "idx": 30}, {"begin": 15800, "end": 16113, "idx": 31}, {"begin": 16133, "end": 16352, "idx": 32}, {"begin": 16353, "end": 16634, "idx": 33}, {"begin": 16657, "end": 16881, "idx": 34}, {"begin": 16882, "end": 17277, "idx": 35}, {"begin": 17278, "end": 17941, "idx": 36}, {"begin": 17942, "end": 18300, "idx": 37}, {"begin": 18316, "end": 18385, "idx": 38}, {"begin": 18396, "end": 18613, "idx": 39}, {"begin": 18614, "end": 20189, "idx": 40}, {"begin": 20190, "end": 20385, "idx": 41}, {"begin": 20402, "end": 20738, "idx": 42}, {"begin": 20739, "end": 20779, "idx": 43}, {"begin": 20780, "end": 20872, "idx": 44}, {"begin": 20873, "end": 21755, "idx": 45}, {"begin": 21756, "end": 22236, "idx": 46}, {"begin": 22237, "end": 22563, "idx": 47}, {"begin": 22564, "end": 22745, "idx": 48}, {"begin": 22746, "end": 23624, "idx": 49}, {"begin": 23633, "end": 23890, "idx": 50}, {"begin": 23901, "end": 24168, "idx": 51}, {"begin": 24169, "end": 24539, "idx": 52}, {"begin": 24540, "end": 24758, "idx": 53}, {"begin": 24779, "end": 24972, "idx": 54}, {"begin": 25007, "end": 25210, "idx": 55}, {"begin": 25211, "end": 25340, "idx": 56}, {"begin": 25356, "end": 25816, "idx": 57}, {"begin": 25817, "end": 26179, "idx": 58}, {"begin": 26180, "end": 26638, "idx": 59}, {"begin": 26639, "end": 27127, "idx": 60}, {"begin": 27154, "end": 27436, "idx": 61}, {"begin": 27437, "end": 28318, "idx": 62}, {"begin": 28319, "end": 29479, "idx": 63}, {"begin": 29518, "end": 30205, "idx": 64}, {"begin": 30206, "end": 30715, "idx": 65}, {"begin": 30716, "end": 31023, "idx": 66}, {"begin": 31024, "end": 31401, "idx": 67}, {"begin": 31416, "end": 33203, "idx": 68}, {"begin": 33275, "end": 33490, "idx": 69}, {"begin": 33491, "end": 33806, "idx": 70}, {"begin": 33834, "end": 34178, "idx": 71}, {"begin": 34179, "end": 34199, "idx": 72}, {"begin": 34200, "end": 34268, "idx": 73}, {"begin": 34269, "end": 34598, "idx": 74}, {"begin": 34599, "end": 34643, "idx": 75}, {"begin": 34644, "end": 34983, "idx": 76}, {"begin": 34984, "end": 35552, "idx": 77}, {"begin": 35553, "end": 35680, "idx": 78}, {"begin": 35681, "end": 35870, "idx": 79}, {"begin": 35871, "end": 36002, "idx": 80}, {"begin": 36003, "end": 36180, "idx": 81}, {"begin": 36181, "end": 36416, "idx": 82}, {"begin": 36470, "end": 36993, "idx": 83}, {"begin": 36994, "end": 37561, "idx": 84}, {"begin": 37946, "end": 37949, "idx": 85}, {"begin": 37957, "end": 38154, "idx": 86}, {"begin": 38155, "end": 38367, "idx": 87}, {"begin": 38375, "end": 38632, "idx": 88}, {"begin": 38633, "end": 38868, "idx": 89}, {"begin": 38869, "end": 39100, "idx": 90}, {"begin": 39101, "end": 39450, "idx": 91}, {"begin": 39530, "end": 40457, "idx": 92}, {"begin": 40458, "end": 40816, "idx": 93}, {"begin": 40817, "end": 41124, "idx": 94}], "SectionHeader": [{"begin": 0, "end": 1156, "idx": 0}], "SectionReference": [{"begin": 42225, "end": 53693, "idx": 0}], "Sentence": [{"begin": 92, "end": 227, "idx": 0}, {"begin": 228, "end": 472, "idx": 1}, {"begin": 473, "end": 740, "idx": 2}, {"begin": 741, "end": 794, "idx": 3}, {"begin": 795, "end": 1156, "idx": 4}, {"begin": 1174, "end": 1373, "idx": 5}, {"begin": 1374, "end": 1847, "idx": 6}, {"begin": 1848, "end": 1983, "idx": 7}, {"begin": 1984, "end": 2150, "idx": 8}, {"begin": 2151, "end": 2393, "idx": 9}, {"begin": 2394, "end": 2556, "idx": 10}, {"begin": 2557, "end": 2687, "idx": 11}, {"begin": 2688, "end": 2843, "idx": 12}, {"begin": 2844, "end": 3041, "idx": 13}, {"begin": 3042, "end": 3283, "idx": 14}, {"begin": 3284, "end": 3418, "idx": 15}, {"begin": 3419, "end": 3596, "idx": 16}, {"begin": 3597, "end": 3777, "idx": 17}, {"begin": 3778, "end": 3973, "idx": 18}, {"begin": 3974, "end": 4111, "idx": 19}, {"begin": 4112, "end": 4158, "idx": 20}, {"begin": 4159, "end": 4250, "idx": 21}, {"begin": 4251, "end": 4430, "idx": 22}, {"begin": 4431, "end": 4578, "idx": 23}, {"begin": 4579, "end": 4693, "idx": 24}, {"begin": 4694, "end": 4898, "idx": 25}, {"begin": 4899, "end": 4957, "idx": 26}, {"begin": 4958, "end": 5026, "idx": 27}, {"begin": 5027, "end": 5048, "idx": 28}, {"begin": 5065, "end": 5209, "idx": 29}, {"begin": 5253, "end": 5507, "idx": 30}, {"begin": 5508, "end": 5673, "idx": 31}, {"begin": 5674, "end": 5909, "idx": 32}, {"begin": 5910, "end": 6097, "idx": 33}, {"begin": 6098, "end": 6429, "idx": 34}, {"begin": 6430, "end": 6578, "idx": 35}, {"begin": 6579, "end": 6675, "idx": 36}, {"begin": 6676, "end": 6796, "idx": 37}, {"begin": 6797, "end": 7139, "idx": 38}, {"begin": 7140, "end": 7293, "idx": 39}, {"begin": 7294, "end": 7369, "idx": 40}, {"begin": 7370, "end": 7481, "idx": 41}, {"begin": 7523, "end": 7687, "idx": 42}, {"begin": 7688, "end": 7935, "idx": 43}, {"begin": 7936, "end": 8025, "idx": 44}, {"begin": 8026, "end": 8217, "idx": 45}, {"begin": 8218, "end": 8256, "idx": 46}, {"begin": 8276, "end": 8279, "idx": 47}, {"begin": 8313, "end": 8324, "idx": 48}, {"begin": 8358, "end": 8503, "idx": 49}, {"begin": 8548, "end": 8747, "idx": 50}, {"begin": 8748, "end": 8981, "idx": 51}, {"begin": 8990, "end": 9056, "idx": 52}, {"begin": 9057, "end": 9124, "idx": 53}, {"begin": 9125, "end": 9219, "idx": 54}, {"begin": 9220, "end": 9391, "idx": 55}, {"begin": 9392, "end": 9515, "idx": 56}, {"begin": 9516, "end": 9608, "idx": 57}, {"begin": 9609, "end": 9690, "idx": 58}, {"begin": 9691, "end": 9795, "idx": 59}, {"begin": 9796, "end": 10304, "idx": 60}, {"begin": 10305, "end": 10612, "idx": 61}, {"begin": 10613, "end": 10700, "idx": 62}, {"begin": 10701, "end": 10895, "idx": 63}, {"begin": 10896, "end": 11131, "idx": 64}, {"begin": 11132, "end": 11254, "idx": 65}, {"begin": 11255, "end": 11376, "idx": 66}, {"begin": 11377, "end": 11454, "idx": 67}, {"begin": 11455, "end": 11538, "idx": 68}, {"begin": 11539, "end": 11664, "idx": 69}, {"begin": 11665, "end": 11723, "idx": 70}, {"begin": 11724, "end": 11767, "idx": 71}, {"begin": 11768, "end": 11821, "idx": 72}, {"begin": 11822, "end": 12104, "idx": 73}, {"begin": 12116, "end": 12244, "idx": 74}, {"begin": 12245, "end": 12306, "idx": 75}, {"begin": 12330, "end": 12477, "idx": 76}, {"begin": 12478, "end": 12561, "idx": 77}, {"begin": 12562, "end": 12614, "idx": 78}, {"begin": 12615, "end": 12840, "idx": 79}, {"begin": 12841, "end": 13109, "idx": 80}, {"begin": 13110, "end": 13284, "idx": 81}, {"begin": 13285, "end": 13439, "idx": 82}, {"begin": 13440, "end": 13573, "idx": 83}, {"begin": 13574, "end": 13718, "idx": 84}, {"begin": 13719, "end": 13809, "idx": 85}, {"begin": 13810, "end": 13950, "idx": 86}, {"begin": 13951, "end": 14162, "idx": 87}, {"begin": 14163, "end": 14250, "idx": 88}, {"begin": 14251, "end": 14339, "idx": 89}, {"begin": 14340, "end": 14517, "idx": 90}, {"begin": 14518, "end": 14595, "idx": 91}, {"begin": 14596, "end": 14652, "idx": 92}, {"begin": 14653, "end": 14913, "idx": 93}, {"begin": 14914, "end": 15100, "idx": 94}, {"begin": 15101, "end": 15344, "idx": 95}, {"begin": 15345, "end": 15416, "idx": 96}, {"begin": 15417, "end": 15547, "idx": 97}, {"begin": 15800, "end": 15949, "idx": 98}, {"begin": 15950, "end": 16113, "idx": 99}, {"begin": 16133, "end": 16231, "idx": 100}, {"begin": 16232, "end": 16352, "idx": 101}, {"begin": 16353, "end": 16439, "idx": 102}, {"begin": 16440, "end": 16634, "idx": 103}, {"begin": 16657, "end": 16881, "idx": 104}, {"begin": 16882, "end": 17072, "idx": 105}, {"begin": 17073, "end": 17277, "idx": 106}, {"begin": 17278, "end": 17400, "idx": 107}, {"begin": 17401, "end": 17682, "idx": 108}, {"begin": 17683, "end": 17941, "idx": 109}, {"begin": 17942, "end": 18006, "idx": 110}, {"begin": 18007, "end": 18172, "idx": 111}, {"begin": 18173, "end": 18257, "idx": 112}, {"begin": 18258, "end": 18300, "idx": 113}, {"begin": 18316, "end": 18385, "idx": 114}, {"begin": 18396, "end": 18544, "idx": 115}, {"begin": 18545, "end": 18613, "idx": 116}, {"begin": 18614, "end": 18854, "idx": 117}, {"begin": 18855, "end": 18986, "idx": 118}, {"begin": 18987, "end": 19070, "idx": 119}, {"begin": 19071, "end": 19157, "idx": 120}, {"begin": 19158, "end": 19270, "idx": 121}, {"begin": 19271, "end": 19444, "idx": 122}, {"begin": 19445, "end": 19593, "idx": 123}, {"begin": 19594, "end": 19627, "idx": 124}, {"begin": 19628, "end": 19815, "idx": 125}, {"begin": 19816, "end": 19936, "idx": 126}, {"begin": 19937, "end": 20045, "idx": 127}, {"begin": 20046, "end": 20189, "idx": 128}, {"begin": 20190, "end": 20316, "idx": 129}, {"begin": 20317, "end": 20385, "idx": 130}, {"begin": 20402, "end": 20539, "idx": 131}, {"begin": 20540, "end": 20738, "idx": 132}, {"begin": 20739, "end": 20779, "idx": 133}, {"begin": 20780, "end": 20872, "idx": 134}, {"begin": 20873, "end": 21078, "idx": 135}, {"begin": 21079, "end": 21165, "idx": 136}, {"begin": 21166, "end": 21361, "idx": 137}, {"begin": 21362, "end": 21423, "idx": 138}, {"begin": 21424, "end": 21579, "idx": 139}, {"begin": 21580, "end": 21676, "idx": 140}, {"begin": 21677, "end": 21755, "idx": 141}, {"begin": 21756, "end": 21923, "idx": 142}, {"begin": 21924, "end": 22098, "idx": 143}, {"begin": 22099, "end": 22236, "idx": 144}, {"begin": 22237, "end": 22359, "idx": 145}, {"begin": 22360, "end": 22448, "idx": 146}, {"begin": 22449, "end": 22482, "idx": 147}, {"begin": 22483, "end": 22548, "idx": 148}, {"begin": 22549, "end": 22563, "idx": 149}, {"begin": 22564, "end": 22745, "idx": 150}, {"begin": 22746, "end": 22821, "idx": 151}, {"begin": 22822, "end": 22931, "idx": 152}, {"begin": 22932, "end": 23053, "idx": 153}, {"begin": 23054, "end": 23347, "idx": 154}, {"begin": 23348, "end": 23379, "idx": 155}, {"begin": 23380, "end": 23499, "idx": 156}, {"begin": 23500, "end": 23544, "idx": 157}, {"begin": 23545, "end": 23624, "idx": 158}, {"begin": 23633, "end": 23826, "idx": 159}, {"begin": 23827, "end": 23890, "idx": 160}, {"begin": 23901, "end": 24076, "idx": 161}, {"begin": 24077, "end": 24168, "idx": 162}, {"begin": 24169, "end": 24352, "idx": 163}, {"begin": 24353, "end": 24539, "idx": 164}, {"begin": 24540, "end": 24758, "idx": 165}, {"begin": 24779, "end": 24916, "idx": 166}, {"begin": 24917, "end": 24972, "idx": 167}, {"begin": 25007, "end": 25210, "idx": 168}, {"begin": 25211, "end": 25340, "idx": 169}, {"begin": 25356, "end": 25459, "idx": 170}, {"begin": 25460, "end": 25617, "idx": 171}, {"begin": 25618, "end": 25680, "idx": 172}, {"begin": 25681, "end": 25816, "idx": 173}, {"begin": 25817, "end": 25869, "idx": 174}, {"begin": 25870, "end": 25969, "idx": 175}, {"begin": 25970, "end": 26081, "idx": 176}, {"begin": 26082, "end": 26179, "idx": 177}, {"begin": 26180, "end": 26335, "idx": 178}, {"begin": 26336, "end": 26453, "idx": 179}, {"begin": 26454, "end": 26590, "idx": 180}, {"begin": 26591, "end": 26638, "idx": 181}, {"begin": 26639, "end": 26798, "idx": 182}, {"begin": 26799, "end": 27127, "idx": 183}, {"begin": 27154, "end": 27236, "idx": 184}, {"begin": 27237, "end": 27436, "idx": 185}, {"begin": 27437, "end": 27489, "idx": 186}, {"begin": 27490, "end": 27582, "idx": 187}, {"begin": 27583, "end": 27798, "idx": 188}, {"begin": 27799, "end": 27970, "idx": 189}, {"begin": 27971, "end": 28229, "idx": 190}, {"begin": 28230, "end": 28318, "idx": 191}, {"begin": 28319, "end": 28567, "idx": 192}, {"begin": 28568, "end": 28798, "idx": 193}, {"begin": 28799, "end": 29117, "idx": 194}, {"begin": 29118, "end": 29479, "idx": 195}, {"begin": 29518, "end": 29729, "idx": 196}, {"begin": 29730, "end": 29852, "idx": 197}, {"begin": 29853, "end": 30008, "idx": 198}, {"begin": 30009, "end": 30205, "idx": 199}, {"begin": 30206, "end": 30362, "idx": 200}, {"begin": 30363, "end": 30492, "idx": 201}, {"begin": 30493, "end": 30599, "idx": 202}, {"begin": 30600, "end": 30715, "idx": 203}, {"begin": 30716, "end": 30885, "idx": 204}, {"begin": 30886, "end": 31023, "idx": 205}, {"begin": 31024, "end": 31122, "idx": 206}, {"begin": 31123, "end": 31310, "idx": 207}, {"begin": 31311, "end": 31401, "idx": 208}, {"begin": 31416, "end": 31606, "idx": 209}, {"begin": 31607, "end": 31717, "idx": 210}, {"begin": 31718, "end": 31901, "idx": 211}, {"begin": 31902, "end": 32113, "idx": 212}, {"begin": 32114, "end": 32198, "idx": 213}, {"begin": 32199, "end": 32359, "idx": 214}, {"begin": 32360, "end": 32423, "idx": 215}, {"begin": 32424, "end": 32573, "idx": 216}, {"begin": 32574, "end": 32755, "idx": 217}, {"begin": 32756, "end": 32933, "idx": 218}, {"begin": 32934, "end": 32984, "idx": 219}, {"begin": 32985, "end": 33091, "idx": 220}, {"begin": 33092, "end": 33203, "idx": 221}, {"begin": 33275, "end": 33372, "idx": 222}, {"begin": 33373, "end": 33448, "idx": 223}, {"begin": 33449, "end": 33490, "idx": 224}, {"begin": 33491, "end": 33595, "idx": 225}, {"begin": 33596, "end": 33710, "idx": 226}, {"begin": 33711, "end": 33806, "idx": 227}, {"begin": 33834, "end": 33994, "idx": 228}, {"begin": 33995, "end": 34042, "idx": 229}, {"begin": 34043, "end": 34178, "idx": 230}, {"begin": 34179, "end": 34199, "idx": 231}, {"begin": 34200, "end": 34268, "idx": 232}, {"begin": 34269, "end": 34417, "idx": 233}, {"begin": 34418, "end": 34598, "idx": 234}, {"begin": 34599, "end": 34643, "idx": 235}, {"begin": 34644, "end": 34761, "idx": 236}, {"begin": 34762, "end": 34841, "idx": 237}, {"begin": 34842, "end": 34983, "idx": 238}, {"begin": 34984, "end": 35123, "idx": 239}, {"begin": 35124, "end": 35285, "idx": 240}, {"begin": 35286, "end": 35552, "idx": 241}, {"begin": 35553, "end": 35680, "idx": 242}, {"begin": 35681, "end": 35870, "idx": 243}, {"begin": 35871, "end": 36002, "idx": 244}, {"begin": 36003, "end": 36180, "idx": 245}, {"begin": 36181, "end": 36416, "idx": 246}, {"begin": 36470, "end": 36709, "idx": 247}, {"begin": 36710, "end": 36840, "idx": 248}, {"begin": 36841, "end": 36993, "idx": 249}, {"begin": 36994, "end": 37162, "idx": 250}, {"begin": 37163, "end": 37363, "idx": 251}, {"begin": 37364, "end": 37561, "idx": 252}, {"begin": 37946, "end": 37949, "idx": 253}, {"begin": 37957, "end": 38154, "idx": 254}, {"begin": 38155, "end": 38367, "idx": 255}, {"begin": 38375, "end": 38514, "idx": 256}, {"begin": 38515, "end": 38632, "idx": 257}, {"begin": 38633, "end": 38868, "idx": 258}, {"begin": 38869, "end": 39011, "idx": 259}, {"begin": 39012, "end": 39100, "idx": 260}, {"begin": 39101, "end": 39328, "idx": 261}, {"begin": 39329, "end": 39384, "idx": 262}, {"begin": 39385, "end": 39450, "idx": 263}, {"begin": 39530, "end": 39684, "idx": 264}, {"begin": 39685, "end": 39775, "idx": 265}, {"begin": 39776, "end": 39952, "idx": 266}, {"begin": 39953, "end": 40001, "idx": 267}, {"begin": 40002, "end": 40211, "idx": 268}, {"begin": 40212, "end": 40249, "idx": 269}, {"begin": 40250, "end": 40457, "idx": 270}, {"begin": 40458, "end": 40610, "idx": 271}, {"begin": 40611, "end": 40670, "idx": 272}, {"begin": 40671, "end": 40816, "idx": 273}, {"begin": 40817, "end": 40919, "idx": 274}, {"begin": 40920, "end": 41034, "idx": 275}, {"begin": 41035, "end": 41124, "idx": 276}], "ReferenceToFigure": [{"begin": 9557, "end": 9558, "target": "#fig_0", "idx": 0}, {"begin": 11950, "end": 11951, "target": "#fig_0", "idx": 1}, {"begin": 12304, "end": 12305, "target": "#fig_1", "idx": 2}, {"begin": 12612, "end": 12613, "target": "#fig_0", "idx": 3}, {"begin": 15366, "end": 15367, "target": "#fig_0", "idx": 4}, {"begin": 20892, "end": 20893, "target": "#fig_0", "idx": 5}, {"begin": 34839, "end": 34840, "target": "#fig_2", "idx": 6}, {"begin": 36548, "end": 36549, "target": "#fig_3", "idx": 7}], "Div": [{"begin": 92, "end": 1156, "idx": 0}, {"begin": 1159, "end": 5048, "idx": 1}, {"begin": 5050, "end": 5209, "idx": 2}, {"begin": 5211, "end": 7481, "idx": 3}, {"begin": 7483, "end": 8503, "idx": 4}, {"begin": 8505, "end": 8981, "idx": 5}, {"begin": 8983, "end": 12306, "idx": 6}, {"begin": 12308, "end": 16113, "idx": 7}, {"begin": 16115, "end": 16634, "idx": 8}, {"begin": 16636, "end": 18300, "idx": 9}, {"begin": 18302, "end": 18385, "idx": 10}, {"begin": 18387, "end": 20385, "idx": 11}, {"begin": 20387, "end": 23624, "idx": 12}, {"begin": 23626, "end": 23890, "idx": 13}, {"begin": 23892, "end": 24758, "idx": 14}, {"begin": 24760, "end": 24972, "idx": 15}, {"begin": 24974, "end": 25340, "idx": 16}, {"begin": 25342, "end": 27127, "idx": 17}, {"begin": 27129, "end": 29479, "idx": 18}, {"begin": 29481, "end": 31401, "idx": 19}, {"begin": 31403, "end": 33806, "idx": 20}, {"begin": 33808, "end": 36416, "idx": 21}, {"begin": 36418, "end": 37561, "idx": 22}, {"begin": 37563, "end": 37949, "idx": 23}, {"begin": 37951, "end": 38367, "idx": 24}, {"begin": 38369, "end": 39450, "idx": 25}, {"begin": 39452, "end": 39482, "idx": 26}, {"begin": 39484, "end": 41124, "idx": 27}], "SectionMain": [{"begin": 1156, "end": 41124, "idx": 0}]}}