{"text": "WikiHow: A Large Scale Text Summarization Dataset\n\nAbstract:\nSequence-to-sequence models have recently gained the state of the art performance in summarization. However, not too many large-scale high-quality datasets are available and almost all the available ones are mainly news articles with specific writing style. Moreover, abstractive human-style systems involving description of the content at a deeper level require data with higher levels of abstraction. In this paper, we present WikiHow, a dataset of more than 230,000 article and summary pairs extracted and constructed from an online knowledge base written by different human authors. The articles span a wide range of topics and therefore represent high diversity styles. We evaluate the performance of the existing methods on WikiHow to present its challenges and set some baselines to further improve it.\n\n\n1 Introduction\nSummarization as the process of generating a shorter version of a piece of text while preserving important context information is one of the most challenging NLP tasks. Sequence-to-sequence neural networks have recently obtained significant performance improvements on summarization (Rush et al., 2015; Chopra et al., 2016). However, the existence of large-scale datasets is the key to success of these models. Moreover, the length of the articles and the diversity in their styles can create more complications.\nAlmost all existing summarization datasets such as DUC (Harman and Over, 2004), Gigaword (Napoles et al., 2012), New York Times (Sandhaus, 2008) and CNN/Daily Mail (Nallapati et al., 2016) consist of news articles. The news articles have their own specific styles and therefore the systems trained on only news may not be generalized well. On the other hand, the existing datasets may not be large enough (DUC) to train a sequence-to-sequence model, the summaries may be limited to only headlines (Gigaword), they may be more useful as an extractive summarization dataset (New York Times) and their abstraction level might be limited (CNN/Daily mail).\nTo overcome the issues of the existing datasets, we present a new large-scale dataset called Wiki-How using the online WikiHow 1 knowledge base. It contains articles about various topics written in different styles making them different form existing news datasets. Each article consists of multiple paragraphs and each paragraph starts with a sentence summarizing it. By merging the paragraphs to form the article and the paragraph outlines to form the summary, the resulting version of the dataset contains more than 200,000 longsequence pairs. We then present two features to show how abstractive our dataset is. Finally, we analyze the performance of some of the existing extractive and abstractive systems on WikiHow as benchmarks for further studies. The contribution of this work is three-fold:\n• We introduce a large-scale, diverse dataset with various writing styles, convenient for long-sequence text summarization.\n• We introduce level of abstractedness and compression ratio metrics to show how abstractive the new dataset is.\n• We evaluate the performance of the existing systems on WikiHow to create benchmarks and understand the challenges better.\n\n2 Existing Datasets\nThere are several datasets used to evaluate the summarization systems. We briefly describe the properties of these datasets as follows.\nThe Lead The most important information about an event Who? What? Where? When? Why? How?\nThe Body The crucial information expanding the topic Argument, Controversy, Story, Evidence,\n\nBackground details\nThe Tail Extra information Interesting, related items. Journalist Assessment\n\nDUC:\nThe Document Understanding Conference dataset (Harman and Over, 2004) contains 500 news articles and their summaries capped at 75 bytes. The summaries are written by human authors and there exist more than one summary per article which is its major advantage over other existing datasets. The DUC dataset cannot be used for training models with large number of parameters and therefore is used along with other datasets (Rush et al., 2015; Nallapati et al., 2017). Gigaword: Another collection of news articles used for summarization is Gigaword (Napoles et al., 2012). The original articles in the dataset do not have summaries paired with them. However, some prior work (Rush et al., 2015; Chopra et al., 2016) used a subset of this dataset and constructed pairs of summaries by using the first line of the article and its headline, making the dataset suitable for short text summarization tasks. New York Times: The New York Times (NYT) dataset (Sandhaus, 2008) is a large collection of articles published between 1996 and 2007. While this dataset has been mainly used for extractive systems (Hong and Nenkova, 2014; Durrett et al., 2016), Paulus et al. (2017) are the first to evaluate their abstractive system using NYT. CNN/Daily Mail: This dataset mainly used in recent summarization papers (Nallapati et al., 2016; See et al., 2017; Nallapati et al., 2017) consists of online CNN and Daily Mail news articles and was originally developed for question/answering systems. The highlights associated with each article are concatenated to form the summary. Two versions of this dataset depending on the preprocessing exist.  Nallapati et al. (2017) has used the entity anonymization to create the anonymized version of the dataset while See et al. (2017) NEWSROOM: This corpus (Grusky et al., 2018) is the most recent large-scale dataset introduced for text summarization. It consists of diverse summaries combining abstractive and extractive strategies yet it is another news dataset and the average length of summaries are limited to 26.7.\n\n3 WikiHow Dataset\nThe existing summarization datasets, consist of news articles. These articles are written by journalists and follow the journalistic style. The journalists usually follow the Inverted Pyramid style (Po¨ttker, 2003) (depicted in Figure 1) to prioritize and structure a text by starting with mentioning the most important, interesting or attentiongrabbing elements of a story in the opening paragraphs and later adding details and any background information. This writing style might be the cause why lead-3 baselines (where the first three sentences are selected to form the summary) usually score higher compared to the existing summarization systems. We introduce a new dataset called WikiHow, obtained from WikiHow data dump. This dataset contains articles written by ordinary people, not journalists, describing the steps of doing a task throughout the text. Therefore, the Inverted Pyramid does not apply to it as all parts of the text can be of similar importance.\n\n3.1 WikiHow Knowledge Base\nThe WikiHow knowledge base contains online articles describing a procedural task about various topics (from arts and entertainment to computers and electronics) with multiple methods or steps and new articles are added to it regularly. Each article consists of a title starting with \"How to\" and a short description of the article. There are two types of articles: the first type of articles describe single-method tasks in different steps, while the second type of articles represent multiple steps of different methods for a task. Each step description starts with a bold line summarizing that step and is followed by a more detailed explanation. A truncated example of a WikiHow article and how the data pairs are constructed is shown in Figure 2.\nWait for a full load of clothing before running a washing machine. Washing machines take up a lot of water and electricity, so running a cycle for a couple of articles of clothing is inefficient. Hold off on laundry until you can fill the machine.\nTurn off the water when you're not using it. Avoid letting the water run while you're brushing your teeth or shaving. Keep your hoses and faucets turned off as much as possible. When you need them, use them sparingly.\nTake quicker showers to conserve water. One easy way to conserve water is to cut down on your shower time.\nPractice cutting your showers down to 10 minutes, then 7, then 5. Challenge yourself to take a shorter shower every day.\n\n3.2 Data Extraction and Dataset Construction\nWe made use of the python Scrapy 2 library to write a crawler to get the data from the Wiki-How website. The articles classified into 20 different categories, cover a wide range of topics. Our crawler was able to obtain 142, 783 unique articles (some containing more than one method) at the time of crawling (new articles are added regularly). To prepare the data for the summarization task, each method (if any) described in the article is considered as a separate article. To generate the reference summaries, bold lines representing the summary of the steps are extracted and concatenated. The remaining parts of the steps (the detailed descriptions) are also concatenated to form the source article. After this step, 230, 843 articles and reference summaries are generated. There are some articles with only the bold lines i.e. there is no more explanation for the steps, so they cannot be used for the summarization task. To filter out these articles, we used a size threshold so that pairs with summaries longer than the article size will be removed. The final dataset is made of 204, 004 articles and their summaries. The statistics of the dataset are shown in Table 1. The dataset is released to the public 3.\n\n4 WikiHow Properties\nThe large scale of the WikiHow dataset by having more than 230, 000 pairs, and its average article and summary lengths makes it a better choice compared to DUC and Gigaword corpus.\nWe also define two metrics to represent the abstraction level of WikiHow by comparing it with CNN/Daily mail known as one of the most abstractive and common datasets in recent summarization papers (Nallapati et al., 2016 (Nallapati et al., , 2017;; See et al., 2017; Paulus et al., 2017).\n\n4.1 Level of Abstractedness\nAbstractedness of the dataset is measured by calculating the unique n-grams in the reference summary which are not in the article. The comparison is shown in Figure 3. Except for common unigrams, bi-grams and trigrams between the articles, and the summaries, no other common n-grams exist in the WikiHow pairs. The higher level of abstractedness creates new challenges for the summarization systems as they have to be more creative in generating more novel summaries.\n\n4.2 Compression Ratio\nWe define compression ratio to characterize the summarization. We first calculate the average length of sentences for both the articles and the summaries. The compression ratio is then defined as the ratio between the average length of sentences and the average length of summaries. The higher the compression ratio, the more difficult the summarization task, as it needs to capture  higher levels of abstraction and semantics. Table 3 shows the results for WikiHow and CNN/Daily Mail. The higher compression ratio of WikiHow shows the need for higher levels of abstraction.\n\n5 Experiments\nWe evaluate the performance of the WikiHow dataset using existing extractive and abstractive baselines. The systems used and the results generated for WikiHow and CNN/Daily mail are described in the following sections.\n\n5.1 Evaluated Systems\nTextRank Extractive system: An extractive summarization system (Mihalcea and Tarau, 2004; Barrios et al., 2016) using a graph-based ranking method to select sentences from the article and form the summary.\nSequence-to-sequence model with attention: A baseline system applied by Chopra et al. (2016); Nallapati et al. (2016) to abstractive summarization task to generate summaries using the predefined vocabulary. This baseline is not able to handle Out of Vocabulary words (OOVs).\nPointer-generator abstractive system: A pointer-generator mechanism (See et al., 2017) allowing the model to freely switch between copying a word from the input sequence or generating a word form the predefined vocabulary. Pointer-generator with coverage abstractive system: The pointer-generator baseline with added coverage loss (See et al., 2017) to reduce the repetition in the final generated summary. Lead-3 baseline: A baseline selecting the first three sentences of the article to form the summary. This baseline cannot be directly used for the Wiki-How dataset as the first 3 sentences of each article only describe a small portion of the whole article. We created the Lead-3 baseline by extracting the first sentence of each paragraph and concatenated them to create the summary.\n\n5.2 Results\nTo study the performance of the evaluated systems, we used the Pyrouge package 4 to report the F1 score for ROUGE-1, ROUGE-2 and ROUGE-L (Lin, 2004) and the METEOR (Banerjee and Lavie, 2005) 5 both based on the exact matches and on inclusion of stem, paraphrasing and synonyms (s/p/s) to evaluate the methods . Table 2 represents the results of multiple baselines on both the CNN/Daily Mail (the well-known, most common abstractive summarization dataset) and also the proposed WikiHow dataset. As it can be seen, the summarization systems perform a lot better on CNN/Daily mail compared to the WikiHow dataset with lead-3 outperforming other baselines due to the news inverted pyramid writing style described earlier. On the other hand, the poor performance of lead-3 on WikiHow shows the different writing styles in its articles. Moreover, all baselines perform about 10 ROUGE scores better on the CNN/Daily mail compared to the WikiHow. This difference suggests new features and aspects inherent in the new dataset which can be used to further improve the summarization systems.\n\n6 Conclusion\nWe present WikiHow, a new large-scale summarization dataset consisting of diverse articles form WikiHow knowledge base. The WikiHow features discussed in the paper can create new challenges to the summarization systems. We hope that the new dataset can attract researchers attention as a choice to evaluate their systems.\n\nFootnotes:\n1: http://www.wikihow.com/\n2: https://scrapy.org/\n3: https://github.com/mahnazkoupaee/ WikiHow-Dataset\n4: pypi.python.org/pypi/pyrouge/0.1.3\n5: www.cs.cmu.edu/ ˜alavie/METEOR\n\nReferences:\n\n- Satanjeev Banerjee and Alon Lavie. 2005. Meteor: An automatic metric for mt evaluation with improved correlation with human judgments. In Proceedings of the acl workshop on intrinsic and extrinsic evalu- ation measures for machine translation and/or sum- marization, pages 65-72.- Federico Barrios, Federico López, Luis Argerich, and Rosa Wachenchauzer. 2016. Variations of the simi- larity function of textrank for automated summariza- tion. arXiv preprint arXiv:1602.03606.\n\n- Sumit Chopra, Michael Auli, Alexander M Rush, and SEAS Harvard. 2016. Abstractive sentence summa- rization with attentive recurrent neural networks. In HLT-NAACL, pages 93-98.\n\n- Greg Durrett, Taylor Berg-Kirkpatrick, and Dan Klein. 2016. Learning-based single-document summariza- tion with compression and anaphoricity constraints. arXiv preprint arXiv:1603.08887.\n\n- Max Grusky, Mor Naaman, and Yoav Artzi. 2018. Newsroom: A dataset of 1.3 million summaries with diverse extractive strategies. In Proceedings of the 2018 Conference of the North American Chapter of the Association for Computational Linguistics: Hu- man Language Technologies, Volume 1 (Long Pa- pers), volume 1, pages 708-719.\n\n- Donna Harman and Paul Over. 2004. The effects of hu- man variation in duc summarization evaluation. Text Summarization Branches Out.\n\n- Kai Hong and Ani Nenkova. 2014. Improving the estimation of word importance for news multi- document summarization. In Proceedings of the 14th Conference of the European Chapter of the As- sociation for Computational Linguistics, pages 712- 721.\n\n- Chin-Yew Lin. 2004. Rouge: A package for auto- matic evaluation of summaries. In Text summariza- tion branches out: Proceedings of the ACL-04 work- shop, volume 8. Barcelona, Spain.\n\n- Rada Mihalcea and Paul Tarau. 2004. Textrank: Bring- ing order into text. In Proceedings of the 2004 con- ference on empirical methods in natural language processing.\n\n- Ramesh Nallapati, Feifei Zhai, and Bowen Zhou. 2017. Summarunner: A recurrent neural network based se- quence model for extractive summarization of docu- ments. AAAI.\n\n- Ramesh Nallapati, Bowen Zhou, Cicero dos Santos, C ¸a glar Gulc ¸ehre, and Bing Xiang. 2016. Abstrac- tive text summarization using sequence-to-sequence rnns and beyond. CoNLL 2016, page 280.\n\n- Courtney Napoles, Matthew Gormley, and Benjamin Van Durme. 2012. Annotated gigaword. In Pro- ceedings of the Joint Workshop on Automatic Knowl- edge Base Construction and Web-scale Knowledge Extraction, pages 95-100. Association for Compu- tational Linguistics.\n\n- Romain Paulus, Caiming Xiong, and Richard Socher. 2017. A deep reinforced model for abstractive sum- marization. arXiv preprint arXiv:1705.04304.\n\n- Horst Po¨ttker. 2003. News and its communicative quality: The inverted pyramidwhen and why did it appear? Journalism Studies, 4(4):501-511.\n\n- Alexander M Rush, Sumit Chopra, and Jason We- ston. 2015. A neural attention model for ab- stractive sentence summarization. arXiv preprint arXiv:1509.00685.\n\n- Evan Sandhaus. 2008. The new york times annotated corpus. Linguistic Data Consortium, Philadelphia, 6(12):e26752.\n\n- Abigail See, Peter J Liu, and Christopher D Manning. 2017. Get to the point: Summarization with pointer- generator networks. ACL.\n\n", "annotations": {"Abstract": [{"begin": 51, "end": 870, "idx": 0}], "Head": [{"begin": 873, "end": 887, "n": "1", "idx": 0}, {"begin": 3217, "end": 3236, "n": "2", "idx": 1}, {"begin": 3556, "end": 3574, "idx": 2}, {"begin": 3653, "end": 3657, "idx": 3}, {"begin": 5704, "end": 5721, "n": "3", "idx": 4}, {"begin": 6693, "end": 6719, "n": "3.1", "idx": 5}, {"begin": 8166, "end": 8210, "n": "3.2", "idx": 6}, {"begin": 9430, "end": 9450, "n": "4", "idx": 7}, {"begin": 9922, "end": 9949, "n": "4.1", "idx": 8}, {"begin": 10419, "end": 10440, "n": "4.2", "idx": 9}, {"begin": 11017, "end": 11030, "n": "5", "idx": 10}, {"begin": 11251, "end": 11272, "n": "5.1", "idx": 11}, {"begin": 12545, "end": 12556, "n": "5.2", "idx": 12}, {"begin": 13639, "end": 13651, "n": "6", "idx": 13}], "ReferenceToBib": [{"begin": 1171, "end": 1190, "target": "#b14", "idx": 0}, {"begin": 1191, "end": 1211, "target": "#b2", "idx": 1}, {"begin": 1456, "end": 1479, "target": "#b5", "idx": 2}, {"begin": 1490, "end": 1512, "target": "#b11", "idx": 3}, {"begin": 1529, "end": 1545, "target": "#b15", "idx": 4}, {"begin": 1565, "end": 1589, "target": "#b10", "idx": 5}, {"begin": 3704, "end": 3726, "target": "#b5", "idx": 6}, {"begin": 4078, "end": 4097, "target": "#b14", "idx": 7}, {"begin": 4098, "end": 4121, "target": "#b9", "idx": 8}, {"begin": 4204, "end": 4226, "target": "#b11", "idx": 9}, {"begin": 4330, "end": 4349, "target": "#b14", "idx": 10}, {"begin": 4350, "end": 4370, "target": "#b2", "idx": 11}, {"begin": 4606, "end": 4622, "target": "#b15", "idx": 12}, {"begin": 4753, "end": 4777, "target": "#b6", "idx": 13}, {"begin": 4778, "end": 4799, "target": "#b3", "idx": 14}, {"begin": 4801, "end": 4821, "target": "#b12", "idx": 15}, {"begin": 4956, "end": 4980, "target": "#b10", "idx": 16}, {"begin": 4981, "end": 4998, "target": "#b16", "idx": 17}, {"begin": 4999, "end": 5022, "target": "#b9", "idx": 18}, {"begin": 5286, "end": 5309, "target": "#b9", "idx": 19}, {"begin": 5398, "end": 5415, "target": "#b16", "idx": 20}, {"begin": 5438, "end": 5459, "target": "#b4", "idx": 21}, {"begin": 5920, "end": 5936, "target": "#b13", "idx": 22}, {"begin": 9829, "end": 9852, "target": "#b10", "idx": 23}, {"begin": 9853, "end": 9880, "target": "#b9", "idx": 24}, {"begin": 9881, "end": 9898, "target": "#b16", "idx": 25}, {"begin": 9899, "end": 9919, "target": "#b12", "idx": 26}, {"begin": 11336, "end": 11362, "target": "#b8", "idx": 27}, {"begin": 11363, "end": 11383, "target": "#b1", "idx": 28}, {"begin": 11551, "end": 11571, "target": "#b2", "idx": 29}, {"begin": 11573, "end": 11596, "target": "#b10", "idx": 30}, {"begin": 11822, "end": 11840, "target": "#b16", "idx": 31}, {"begin": 12085, "end": 12103, "target": "#b16", "idx": 32}, {"begin": 12694, "end": 12705, "target": "#b7", "idx": 33}], "ReferenceToFootnote": [{"begin": 2180, "end": 2181, "target": "#foot_0", "idx": 0}, {"begin": 8244, "end": 8245, "target": "#foot_1", "idx": 1}, {"begin": 9426, "end": 9427, "target": "#foot_2", "idx": 2}, {"begin": 12636, "end": 12637, "target": "#foot_3", "idx": 3}, {"begin": 12748, "end": 12749, "target": "#foot_4", "idx": 4}], "SectionFootnote": [{"begin": 13975, "end": 14160, "idx": 0}], "ReferenceString": [{"begin": 14177, "end": 14456, "id": "b0", "idx": 0}, {"begin": 14458, "end": 14652, "id": "b1", "idx": 1}, {"begin": 14656, "end": 14831, "id": "b2", "idx": 2}, {"begin": 14835, "end": 15021, "id": "b3", "idx": 3}, {"begin": 15025, "end": 15351, "id": "b4", "idx": 4}, {"begin": 15355, "end": 15487, "id": "b5", "idx": 5}, {"begin": 15491, "end": 15736, "id": "b6", "idx": 6}, {"begin": 15740, "end": 15921, "id": "b7", "idx": 7}, {"begin": 15925, "end": 16091, "id": "b8", "idx": 8}, {"begin": 16095, "end": 16261, "id": "b9", "idx": 9}, {"begin": 16265, "end": 16456, "id": "b10", "idx": 10}, {"begin": 16460, "end": 16721, "id": "b11", "idx": 11}, {"begin": 16725, "end": 16870, "id": "b12", "idx": 12}, {"begin": 16874, "end": 17013, "id": "b13", "idx": 13}, {"begin": 17017, "end": 17174, "id": "b14", "idx": 14}, {"begin": 17178, "end": 17291, "id": "b15", "idx": 15}, {"begin": 17295, "end": 17424, "id": "b16", "idx": 16}], "ReferenceToTable": [{"begin": 9385, "end": 9386, "target": "#tab_0", "idx": 0}, {"begin": 10875, "end": 10876, "target": "#tab_2", "idx": 1}, {"begin": 12874, "end": 12875, "target": "#tab_1", "idx": 2}], "Footnote": [{"begin": 13986, "end": 14012, "id": "foot_0", "n": "1", "idx": 0}, {"begin": 14013, "end": 14035, "id": "foot_1", "n": "2", "idx": 1}, {"begin": 14036, "end": 14088, "id": "foot_2", "n": "3", "idx": 2}, {"begin": 14089, "end": 14126, "id": "foot_3", "n": "4", "idx": 3}, {"begin": 14127, "end": 14160, "id": "foot_4", "n": "5", "idx": 4}], "Paragraph": [{"begin": 61, "end": 870, "idx": 0}, {"begin": 888, "end": 1400, "idx": 1}, {"begin": 1401, "end": 2052, "idx": 2}, {"begin": 2053, "end": 2854, "idx": 3}, {"begin": 2855, "end": 2978, "idx": 4}, {"begin": 2979, "end": 3091, "idx": 5}, {"begin": 3092, "end": 3215, "idx": 6}, {"begin": 3237, "end": 3372, "idx": 7}, {"begin": 3373, "end": 3461, "idx": 8}, {"begin": 3462, "end": 3554, "idx": 9}, {"begin": 3575, "end": 3651, "idx": 10}, {"begin": 3658, "end": 5702, "idx": 11}, {"begin": 5722, "end": 6691, "idx": 12}, {"begin": 6720, "end": 7470, "idx": 13}, {"begin": 7471, "end": 7718, "idx": 14}, {"begin": 7719, "end": 7936, "idx": 15}, {"begin": 7937, "end": 8043, "idx": 16}, {"begin": 8044, "end": 8164, "idx": 17}, {"begin": 8211, "end": 9428, "idx": 18}, {"begin": 9451, "end": 9631, "idx": 19}, {"begin": 9632, "end": 9920, "idx": 20}, {"begin": 9950, "end": 10417, "idx": 21}, {"begin": 10441, "end": 11015, "idx": 22}, {"begin": 11031, "end": 11249, "idx": 23}, {"begin": 11273, "end": 11478, "idx": 24}, {"begin": 11479, "end": 11753, "idx": 25}, {"begin": 11754, "end": 12543, "idx": 26}, {"begin": 12557, "end": 13637, "idx": 27}, {"begin": 13652, "end": 13973, "idx": 28}], "SectionHeader": [{"begin": 0, "end": 870, "idx": 0}], "SectionReference": [{"begin": 14162, "end": 17426, "idx": 0}], "Sentence": [{"begin": 61, "end": 160, "idx": 0}, {"begin": 161, "end": 318, "idx": 1}, {"begin": 319, "end": 463, "idx": 2}, {"begin": 464, "end": 647, "idx": 3}, {"begin": 648, "end": 735, "idx": 4}, {"begin": 736, "end": 870, "idx": 5}, {"begin": 888, "end": 1056, "idx": 6}, {"begin": 1057, "end": 1212, "idx": 7}, {"begin": 1213, "end": 1298, "idx": 8}, {"begin": 1299, "end": 1400, "idx": 9}, {"begin": 1401, "end": 1615, "idx": 10}, {"begin": 1616, "end": 1740, "idx": 11}, {"begin": 1741, "end": 2052, "idx": 12}, {"begin": 2053, "end": 2197, "idx": 13}, {"begin": 2198, "end": 2318, "idx": 14}, {"begin": 2319, "end": 2421, "idx": 15}, {"begin": 2422, "end": 2599, "idx": 16}, {"begin": 2600, "end": 2668, "idx": 17}, {"begin": 2669, "end": 2809, "idx": 18}, {"begin": 2810, "end": 2854, "idx": 19}, {"begin": 2855, "end": 2978, "idx": 20}, {"begin": 2979, "end": 3091, "idx": 21}, {"begin": 3092, "end": 3215, "idx": 22}, {"begin": 3237, "end": 3307, "idx": 23}, {"begin": 3308, "end": 3372, "idx": 24}, {"begin": 3373, "end": 3438, "idx": 25}, {"begin": 3439, "end": 3445, "idx": 26}, {"begin": 3446, "end": 3451, "idx": 27}, {"begin": 3452, "end": 3461, "idx": 28}, {"begin": 3462, "end": 3554, "idx": 29}, {"begin": 3575, "end": 3629, "idx": 30}, {"begin": 3630, "end": 3651, "idx": 31}, {"begin": 3658, "end": 3794, "idx": 32}, {"begin": 3795, "end": 3946, "idx": 33}, {"begin": 3947, "end": 4122, "idx": 34}, {"begin": 4123, "end": 4227, "idx": 35}, {"begin": 4228, "end": 4304, "idx": 36}, {"begin": 4305, "end": 4556, "idx": 37}, {"begin": 4557, "end": 4689, "idx": 38}, {"begin": 4690, "end": 4883, "idx": 39}, {"begin": 4884, "end": 5135, "idx": 40}, {"begin": 5136, "end": 5217, "idx": 41}, {"begin": 5218, "end": 5284, "idx": 42}, {"begin": 5285, "end": 5533, "idx": 43}, {"begin": 5534, "end": 5702, "idx": 44}, {"begin": 5722, "end": 5784, "idx": 45}, {"begin": 5785, "end": 5861, "idx": 46}, {"begin": 5862, "end": 6178, "idx": 47}, {"begin": 6179, "end": 6373, "idx": 48}, {"begin": 6374, "end": 6449, "idx": 49}, {"begin": 6450, "end": 6583, "idx": 50}, {"begin": 6584, "end": 6691, "idx": 51}, {"begin": 6720, "end": 6955, "idx": 52}, {"begin": 6956, "end": 7051, "idx": 53}, {"begin": 7052, "end": 7252, "idx": 54}, {"begin": 7253, "end": 7368, "idx": 55}, {"begin": 7369, "end": 7470, "idx": 56}, {"begin": 7471, "end": 7537, "idx": 57}, {"begin": 7538, "end": 7666, "idx": 58}, {"begin": 7667, "end": 7718, "idx": 59}, {"begin": 7719, "end": 7763, "idx": 60}, {"begin": 7764, "end": 7836, "idx": 61}, {"begin": 7837, "end": 7896, "idx": 62}, {"begin": 7897, "end": 7936, "idx": 63}, {"begin": 7937, "end": 7976, "idx": 64}, {"begin": 7977, "end": 8043, "idx": 65}, {"begin": 8044, "end": 8164, "idx": 66}, {"begin": 8211, "end": 8315, "idx": 67}, {"begin": 8316, "end": 8399, "idx": 68}, {"begin": 8400, "end": 8554, "idx": 69}, {"begin": 8555, "end": 8685, "idx": 70}, {"begin": 8686, "end": 8803, "idx": 71}, {"begin": 8804, "end": 8914, "idx": 72}, {"begin": 8915, "end": 8988, "idx": 73}, {"begin": 8989, "end": 9137, "idx": 74}, {"begin": 9138, "end": 9267, "idx": 75}, {"begin": 9268, "end": 9335, "idx": 76}, {"begin": 9336, "end": 9387, "idx": 77}, {"begin": 9388, "end": 9428, "idx": 78}, {"begin": 9451, "end": 9631, "idx": 79}, {"begin": 9632, "end": 9920, "idx": 80}, {"begin": 9950, "end": 10080, "idx": 81}, {"begin": 10081, "end": 10260, "idx": 82}, {"begin": 10261, "end": 10417, "idx": 83}, {"begin": 10441, "end": 10503, "idx": 84}, {"begin": 10504, "end": 10595, "idx": 85}, {"begin": 10596, "end": 10723, "idx": 86}, {"begin": 10724, "end": 10868, "idx": 87}, {"begin": 10869, "end": 10926, "idx": 88}, {"begin": 10927, "end": 11015, "idx": 89}, {"begin": 11031, "end": 11134, "idx": 90}, {"begin": 11135, "end": 11249, "idx": 91}, {"begin": 11273, "end": 11478, "idx": 92}, {"begin": 11479, "end": 11685, "idx": 93}, {"begin": 11686, "end": 11753, "idx": 94}, {"begin": 11754, "end": 11976, "idx": 95}, {"begin": 11977, "end": 12160, "idx": 96}, {"begin": 12161, "end": 12260, "idx": 97}, {"begin": 12261, "end": 12416, "idx": 98}, {"begin": 12417, "end": 12543, "idx": 99}, {"begin": 12557, "end": 12867, "idx": 100}, {"begin": 12868, "end": 13050, "idx": 101}, {"begin": 13051, "end": 13274, "idx": 102}, {"begin": 13275, "end": 13387, "idx": 103}, {"begin": 13388, "end": 13495, "idx": 104}, {"begin": 13496, "end": 13637, "idx": 105}, {"begin": 13652, "end": 13771, "idx": 106}, {"begin": 13772, "end": 13871, "idx": 107}, {"begin": 13872, "end": 13973, "idx": 108}], "ReferenceToFigure": [{"begin": 5957, "end": 5958, "target": "#fig_0", "idx": 0}, {"begin": 7468, "end": 7469, "target": "#fig_2", "idx": 1}, {"begin": 10115, "end": 10116, "target": "#fig_3", "idx": 2}], "Div": [{"begin": 61, "end": 870, "idx": 0}, {"begin": 873, "end": 3215, "idx": 1}, {"begin": 3217, "end": 3554, "idx": 2}, {"begin": 3556, "end": 3651, "idx": 3}, {"begin": 3653, "end": 5702, "idx": 4}, {"begin": 5704, "end": 6691, "idx": 5}, {"begin": 6693, "end": 8164, "idx": 6}, {"begin": 8166, "end": 9428, "idx": 7}, {"begin": 9430, "end": 9920, "idx": 8}, {"begin": 9922, "end": 10417, "idx": 9}, {"begin": 10419, "end": 11015, "idx": 10}, {"begin": 11017, "end": 11249, "idx": 11}, {"begin": 11251, "end": 12543, "idx": 12}, {"begin": 12545, "end": 13637, "idx": 13}, {"begin": 13639, "end": 13973, "idx": 14}], "SectionMain": [{"begin": 870, "end": 13973, "idx": 0}]}}