{"text": "Learning Transferable Visual Models From Natural Language Supervision\n\nAbstract:\nState-of-the-art computer vision systems are trained to predict a fixed set of predetermined object categories. This restricted form of supervision limits their generality and usability since additional labeled data is needed to specify any other visual concept. Learning directly from raw text about images is a promising alternative which leverages a much broader source of supervision. We demonstrate that the simple pre-training task of predicting which caption goes with which image is an efficient and scalable way to learn SOTA image representations from scratch on a dataset of 400 million (image, text) pairs collected from the internet. After pre-training, natural language is used to reference learned visual concepts (or describe new ones) enabling zero-shot transfer of the model to downstream tasks. We study the performance of this approach by benchmarking on over 30 different existing computer vision datasets, spanning tasks such as OCR, action recognition in videos, geo-localization, and many types of fine-grained object classification. The model transfers non-trivially to most tasks and is often competitive with a fully supervised baseline without the need for any dataset specific training. For instance, we match the accuracy of the original ResNet-50 on ImageNet zero-shot without needing to use any of the 1.28 million training examples it was trained on. We release our code and pre-trained model weights at https://github.com/OpenAI/CLIP.\n\n\n1. Introduction and Motivating Work\nPre-training methods which learn directly from raw text have revolutionized NLP over the last few years (Dai & Le, 2015; Peters et al., 2018; Howard & Ruder, 2018; Radford et al., 2018; Devlin et al., 2018; Raffel et al., 2019).\nTask-agnostic objectives such as autoregressive and masked language modeling have scaled across many orders of magnitude in compute, model capacity, and data, steadily improving capabilities. The development of \"text-to-text\" as a standardized input-output interface (McCann et al., 2018; Radford et al., 2019; Raffel et al., 2019) has enabled taskagnostic architectures to zero-shot transfer to downstream datasets removing the need for specialized output heads or dataset specific customization. Flagship systems like GPT-3 (Brown et al., 2020) are now competitive across many tasks with bespoke models while requiring little to no dataset specific training data.\nThese results suggest that the aggregate supervision accessible to modern pre-training methods within web-scale collections of text surpasses that of high-quality crowd-labeled NLP datasets. However, in other fields such as computer vision it is still standard practice to pre-train models on crowd-labeled datasets such as ImageNet (Deng et al., 2009). Could scalable pre-training methods which learn directly from web text result in a similar breakthrough in computer vision? Prior work is encouraging.\nOver 20 years ago Mori et al. (1999) explored improving content based image retrieval by training a model to predict the nouns and adjectives in text documents paired with images.  Quattoni et al. (2007) demonstrated it was possible to learn more data efficient image representations via manifold learning in the weight space of classifiers trained to predict words in captions associated with images.  Srivastava & Salakhutdinov (2012) explored deep representation learning by training multimodal Deep Boltzmann Machines on top of low-level image and text tag features.  Joulin et al. (2016) modernized this line of work and demonstrated that CNNs trained to predict words in image captions learn useful image representations. They converted the title, description, and hashtag metadata of images in the YFCC100M dataset (Thomee et al., 2016) into a bag-ofwords multi-label classification task and showed that pretraining AlexNet (Krizhevsky et al., 2012) to predict these labels learned representations which preformed similarly to ImageNet-based pre-training on transfer tasks.  Li et al. (2017) then extended this approach to predicting phrase ngrams in addition to individual words and demonstrated the ability of their system to zero-shot transfer to other image classification datasets by scoring target classes based on their dictionary of learned visual n-grams and predicting the one with the highest score. Adopting more recent architectures and pre-training approaches, VirTex (Desai & Johnson, 2020), ICMLM (Bulent Sariyildiz et al., 2020), and Con-VIRT (Zhang et al., 2020) have recently demonstrated the potential of transformer-based language modeling, masked language modeling, and contrastive objectives to learn image representations from text.I 1 •T 2 I 1 •T 3 … I 2 •T 1 I 2 •T 3 … I 3 •T 1 I 3 •T 2 … ⋮ ⋮ ⋮ I 1 •T 1 I 2 •T 2 I 3 •T 3\nWhile exciting as proofs of concept, using natural language supervision for image representation learning is still rare. This is likely because demonstrated performance on common benchmarks is much lower than alternative approaches. For example, Li et al. (2017) reach only 11.5% accuracy on ImageNet in a zero-shot setting. This is well below the 88.4% accuracy of the current state of the art (Xie et al., 2020). It is even below the 50% accuracy of classic computer vision approaches (Deng et al., 2012). Instead, more narrowly scoped but well-targeted uses of weak supervision have improved performance.  Mahajan et al. (2018) showed that predicting ImageNet-related hashtags on Instagram images is an effective pre-training task. When fine-tuned to ImageNet these pre-trained models increased accuracy by over 5% and improved the overall state of the art at the time.  Kolesnikov et al. (2019) and Dosovitskiy et al. (2020) have also demonstrated large gains on a broader set of transfer benchmarks by pre-training models to predict the classes of the noisily labeled JFT-300M dataset.\nThis line of work represents the current pragmatic middle ground between learning from a limited amount of supervised \"gold-labels\" and learning from practically unlimited amounts of raw text. However, it is not without compro-mises. Both works carefully design, and in the process limit, their supervision to 1000 and 18291 classes respectively. Natural language is able to express, and therefore supervise, a much wider set of visual concepts through its generality. Both approaches also use static softmax classifiers to perform prediction and lack a mechanism for dynamic outputs. This severely curtails their flexibility and limits their \"zero-shot\" capabilities.\nA crucial difference between these weakly supervised models and recent explorations of learning image representations directly from natural language is scale. While Mahajan et al. (2018) and Kolesnikov et al. (2019) trained their models for accelerator years on millions to billions of images, VirTex, ICMLM, and ConVIRT trained for accelerator days on one to two hundred thousand images. In this work, we close this gap and study the behaviors of image classifiers trained with natural language supervision at large scale. Enabled by the large amounts of publicly available data of this form on the internet, we create a new dataset of 400 million (image, text) pairs and demonstrate that a simplified version of ConVIRT trained from scratch, which we call CLIP, for Contrastive Language-Image Pre-training, is an efficient method of learning from natural language supervision. We study the scalability of CLIP by training a series of eight models spanning almost 2 orders of magnitude of compute and observe that transfer performance is a smoothly predictable function of compute (Hestness et al., 2017; Kaplan et al., 2020). We find that CLIP, similar to the GPT family, learns to perform a wide set of tasks during pre-training including OCR, geo-localization, action recognition, and many others. We measure this by benchmarking the zero-shot transfer performance of CLIP on over 30 existing datasets and find  . CLIP is much more efficient at zero-shot transfer than our image caption baseline. Although highly expressive, we found that transformer-based language models are relatively weak at zero-shot ImageNet classification. Here, we see that it learns 3x slower than a baseline which predicts a bag-of-words (BoW) encoding of the text (Joulin et al., 2016). Swapping the prediction objective for the contrastive objective of CLIP further improves efficiency another 4x.\nit can be competitive with prior task-specific supervised models. We also confirm these findings with linear-probe representation learning analysis and show that CLIP outperforms the best publicly available ImageNet model while also being more computationally efficient. We additionally find that zero-shot CLIP models are much more robust than equivalent accuracy supervised ImageNet models which suggests that zero-shot evaluation of task-agnostic models is much more representative of a model's capability. These results have significant policy and ethical implications, which we consider in Section 7.\n\n2. Approach\n\n\n2.1. Natural Language Supervision\nAt the core of our approach is the idea of learning perception from supervision contained in natural language. As discussed in the introduction, this is not at all a new idea, however terminology used to describe work in this space is varied, even seemingly contradictory, and stated motivations are diverse.  Zhang et al. (2020), Gomez et al. (2017), Joulin et al. (2016), and Desai & Johnson (2020) all introduce methods which learn visual representations from text paired with images but describe their approaches as unsupervised, self-supervised, weakly supervised, and supervised respectively.\nWe emphasize that what is common across this line of work is not any of the details of the particular methods used but the appreciation of natural language as a training signal. All these approaches are learning from natural language super-vision. Although early work wrestled with the complexity of natural language when using topic model and n-gram representations, improvements in deep contextual representation learning suggest we now have the tools to effectively leverage this abundant source of supervision (McCann et al., 2017).\nLearning from natural language has several potential strengths over other training methods. It's much easier to scale natural language supervision compared to standard crowd-sourced labeling for image classification since it does not require annotations to be in a classic \"machine learning compatible format\" such as the canonical 1-of-N majority vote \"gold label\". Instead, methods which work on natural language can learn passively from the supervision contained in the vast amount of text on the internet. Learning from natural language also has an important advantage over most unsupervised or self-supervised learning approaches in that it doesn't \"just\" learn a representation but also connects that representation to language which enables flexible zero-shot transfer. In the following subsections, we detail the specific approach we settled on.\n\n2.2. Creating a Sufficiently Large Dataset\nExisting work has mainly used three datasets, MS-COCO (Lin et al., 2014), Visual Genome (Krishna et al., 2017), and YFCC100M (Thomee et al., 2016). While MS-COCO and Visual Genome are high quality crowd-labeled datasets, they are small by modern standards with approximately 100,000 training photos each. By comparison, other computer vision systems are trained on up to 3.5 billion Instagram photos (Mahajan et al., 2018). YFCC100M, at 100 million photos, is a possible alternative, but the metadata for each image is sparse and of varying quality. Many images use automatically generated filenames like 20160716 113957.JPG as \"titles\" or contain \"descriptions\" of camera exposure settings. After filtering to keep only images with natural language titles and/or descriptions in English, the dataset shrunk by a factor of 6 to only 15 million photos. This is approximately the same size as ImageNet.\nA major motivation for natural language supervision is the large quantities of data of this form available publicly on the internet. Since existing datasets do not adequately reflect this possibility, considering results only on them would underestimate the potential of this line of research. To address this, we constructed a new dataset of 400 million (image, text) pairs collected form a variety of publicly available sources on the Internet. To attempt to cover as broad a set of visual concepts as possible, we search for (image, text) pairs as part of the construction process whose text includes one of a set of 500,000 queries. 1 We approximately class balance the results by including up to 20,000 (image, text) pairs per query. The resulting dataset has a similar total word count as the WebText dataset used to train GPT-2. We refer to this dataset as WIT for WebImageText.\n\n2.3. Selecting an Efficient Pre-Training Method\nState-of-the-art computer vision systems use very large amounts of compute.  Mahajan et al. (2018) required 19 GPU years to train their ResNeXt101-32x48d and Xie et al. (2020) required 33 TPUv3 core-years to train their Noisy Student EfficientNet-L2. When considering that both these systems were trained to predict only 1000 ImageNet classes, the task of learning an open set of visual concepts from natural language seems daunting. In the course of our efforts, we found training efficiency was key to successfully scaling natural language supervision and we selected our final pre-training method based on this metric.\nOur initial approach, similar to VirTex, jointly trained an image CNN and text transformer from scratch to predict the caption of an image. However, we encountered difficulties efficiently scaling this method. In Figure 2 we show that a 63 million parameter transformer language model, which already uses twice the compute of its ResNet-50 image encoder, learns to recognize ImageNet classes three times slower than a much simpler baseline that predicts a bag-ofwords encoding of the same text.\nBoth these approaches share a key similarity. They try to predict the exact words of the text accompanying each image. This is a difficult task due to the wide variety of descriptions, comments, and related text that co-occur with images. Recent work in contrastive representation learning for images has found that contrastive objectives can learn better representations than their equivalent predictive objective (Tian et al., 2019). Other work has found that although generative models of images can learn high quality image representations, they require over an order of magnitude more compute than contrastive models with the same performance (Chen et al., 2020a). Noting these findings, we explored training a system to solve the potentially easier proxy task of predicting only which text as a whole is paired with which image and not the exact words of that text. Starting with the same bag-of-words encoding baseline, we swapped the predictive objective for a contrastive objective in Figure 2 and observed a further 4x efficiency improvement in the rate of zero-shot transfer to ImageNet.\nGiven a batch of N (image, text) pairs, CLIP is trained to predict which of the N × N possible (image, text) pairings across a batch actually occurred. To do this, CLIP learns a with high pointwise mutual information as well as the names of all Wikipedia articles above a certain search volume. Finally all WordNet synsets not already in the query list are added. multi-modal embedding space by jointly training an image encoder and text encoder to maximize the cosine similarity of the image and text embeddings of the N real pairs in the batch while minimizing the cosine similarity of the embeddings of the N 2 − N incorrect pairings. We optimize a symmetric cross entropy loss over these similarity scores. In Figure 3 we include pseudocode of the core of an implementation of CLIP. To our knowledge this batch construction technique and objective was first introduced in the area of deep metric learning as the multi-class N-pair loss Sohn (2016), was popularized for contrastive representation learning by Oord et al. (2018) as the InfoNCE loss, and was recently adapted for contrastive (text, image) representation learning in the domain of medical imaging by Zhang et al. (2020).\nDue to the large size of our pre-training dataset, over-fitting is not a major concern and the details of training CLIP are simplified compared to the implementation of Zhang et al. (2020). We train CLIP from scratch without initializing the image encoder with ImageNet weights or the text encoder with pre-trained weights. We do not use the non-linear projection between the representation and the contrastive embedding space, a change which was introduced by Bachman et al. ( 2019) and popularized by Chen et al. (2020b). We instead use only a linear projection to map from each encoder's representation to the multi-modal embedding space. We did not notice a difference in training efficiency between the two versions and speculate that non-linear projections may be co-adapted with details of current image only in self-supervised representation learning methods. We also remove the text transformation function t u from Zhang et al. (2020) which samples a single sentence at uniform from the text since many of the (image, text) pairs in CLIP's pretraining dataset are only a single sentence. We also simplify the image transformation function t v . A random square crop from resized images is the only data augmentation used during training. Finally, the temperature parameter which controls the range of the logits in the softmax, τ , is directly optimized during training as a log-parameterized multiplicative scalar to avoid turning as a hyper-parameter.\n\n2.4. Choosing and Scaling a Model\nWe consider two different architectures for the image encoder. For the first, we use ResNet-50 (He et al., 2016a) as the base architecture for the image encoder due to its widespread adoption and proven performance. We make several modifications to the original version using the ResNet-D improvements from He et al. (2019) and the antialiased rect-2 blur pooling from Zhang (2019). We also replace the global average pooling layer with an attention pooling mechanism. The attention pooling is implemented as a single layer of \"transformer-style\" multi-head QKV attention where the query is conditioned on the global average-pooled representation of the image. For the second architecture, we experiment with the recently introduced Vision Transformer (ViT) (Dosovitskiy et al., 2020). We closely follow their implementation with only the minor modification of adding an additional layer normalization to the combined patch and position embeddings before the transformer and use a slightly different initialization scheme.\nThe text encoder is a Transformer (Vaswani et al., 2017) with the architecture modifications described in Radford et al. (2019). As a base size we use a 63M-parameter 12layer 512-wide model with 8 attention heads. The transformer operates on a lower-cased byte pair encoding (BPE) representation of the text with a 49,152 vocab size (Sennrich et al., 2015). For computational efficiency, the max sequence length was capped at 76. The text sequence is bracketed with [SOS] and [EOS] tokens and the activations of the highest layer of the transformer at the [EOS] token are treated as the feature representation of the text which is layer normalized and then linearly projected into the multi-modal embedding space. Masked self-attention was used in the text encoder to preserve the ability to initialize with a pre-trained language model or add language modeling as an auxiliary objective, though exploration of this is left as future work.\nWhile previous computer vision research has often scaled models by increasing the width (Mahajan et al., 2018) or depth (He et al., 2016a) in isolation, for the ResNet image encoders we adapt the approach of Tan & Le (2019) which found that allocating additional compute across all of width, depth, and resolution outperforms only allocating it to only one dimension of the model. While Tan & Le (2019) tune the ratio of compute allocated to each dimension for their EfficientNet architecture, we use a simple baseline of allocating additional compute equally to increasing the width, depth, and resolution of the model. For the text encoder, we only scale the width of the model to be proportional to the calculated increase in width of the ResNet and do not scale the depth at all, as we found CLIP's performance to be less sensitive to the capacity of the text encoder.\n\n2.5. Training\nWe train a series of 5 ResNets and 3 Vision Transformers.\nFor the ResNets we train a ResNet-50, a ResNet-101, and then 3 more which follow EfficientNet-style model scaling and use approximately 4x, 16x, and 64x the compute of a ResNet-50. They are denoted as RN50x4, RN50x16, and RN50x64 respectively. For the Vision Transformers we train a ViT-B/32, a ViT-B/16, and a ViT-L/14. We train all models for 32 epochs. We use the Adam optimizer (Kingma & Ba, 2014) with decoupled weight decay regularization (Loshchilov & Hutter, 2017) applied to all weights that are not gains or biases, and decay the learning rate using a cosine schedule (Loshchilov & Hutter, 2016). Initial hyperparameters were set using a combination of grid searches, random search, and manual tuning on the baseline ResNet-50 model when trained for 1 epoch. Hyper-parameters were then adapted heuristically for larger models due to computational constraints. The learnable temperature parameter τ was initialized to the equivalent of 0.07 from (Wu et al., 2018) and clipped to prevent scaling the logits by more than 100 which we found necessary to prevent training instability. We use a very large minibatch size of 32,768. Mixed-precision (Micikevicius et al., 2017) was used to accelerate training and save memory. To save additional memory, gradient checkpointing (Griewank & Walther, 2000; Chen et al., 2016), half-precision Adam statistics (Dhariwal et al., 2020), and half-precision stochastically rounded text encoder weights were used. The calculation of embedding similarities was also sharded with individual GPUs computing only the subset of the pairwise similarities necessary for their local batch of embeddings. The largest ResNet model, RN50x64, took 18 days to train on 592 V100 GPUs while the largest Vision Transformer took 12 days on 256 V100 GPUs. For the ViT-L/14 we also pre-train at a higher 336 pixel resolution for one additional epoch to boost performance similar to FixRes (Touvron et al., 2019). We denote this model as ViT-L/14@336px. Unless otherwise specified, all results reported in this paper as \"CLIP\" use this model which we found to perform best.\n\n3. Experiments\n3.1. Zero-Shot Transfer\n\n3.1.1. MOTIVATION\nIn computer vision, zero-shot learning usually refers to the study of generalizing to unseen object categories in image classification (Lampert et al., 2009). We instead use the term in a broader sense and study generalization to unseen datasets. We motivate this as a proxy for performing unseen tasks, as aspired to in the zero-data learning paper of Larochelle et al. (2008). While much research in the field of unsupervised learning focuses on the representation learning capabilities of machine learning systems, we motivate studying zero-shot transfer as a way of measuring the tasklearning capabilities of machine learning systems. In this view, a dataset evaluates performance on a task on a specific distribution. However, many popular computer vision datasets were created by the research community primarily as benchmarks to guide the development of generic image classification methods rather than measuring performance on a specific task. While it is reasonable to say that the SVHN dataset measures the task of street number transcription on the distribution of Google Street View photos, it is unclear what \"real\" task the CIFAR-10 dataset measures.\nIt is clear, however, what distribution CIFAR-10 is drawn from -TinyImages (Torralba et al., 2008). On these kinds of datasets, zero-shot transfer is more an evaluation of CLIP's robustness to distribution shift and domain generalization rather than task generalization. Please see Section 3.3 for analysis focused on this.\nTo our knowledge, Visual N-Grams (Li et al., 2017) first studied zero-shot transfer to existing image classification datasets in the manner described above. It is also the only other work we are aware of that has studied zero-shot transfer to standard image classification datasets using a generically pre-trained model and serves as the best reference point for contextualizing CLIP. Their approach learns the parameters of a dictionary of 142,806 visual n-grams (spanning 1-to 5-grams) and optimizes these n-grams using a differential version of Jelinek-Mercer smoothing to maximize the probability of all text n-grams for a given image.\nIn order to perform zero-shot transfer, they first convert the text of each of the dataset's class names into its n-gram representation and then compute its probability according to their model, predicting the one with the highest score.\nOur focus on studying zero-shot transfer as an evaluation of task learning is inspired by work demonstrating task learning in the field of NLP. To our knowledge Liu et al. (2018) first identified task learning as an \"unexpected side-effect\" when a language model trained to generate Wikipedia articles learned to reliably transliterate names between languages. While GPT-1 (Radford et al., 2018) focused on pre-training as a transfer learning method to improve supervised fine-tuning, it also included an ablation study demonstrating that the performance of four heuristic zero-shot transfer methods improved steadily over the course of pre-training, without any supervised adaption. This analysis served as the basis for GPT-2 (Radford et al., 2019) which focused exclusively on studying the task-learning capabilities of language models via zero-shot transfer.\n3.1.2. USING CLIP FOR ZERO-SHOT TRANSFER CLIP is pre-trained to predict if an image and a text snippet are paired together in its dataset. To perform zero-shot classification, we reuse this capability. For each dataset, we use the names of all the classes in the dataset as the set of potential text pairings and predict the most probable (image, text) pair according to CLIP. In a bit more detail, we first compute the feature embedding of the image and the feature embedding of the set of possible texts by their respective encoders.\nThe cosine similarity of these embeddings is then calculated, scaled by a temperature parameter τ , and normalized into a probability distribution via a softmax. Note that this prediction layer is a multinomial logistic regression classifier with L2-normalized inputs, L2-normalized weights, no bias, and temperature scaling. When interpreted this way, the image encoder is the computer vision backbone which computes a feature representation for the image and the text encoder is a hypernetwork (Ha et al., 2016) which generates the weights of a linear classifier based on the text specifying the visual concepts that the classes represent. Lei Ba et al. (2015) first introduced a zero-shot image classifier of this form while the idea of generating a classifier from natural language dates back to at least Elhoseiny et al. (2013). Continuing with this interpretation, every step of CLIP pre-training can be viewed as optimizing the performance of a randomly created proxy to a computer vision dataset which contains 1 example per class and has 32,768 total classes defined via natural language descriptions. For zero-shot evaluation, we cache the zero-shot classifier once it has been computed by the text encoder and reuse it for all subsequent predictions. This allows the cost of generating it to be amortized across all the predictions in a dataset.\n\n3.1.3. INITIAL COMPARISON TO VISUAL N-GRAMS\nIn . CLIP improves performance on all three datasets by a large amount. This improvement reflects many differences in the 4 years since the development of Visual N-Grams (Li et al., 2017).\nCLIP is a significant step towards flexible and practical zero-shot computer vision classifiers. As mentioned above, the comparison to Visual N-Grams is meant for contextualizing the performance of CLIP and should not be interpreted as a direct methods comparison between CLIP and Visual N-Grams as many performance relevant differences between the two systems were not controlled for. For instance, we train on a dataset that is 10x larger, use a vision model that requires nearly 100x more compute per prediction, likely used over 1000x their training compute, and use a transformer-based model which did not exist when Visual N-Grams was published. As a closer comparison, we trained a CLIP ResNet-50 on the same YFCC100M dataset that Visual N-Grams was trained on and found it matched their reported ImageNet performance within a V100 GPU day. This baseline was also trained from scratch instead of being initialized from pre-trained ImageNet weights as in Visual N-Grams.\nCLIP also outperforms Visual N-Grams on the other 2 reported datasets. On aYahoo, CLIP achieves a 95% reduction in the number of errors, and on SUN, CLIP more than doubles the accuracy of Visual N-Grams. To conduct a more comprehensive analysis and stress test, we implement a much larger evaluation suite detailed in Appendix A. In total we expand from the 3 datasets reported in Visual N-Grams to include over 30 datasets and compare to over 50 existing computer vision systems to contextualize results.\n\n3.1.4. PROMPT ENGINEERING AND ENSEMBLING\nMost standard image classification datasets treat the information naming or describing classes which enables natural language based zero-shot transfer as an afterthought. The vast majority of datasets annotate images with just a numeric id of the label and contain a file mapping these ids back to their names in English. Some datasets, such as Flowers102 and GTSRB, don't appear to include this mapping at all in their released versions preventing zero-shot transfer entirely. 2 For many datasets, we observed these labels may be (Li et al. 2017) Figure 4. Prompt engineering and ensembling improve zeroshot performance. Compared to the baseline of using contextless class names, prompt engineering and ensembling boost zero-shot classification performance by almost 5 points on average across 36 datasets. This improvement is similar to the gain from using 4 times more compute with the baseline zero-shot method but is \"free\" when amortized over many predictions. chosen somewhat haphazardly and do not anticipate issues related to zero-shot transfer which relies on task description in order to transfer successfully.\nA common issue is polysemy. When the name of a class is the only information provided to CLIP's text encoder it is unable to differentiate which word sense is meant due to the lack of context. In some cases multiple meanings of the same word might be included as different classes in the same dataset! This happens in ImageNet which contains both construction cranes and cranes that fly. Another example is found in classes of the Oxford-IIIT Pet dataset where the word boxer is, from context, clearly referring to a breed of dog, but to a text encoder lacking context could just as likely refer to a type of athlete.\nAnother issue we encountered is that it's relatively rare in our pre-training dataset for the text paired with the image to be just a single word. Usually the text is a full sentence describing the image in some way. To help bridge this distribution gap, we found that using the prompt template \"A photo of a {label}.\" to be a good default that helps specify the text is about the content of the image. This often improves performance over the baseline of using only the label text. For instance, just using this prompt improves accuracy on ImageNet by 1.3%. Similar to the \"prompt engineering\" discussion around GPT-3 (Brown et al., 2020; Gao et al., 2020), we have also observed that zero-shot performance can be significantly improved by customizing the prompt text to each task. A few, non exhaustive, examples follow. We found on several fine-grained image classification datasets that it helped to specify the category. For example on Oxford-IIIT Pets, using \"A photo of a {label}, a type of pet.\" to help provide context worked well. Likewise, on Food101 specifying a type of food and on FGVC Aircraft a type of aircraft helped too. For OCR datasets, we found that putting quotes around the text or number to be recognized improved performance. Finally, we found that on satellite image classification datasets it helped to specify that the images were of this form and we use variants of \"a satellite photo of a {label}.\".\nWe also experimented with ensembling over multiple zeroshot classifiers as another way of improving performance. These classifiers are computed by using different context prompts such as 'A photo of a big {label}\" and \"A photo of a small {label}\". We construct the ensemble over the embedding space instead of probability space. This allows us to cache a single set of averaged text embeddings so that the compute cost of the ensemble is the same as using a single classifier when amortized over many predictions. We've observed ensembling across many generated zero-shot classifiers to reliably improve performance and use it for the majority of datasets. On ImageNet, we ensemble 80 different context prompts and this improves performance by an additional 3.5% over the single default prompt discussed above. When considered together, prompt engineering and ensembling improve ImageNet accuracy by almost 5%. In Figure 4 we visualize how prompt engineering and ensembling change the performance of a set of CLIP models compared to the contextless baseline approach of directly embedding the class name as done in Li et al. (2017).\n\n3.1.5. ANALYSIS OF ZERO-SHOT CLIP PERFORMANCE\nSince task-agnostic zero-shot classifiers for computer vision have been understudied, CLIP provides a promising opportunity to gain a better understanding of this type of model. In this section, we conduct a study of various properties of CLIP's zero-shot classifiers. As a first question, we look simply at how well zero-shot classifiers perform. To contextualize this, we compare to the performance of a simple off-the-shelf baseline: fitting a fully supervised, regularized, logistic regression classifier on the features of the canonical ResNet-50. In Figure 5 ten than not and wins on 16 of the 27 datasets. Looking at individual datasets reveals some interesting behavior. On fine-grained classification tasks, we observe a wide spread in performance. On two of these datasets, Stanford Cars and Food101, zero-shot CLIP outperforms logistic regression on ResNet-50 features by over 20% while on two others, Flowers102 and FGVCAircraft, zero-shot CLIP underperforms by over 10%. On OxfordPets and Birdsnap, performance is much closer. We suspect these difference are primarily due to varying amounts of per-task supervision between WIT and ImageNet. On \"general\" object classification datasets such as ImageNet, CIFAR10/100, STL10, and PascalVOC2007 performance is relatively similar with a slight advantage for zero-shot CLIP in all cases. On STL10, CLIP achieves 99.3% overall which appears to be a new state of the art despite not using any training examples. Zeroshot CLIP significantly outperforms a ResNet-50 on two datasets measuring action recognition in videos. On Kinet-ics700, CLIP outperforms a ResNet-50 by 14.5%. Zeroshot CLIP also outperforms a ResNet-50's features by 7.7% on UCF101. We speculate this is due to natural language providing wider supervision for visual concepts involving verbs, compared to the noun-centric object supervision in ImageNet.\nLooking at where zero-shot CLIP notably underperforms, we see that zero-shot CLIP is quite weak on several specialized, complex, or abstract tasks such as satellite image classification (EuroSAT and RESISC45), lymph node tumor detection (PatchCamelyon), counting objects in synthetic scenes (CLEVRCounts), self-driving related tasks such as German traffic sign recognition (GTSRB), recognizing distance to the nearest car (KITTI Distance). These results highlight the poor capability of zero-shot CLIP on more complex tasks. By contrast, non-expert humans can robustly perform several of these tasks, such as counting, satellite image classification, and traffic sign recognition, suggesting significant room for improvement. However, we caution that it is unclear whether measuring zero-shot transfer, as opposed to few-shot transfer, is a meaningful evaluation for difficult tasks that a learner has no prior experience with, such as lymph node tumor classification for almost all humans (and possibly CLIP).\nWhile comparing zero-shot performance to fully supervised models contextualizes the task-learning capabilities of CLIP, comparing to few-shot methods is a more direct comparison, since zero-shot is its limit. In Figure 6, we visualize how zero-shot CLIP compares to few-shot logistic regression on the features of many image models including the best publicly available ImageNet models, self-supervised learning methods, and CLIP itself. While it is intuitive to expect zero-shot to underperform one-shot, we instead find that zero-shot CLIP matches the performance of 4-shot logistic regression on the same feature space. This is likely due to an important difference between the zero-shot and few-shot approach. First, CLIP's zero-shot classifier is generated via natural language which allows for visual concepts to be directly specified (\"communicated\"). By contrast, \"normal\" supervised learning must infer concepts indirectly from training examples. Context-less example-based learning has the drawback that many different hypotheses can be consistent with the data, especially in the one-shot case.\nA single image often contains many different visual concepts. Although a capable learner is able to exploit visual cues and heuristics, such as assuming that the concept being demonstrated is the primary object in an image, there is no guarantee.\nA potential resolution of this discrepancy between zeroshot and few-shot performance is to use CLIP's zero-shot classifier as a prior for the weights of the few-shot classifier.\nWhile adding an L2 penalty towards the generated weights is a straightforward implementation of this idea, we found that hyperparameter optimization would often select for such a large value of this regularizer that the resulting fewshot classifier was \"just\" the zero-shot classifier. Research into better methods of combining the strength of zero-shot transfer with flexibility of few-shot learning is a promising direction for future work.\nWhen comparing zero-shot CLIP to few-shot logistic regression on the features of other models, zero-shot CLIP roughly matches the performance of the best performing 16-shot classifier in our evaluation suite, which uses the features of a BiT-M ResNet-152x2 trained on ImageNet-21K.\nWe are certain that a BiT-L model trained on JFT-300M would perform even better but these models have not been publicly released. That a BiT-M ResNet-152x2 performs best in a 16-shot setting is somewhat surprising since, as analyzed in Section 3.2, the Noisy Student EfficientNet-L2 outperforms it in a fully supervised setting by almost 5% on average across 27 datasets.\nIn addition to studying the average performance of zero-shot CLIP and few-shot logistic regression, we also examine performance on individual datasets. In Figure 7, we show estimates for the number of labeled examples per class that a logistic regression classifier on the same feature space requires to match the performance of zero-shot CLIP. Since zero-shot CLIP is also a linear classifier, this estimates the effective data efficiency of zero-shot transfer in this setting.\nIn order to avoid training thousands of linear classifiers, we estimate the effective data efficiency based on a loglinear interpolation of the performance of a 1, 2, 4, 8, 16shot (when possible), and a fully supervised linear classifier trained on each dataset. We find that zero-shot transfer can If we assume that evaluation datasets are large enough that the parameters of linear classifiers trained on them are well estimated, then, because CLIP's zero-shot classifier is also a linear classifier, the performance of the fully supervised classifiers roughly sets an upper bound for what zero-shot transfer can achieve. In Figure 8 we compare CLIP's zeroshot performance with fully supervised linear classifiers across datasets. The dashed, y = x line represents an \"optimal\" zero-shot classifier that matches the performance of its fully supervised equivalent. For most datasets, the performance of zero-shot classifiers still underperform fully supervised classifiers by 10% to 25%, suggesting that there is still plenty of headroom for improving CLIP's task-learning and zero-shot transfer capabilities.\nThere is a positive correlation of 0.82 (p-value < 10 −6 ) between zero-shot performance and fully supervised perfor- . Zero-shot performance is correlated with linear probe performance but still mostly sub-optimal. Comparing zero-shot and linear probe performance across datasets shows a strong correlation with zero-shot performance mostly shifted 10 to 25 points lower. On only 5 datasets does zero-shot performance approach linear probe performance (≤3 point difference). mance, suggesting that CLIP is relatively consistent at connecting underlying representation and task learning to zeroshot transfer. However, zero-shot CLIP only approaches fully supervised performance on 5 datasets: STL10, CI-FAR10, Food101, OxfordPets, and Caltech101. On all 5 datasets, both zero-shot accuracy and fully supervised accuracy are over 90%. This suggests that CLIP may be more effective at zero-shot transfer for tasks where its underlying representations are also high quality. The slope of a linear regression model predicting zero-shot performance as a function of fully supervised performance estimates that for every 1% improvement in fully supervised performance, zero-shot performance improves by 1.28%. However, the 95th-percentile confidence intervals still include values of less than 1 (0.93-1.79).\nOver the past few years, empirical studies of deep learning systems have documented that performance is predictable as a function of important quantities such as training compute and dataset size (Hestness et al., 2017; Kaplan et al., 2020). The GPT family of models has so far demonstrated consistent improvements in zero-shot performance across a 1000x increase in training compute. In Figure 9, we check whether the zero-shot performance of CLIP follows a similar scaling pattern. We plot the average error rate of the 5 ResNet CLIP models across 39 evaluations on 36 different datasets and find that a similar log-log linear scaling trend holds for CLIP across a 44x increase in model compute. While the overall trend is smooth, we found that performance on individual evaluations can be much noisier. We are unsure whether this is caused by high variance between individual training runs on sub-tasks (as documented in D'Amour et al. ( 2020)) masking a steadily improving trend or whether performance is actually non-monotonic as a function of compute on some tasks.\n\n3.2. Representation Learning\nWhile we have extensively analyzed the task-learning capabilities of CLIP through zero-shot transfer in the previous section, it is more common to study the representation learning capabilities of a model. There exist many ways to evaluate the quality of representations as well as disagreements over what properties an \"ideal\" representation should have (Locatello et al., 2020). Fitting a linear classifier on a representation extracted from the model and measuring its performance on various datasets is a common approach. An alternative is measuring the performance of end-to-end fine-tuning of the model. This increases flexibility, and prior work has convincingly demonstrated that fine-tuning outperforms linear classification on most image classification datasets (Kornblith et al., 2019; Zhai et al., 2019). While the high performance of fine-tuning motivates its study for practical reasons, we still opt for linear classifier based evaluation for several reasons. Our work is focused on developing a high-performing task and dataset-agnostic pre-training approach. Fine-tuning, because it adapts representations to each dataset during the fine-tuning phase, can compensate for and potentially mask failures to learn general and robust representations during the pre-training phase. Linear classifiers, because of their limited flexibility, instead highlight these failures and provide clear feedback during development. For CLIP, training supervised linear classifiers has the added benefit of being very similar to the approach used for its zero-shot classifiers which enables extensive comparisons and analysis in Section 3.1. Finally, we aim to compare CLIP to a comprehensive set of existing models across many tasks. Studying 66 different models on 27 different datasets requires tuning 1782 different evaluations. Fine-tuning opens up a much larger design and hyperparameter space, which makes it difficult to fairly evaluate and computationally expensive to compare a diverse set of techniques as discussed in other large scale empirical studies (Lucic et al., 2018; Choi et al., 2019). By comparison, linear classifiers require minimal hyper-parameter tuning and have standardized implementations and evaluation procedures. Please see Appendix A for further details on evaluation.\nFigure 10 summarizes our findings. To minimize selection effects that could raise concerns of confirmation or reporting bias, we first study performance on the 12 dataset evaluation suite from Kornblith et al. (2019). While small CLIP models such as a ResNet-50 and ResNet-101 outperform other ResNets trained on ImageNet-1K (BiT-S and the originals), they underperform ResNets trained on ImageNet-21K (BiT-M). These small CLIP models also underperform models in the EfficientNet family with similar compute requirements. However, models trained with CLIP scale very well and the largest model we trained (ResNet-50x64) slightly outperforms the best performing existing model (a Noisy Student EfficientNet-L2) on both overall score and compute efficiency. We also find that CLIP vision transformers are about 3x more compute efficient than CLIP ResNets, which allows us to reach higher overall performance within our compute budget. These results qualitatively replicate the findings of Dosovitskiy et al. (2020) which reported that vision transformers are more compute efficient than convnets when trained on sufficiently large datasets. Our best overall model is a ViT-L/14 that is fine-tuned at a higher resolution of 336 pixels on our dataset for 1 additional epoch. This model outperforms the best existing model across this evaluation suite by an average of 2.6%.\nAs Figure 21 qualitatively shows, CLIP models learn a wider set of tasks than has previously been demonstrated in a single computer vision model trained end-to-end from random initialization. These tasks include geo-localization, optical character recognition, facial emotion recognition, and action recognition. None of these tasks are measured in the evaluation suite of Kornblith et al. (2019). This could be argued to be a form of selection bias in Kornblith et al. (2019) 's study towards tasks that overlap with ImageNet. To address this, we also measure performance on a broader 27 dataset evaluation suite. This evaluation suite, detailed in Appendix A includes datasets representing the aforementioned tasks, German Traffic Signs Recognition Benchmark (Stallkamp et al., 2011), as well as several other datasets adapted from VTAB (Zhai et al., 2019). Linear probe average over all 27 datasetsCLIP-ViT CLIP-ResNet EfficientNet-NoisyStudent EfficientNet Instagram-pretrained SimCLRv2 BYOL MoCo ViT (ImageNet-21k) BiT-M BiT-S ResNet Figure 10\n. Linear probe performance of CLIP models in comparison with state-of-the-art computer vision models, including EfficientNet (Tan & Le, 2019; Xie et al., 2020), MoCo (Chen et al., 2020d), Instagram-pretrained ResNeXt models (Mahajan et al., 2018; Touvron et al., 2019), BiT (Kolesnikov et al., 2019), ViT (Dosovitskiy et al., 2020), SimCLRv2 (Chen et al., 2020c), BYOL (Grill et al., 2020), and the original ResNet models (He et al., 2016b). (Left) Scores are averaged over 12 datasets studied by Kornblith et al. (2019). (Right) Scores are averaged over 27 datasets that contain a wider variety of distributions. Dotted lines indicate models fine-tuned or evaluated on images at a higher-resolution than pre-training. See Table 10 for individual scores and Figure 20 for plots for each dataset.\nOn this broader evaluation suite, the benefits of CLIP are more clear. All CLIP models, regardless of scale, outperform all evaluated systems in terms of compute efficiency. The improvement in average score of the best model over previous systems increases from 2.6% to 5%. We also find that self-supervised systems do noticeably better on our broader evaluation suite. For instance, while SimCLRv2 still underperforms BiT-M on average on the 12 datasets of Kornblith et al. (2019), SimCLRv2 outperforms BiT-M on our 27 dataset evaluation suite. These findings suggest continuing to expand task diversity and coverage in order to better understand the \"general\" performance of systems. We suspect additional evaluation efforts along the lines of VTAB to be valuable.\nIn addition to the aggregate analysis above, we visualize per-dataset differences in the performance of the best CLIP model and the best model in our evaluation suite across all 27 datasets in Figure 11. CLIP outperforms the Noisy Student EfficientNet-L2 on 21 of the 27 datasets. CLIP improves the most on tasks which require OCR (SST2 and HatefulMemes), geo-localization and scene recognition (Country211, SUN397), and activity recognition in videos (Kinetics700 and UCF101). In addition CLIP also does much better on fine-grained car and traffic sign recognition (Stanford Cars and GTSRB). This may reflect a problem with overly narrow supervision in ImageNet. A result such as the 14.7% improvement on GTSRB could be indicative of an issue with ImageNet-1K, which has only a single label for all traffic and street signs. This could encourage a supervised representation to collapse intra-class details and hurt accuracy on a fine-grained downstream task. As mentioned, CLIP still underperforms the EfficientNet on several datasets. Unsurprisingly, the dataset that the Effi-cientNet does best relative to CLIP on is the one it was trained on: ImageNet. The EffcientNet also slightly outperforms CLIP on low-resolution datasets such as CIFAR10 and CIFAR100. We suspect this is at least partly due to the lack of scale-based data augmentation in CLIP. The Effi-cientNet also does slightly better on PatchCamelyon and CLEVRCounts, datasets where overall performance is still low for both approaches.\n\n3.3. Robustness to Natural Distribution Shift\nIn 2015, it was announced that a deep learning model exceeded human performance on the ImageNet test set (He et al., 2015). However, research in the subsequent years has repeatedly found that these models still make many simple mistakes (Dodge & Karam, 2017; Geirhos et al., 2018; Alcorn et al., 2019), and new benchmarks testing these systems has often found their performance to be much lower than both their ImageNet accuracy and human accuracy (Recht et al., 2019; Barbu et al., 2019). What explains this discrepancy? Various ideas have been suggested and studied (Ilyas et al., 2019; Geirhos et al., 2020). A common theme of proposed explanations is that deep learning models are exceedingly adept at finding correlations and patterns which hold across their training dataset and thus improve in-distribution performance. However many of these correlations and patterns are actually spurious and do not hold for other distributions and result in large drops in performance on other datasets.\nWe caution that, to date, most of these studies limit their evaluation to models trained on ImageNet. Recalling the topic of discussion, it may be a mistake to generalize too far from these initial findings. To what degree are these failures attributable to deep learning, ImageNet, or some combination of the two? CLIP models, which are trained via natural language supervision on a very large dataset and are capable of high zero-shot performance, are an opportunity to investigate this question from a different angle.  Taori et al. (2020) is a recent comprehensive study moving towards quantifying and understanding these behaviors for ImageNet models.  Taori et al. (2020) study how the performance of ImageNet models change when evaluated on natural distribution shifts. They measure performance on a set of 7 distribution shifts: ImageNetV2 (Recht et al., 2019), ImageNet Sketch (Wang et al., 2019), Youtube-BB and ImageNet-Vid (Shankar et al., 2019), ObjectNet (Barbu et al., 2019), ImageNet Adversarial (Hendrycks et al., 2019), and ImageNet Rendition (Hendrycks et al., 2020a). They distinguish these datasets, which all consist of novel images collected from a variety of sources, from synthetic distribution shifts such as ImageNet-C (Hendrycks & Dietterich, 2019), Stylized ImageNet (Geirhos et al., 2018), or adversarial attacks (Goodfellow et al., 2014) which are created by perturbing existing images in various ways. They propose this distinction because in part because they find that while several techniques have been demonstrated to improve performance on synthetic distribution shifts, they often fail to yield consistent improvements on natural distributions. 3 cross these collected datasets, the accuracy of ImageNet models drop well below the expectation set by the Ima-geNet validation set. For the following summary discussion we report average accuracy across all 7 natural distribution shift datasets and average accuracy across the corresponding class subsets of ImageNet unless otherwise specified. Additionally, for Youtube-BB and ImageNet-Vid, which have two different evaluation settings, we use the average of pm-0 and pm-10 accuracy.\nA ResNet-101 makes 5 times as many mistakes when evaluated on these natural distribution shifts compared to the ImageNet validation set. Encouragingly however, Taori et al. (2020) find that accuracy under distribution shift increases predictably with ImageNet accuracy and is well modeled as a linear function of logit-transformed accuracy.  Taori et al. (2020) Linear probe average over 26 datasetsCLIP-ViT CLIP-ResNet EfficientNet-NoisyStudent EfficientNet Instagram SimCLRv2 BYOL MoCo ViT (ImageNet-21k) BiT-M BiT-S ResNet Figure 12.\nCLIP's features are more robust to task shift when compared to models pre-trained on ImageNet. For both dataset splits, the transfer scores of linear probes trained on the representations of CLIP models are higher than other models with similar ImageNet performance. This suggests that the representations of models trained on ImageNet are somewhat overfit to their task.\nor fine-tuned on the ImageNet dataset. Returning to the discussion in the introduction to this section -is training or adapting to the ImageNet dataset distribution the cause of the observed robustness gap? Intuitively, a zero-shot model should not be able to exploit spurious correlations or patterns that hold only on a specific distribution, since it is not trained on that distribution. 4 Thus it is reasonable to expect zero-shot models to have much higher effective robustness. In Figure 13, we compare the performance of zero-shot CLIP with existing ImageNet models on natural distribution shifts. All zero-shot CLIP models improve effective robustness by a large amount and reduce the size of the gap between ImageNet accuracy and accuracy under distribution shift by up to 75%.\nWhile these results show that zero-shot models can be much more robust, they do not necessarily mean that supervised learning on ImageNet causes a robustness gap. Other details of CLIP, such as its large and diverse pre-training dataset or use of natural language supervision could also result in much more robust models regardless of whether they are zero-shot or fine-tuned. As an initial experiment to potentially begin narrowing this down, we also measure how the performance of CLIP models change after adapting to the ImageNet distribution via a L2 regularized logistic regression classifier fit to CLIP features on the ImageNet training set. We visualize how performance changes from the zero-shot classifier in Figure 14. Although adapting CLIP to the ImageNet distribution increases its ImageNet accuracy by 9.2% to 85.4% overall, and ties the accuracy of the 2018 SOTA from Mahajan et al. (2018), average accuracy under distribution shift slightly decreases.\nIt is surprising to see a 9.2% increase in accuracy, which corresponds to roughly 3 years of improvement in SOTA, fail to translate into any improvement in average performance under distribution shift. We also break down the differences between zero-shot accuracy and linear classifier accuracy per dataset in Figure 14 and find performance still increases significantly on one dataset, ImageNetV2. ImageNetV2 closely followed the creation process of the original Ima-geNet dataset which suggests that gains in accuracy from supervised adaptation are closely concentrated around the ImageNet distribution. Performance decreases by 4.7% on   ImageNet-R, 3.8% on ObjectNet, 2.8% on ImageNet Sketch, and 1.9% on ImageNet-A. The change in accuracy on the two other datasets, Youtube-BB and ImageNet Vid, is insignificant.\nHow is it possible to improve accuracy by 9.2% on the Im-ageNet dataset with little to no increase in accuracy under distribution shift? Is the gain primarily from \"exploiting spurious correlations\"? Is this behavior unique to some combination of CLIP, the ImageNet datatset, and the distribution shifts studied, or a more general phenomena? Does it hold for end-to-end finetuning as well as linear classifiers? We do not have confident answers to these questions at this time. Prior work has also pre-trained models on distributions other than ImageNet, but it is common to study and release models only after they have been fine-tuned to ImageNet. As a step towards understanding whether pre-trained zero-shot models consistently have higher effective robustness than fine-tuned models, we encourage the authors of Mahajan et al. (2018), Kolesnikov et al. (2019), and Dosovitskiy et al. (2020) to, if possible, study these questions on their models as well.\nWe also investigate another robustness intervention enabled by flexible zero-shot natural-language-based image classifiers. The target classes across the 7 transfer datasets are not always perfectly aligned with those of ImageNet. Two datasets, Youtube-BB and ImageNet-Vid, consist of superclasses of ImageNet. This presents a problem when trying to use the fixed 1000-way classifier of an ImageNet model to make predictions.  Taori et al. (2020) handle this by max-pooling predictions across all sub-classes according to the ImageNet class hierarchy. Sometimes this mapping is much less than perfect. For the person class in Youtube-BB, predictions are made by pooling over the ImageNet classes for a baseball player, a bridegroom, and a scuba diver. With CLIP we can instead generate a custom zero-shot classifier for each dataset directly based on its class names. In Figure 14 we see that this improves average effective robustness by 5% but is concentrated in large improvements on only a few datasets. Curiously, accuracy on ObjectNet also increases by 2.3%. Although the dataset was designed to closely overlap with ImageNet classes, using the names provided for each class by ObjectNet's creators still helps a small amount compared to using ImageNet class names and pooling predictions when necessary.\nWhile zero-shot CLIP improves effective robustness, Figure 14 shows that the benefit is almost entirely gone in a fully supervised setting. To better understand this difference, we investigate how effective robustness changes on the continuum from zero-shot to fully supervised. In Figure 15 we visualize the performance of 0-shot, 1-shot, 2-shot, 4-shot ..., 128-shot, and fully supervised logistic regression classifiers on the best CLIP model's features. We see that while few-shot models also show higher effective robustness than existing models, this benefit fades as in-distribution performance increases with more training data and is mostly, though not entirely, gone for the fully supervised model. Additionally, zero-shot CLIP is notably more robust than a few-shot model with equivalent ImageNet performance. Across our experiments, high effective robustness seems to result from minimizing the amount of distribution specific training data a model has access to, but this comes at a cost of reducing dataset-specific performance.\nTaken together, these results suggest that the recent shift towards large-scale task and dataset agnostic pre-training combined with a reorientation towards zero-shot and fewshot benchmarking on broad evaluation suites (as advocated by Yogatama et al. (2019) and Linzen (2020)) promotes the development of more robust systems and provides a more accurate assessment of performance. We are curious to see if the same results hold for zero-shot models in the field of NLP such as the GPT family. While Hendrycks et al. (2020b) has reported that pre-training improves relative robustness on sentiment analysis, Miller et al. (2020) 's study of the robustness of question answering models under natural distribution shift finds, similar to Taori et al. (2020), little evidence of effective robustness improvements to date.\n\n4. Comparison to Human Performance\nHow does CLIP compare to human performance and human learning? To get a better understanding of how well humans perform in similar evaluation settings to CLIP, we evaluated humans on one of our tasks. We wanted to get a sense of how strong human zero-shot performance is at these tasks, and how much human performance is improved if they are shown one or two image samples. This can help us to compare task difficulty for humans and CLIP, and identify correlations and differences between them.\nWe had five different humans look at each of 3669 images in the test split of the Oxford IIT Pets dataset (Parkhi et al., 2012) and select which of the 37 cat or dog breeds best matched the image (or 'I don't know' if they were completely uncertain). In the zero-shot case the humans were given no examples of the breeds and asked to label them to the best of their ability without an internet search. In the one-shot experiment the humans were given one sample image of each breed and in the two-shot experiment they were given two sample images of each breed. 5 One possible concern was that the human workers were not sufficiently motivated in the zero-shot task. High human accuracy of 94% on the STL-10 dataset (Coates et al., 2011) 5 There is not a perfect correspondence between the human few-shot tasks and the model's few-shot performance since the model cannot refer to sample images in the way that the humans can. and 97-100% accuracy on the subset of attention check images increased our trust in the human workers.\nInterestingly, humans went from a performance average of 54% to 76% with just one training example per class, and the marginal gain from an additional training example is minimal. The gain in accuracy going from zero to one shot is almost entirely on images that humans were uncertain about. This suggests that humans \"know what they don't know\" and are able to update their priors on the images they are most uncertain in based on a single example. Given this, it seems that while CLIP is a promising training strategy for zero-shot performance (Figure 5) and does well on tests of natural distribution shift (Figure 13), there is a large difference between how humans learn from a few examples and the few-shot methods in this paper.\nThis suggests that there are still algorithmic improvements waiting to be made to decrease the gap between machine and human sample efficiency, as noted by Lake et al. (2016) and others. Because these few-shot evaluations of CLIP don't make effective use of prior knowledge and the humans do, we speculate that finding a method to properly integrate prior knowledge into few-shot learning is an important step in algorithmic improvements to CLIP. To our knowledge, using a linear classifier on top of the features of a high- As in Parkhi et al. (2012), the metric is average per-class classification accuracy. Most of the gain in performance when going from the human zero shot case to the human one shot case is on images that participants were highly uncertain on. \"Guesses\" refers to restricting the dataset to where participants selected an answer other than \"I don't know\", the \"majority vote\" is taking the most frequent (exclusive of ties) answer per image.\nquality pre-trained model is near state-of-the-art for few shot learning (Tian et al., 2020), which suggests that there is a gap between the best few-shot machine learning methods and human few-shot learning.\nIf we plot human accuracy vs CLIP's zero shot accuracy (Figure 16), we see that the hardest problems for CLIP are also hard for humans. To the extent that errors are consistent, our hypothesis is that this is due to at least a two factors: noise in the dataset (including mislabeled images) and out of distribution images being hard for both humans and models.\n\n5. Data Overlap Analysis\nA concern with pre-training on a very large internet dataset is unintentional overlap with downstream evals. This is important to investigate since, in a worst-case scenario, a complete copy of an evaluation dataset could leak into the pre-training dataset and invalidate the evaluation as a meaningful test of generalization. One option to prevent this is to identify and remove all duplicates before training a model. While this guarantees reporting true hold-out performance, it requires knowing all possible data which a model might be evaluated on ahead of time. This has the downside of limiting the scope of benchmarking and analysis. Adding a new evaluation would require an expensive re-train or risk reporting an un-quantified benefit due to overlap.\nInstead, we document how much overlap occurs and how performance changes due to these overlaps. To do this, we use the following procedure: contains all examples that are below this threshold. We denote the unaltered full dataset All for reference. From this we first record the degree of data contamination as the ratio of the number of examples in Overlap to the size of All.\n2) We then compute the zero-shot accuracy of CLIP RN50x64 on the three splits and report All -Clean as our main metric. This is the difference in accuracy due to contamination. When positive it is our estimate of how much the overall reported accuracy on the dataset was inflated by over-fitting to overlapping data.\n3) The amount of overlap is often small so we also run a binomial significance test where we use the accuracy on Clean as the null hypothesis and compute the one-tailed (greater) p-value for the Overlap subset. We also calculate 99.5% Clopper-Pearson confidence intervals on Dirty as another check.\nA summary of this analysis is presented in Figure 17. Out of 35 datasets studied, 9 datasets have no detected overlap at all. Most of these datasets are synthetic or specialized making them unlikely to be posted as normal images on the internet (for instance MNIST, CLEVR, and GTSRB) or are guaranteed to have no overlap due to containing novel data from after the date our dataset was created (ObjectNet and Hateful Memes). This demonstrates our detector has a low-false positive rate which is important as false positives would under-estimate the effect of contamination in our analysis. There is a median overlap of 2.2% and an average overlap of 3.2%. Due to this small amount of overlap, overall accuracy is rarely shifted by more than 0.1% with only 7 datasets above this threshold. Of these, only 2 are statistically significant after Bonferroni correction. The max detected improvement is only 0.6% on Birdsnap which has the second largest overlap at 12.1%. The largest overlap is for Country211 at 21.5%. This is due to it being constructed out of YFCC100M, which our pre-training dataset contains a filtered subset of. Despite this large overlap there is only a 0.2% increase in accuracy on Country211. This may be because the training text accompanying an example is often not related to the specific task a downstream eval measures.\nCountry211 measures geo-localization ability, but inspecting the training text for these duplicates showed they often do not mention the location of the image.\nWe are aware of two potential concerns with our analysis. First our detector is not perfect. While it achieves near 100% accuracy on its proxy training task and manual inspection + threshold tuning results in very high precision with good recall among the found nearest-neighbors, we can not tractably check its recall across 400 million examples.\nAnother potential confounder of our analysis is that the underlying data distribution may shift between the Overlap and Clean subsets. For example, on Kinetics-700 many \"overlaps\" are in fact all black transition frames. This explains why Kinetics-700 has an apparent 20% accuracy drop on Overlap. We suspect more subtle distribution shifts likely exist. One possibility we noticed on CIFAR-100 is that, due to the very low resolution of its images, many duplicates were false positives of small objects such as birds or planes. Changes in accuracy could instead be due to changes in the class distribution or difficulty of the duplicates. Unfortunately, these distribution and difficulty shifts could also mask the effects of over-fitting.\nHowever, these results closely follow the findings of similar duplicate analysis in previous work on large scale pretraining.  Mahajan et al. (2018) and Kolesnikov et al. (2019) detected similar overlap rates and found minimal changes in overall performance. Importantly, Kolesnikov et al. ( 2019) also compared the alternative de-duplication strategy discussed in the introduction to this section with the approach we settled on and observed little difference between the two approaches.\n\n6. Limitations\nThere are still many limitations to CLIP. While several of these are discussed as part of analysis in various sections, we summarize and collect them here.\nOn datasets with training splits, the performance of zeroshot CLIP is on average competitive with the simple su- (Right) Since the percentage of detected overlapping examples is almost always in the single digits, the overall test accuracy gain due to overlap is much smaller with the largest estimated increase being only 0.6% on Birdsnap. Similarly, for only 6 datasets are the accuracy improvements statistically significant when calculated using a one-sided binomial test.\npervised baseline of a linear classifier on top of ResNet-50 features. On most of these datasets, the performance of this baseline is now well below the overall state of the art. Significant work is still needed to improve the task learning and transfer capabilities of CLIP. While scaling has so far steadily improved performance and suggests a route for continued improvement, we estimate around a 1000x increase in compute is required for zero-shot CLIP to reach overall state-of-the-art performance. This is infeasible to train with current hardware. Further research into improving upon the computational and data efficiency of CLIP will be necessary.\nAnalysis in Section 3.1 found that CLIP's zero-shot performance is still quite weak on several kinds of tasks. When compared to task-specific models, the performance of CLIP is poor on several types of fine-grained classification such as differentiating models of cars, species of flowers, and variants of aircraft. CLIP also struggles with more abstract and systematic tasks such as counting the number of objects in an image. Finally for novel tasks which are unlikely to be included in CLIP's pre-training dataset, such as classifying the distance to the nearest car in a photo, CLIP's performance can be near random. We are confident that there are still many, many, tasks where CLIP's zero-shot performance is near chance level.\nWhile zero-shot CLIP generalizes well to many natural image distributions as investigated in Section 3.3, we've observed that zero-shot CLIP still generalizes poorly to data that is truly out-of-distribution for it. An illustrative example occurs for the task of OCR as reported in Appendix E.\nCLIP learns a high quality semantic OCR representation that performs well on digitally rendered text, which is common in its pre-training dataset, as evidenced by performance on Rendered SST2. However, CLIP only achieves 88% accuracy on the handwritten digits of MNIST. An embarrassingly simple baseline of logistic regression on raw pixels outperforms zero-shot CLIP. Both semantic and near-duplicate nearest-neighbor retrieval verify that there are almost no images that resemble MNIST digits in our pre-training dataset. This suggests CLIP does little to address the underlying problem of brittle generalization of deep learning models. Instead CLIP tries to circumvent the problem and hopes that by training on such a large and varied dataset that all data will be effectively in-distribution. This is a naive assumption that, as MNIST demonstrates, is easy to violate.\nAlthough CLIP can flexibly generate zero-shot classifiers for a wide variety of tasks and datasets, CLIP is still limited to choosing from only those concepts in a given zero-shot classifier. This is a significant restriction compared to a truly flexible approach like image captioning which could generate novel outputs. Unfortunately, as described in Section 2.3 we found the computational efficiency of the image caption baseline we tried to be much lower than CLIP. A simple idea worth trying is joint training of a contrastive and generative objective with the hope of combining the efficiency of CLIP with the flexibility of a caption model. As another alternative, search could be performed at inference time over many natural language explanations of a given image, similar to approach proposed in Learning with Latent Language Andreas et al. (2017).\nCLIP also does not address the poor data efficiency of deep learning. Instead CLIP compensates by using a source of supervision that can be scaled to hundreds of millions of training examples. If every image seen during training of a CLIP model was presented at a rate of one per second, it would take 405 years to iterate through the 12.8 billion images seen over 32 training epochs. Combining CLIP with self-supervision (Henaff, 2020; Chen et al., 2020c) and self-training (Lee; Xie et al., 2020) methods is a promising direction given their demonstrated ability to improve data efficiency over standard supervised learning.\nOur methodology has several significant limitations. Despite our focus on zero-shot transfer, we repeatedly queried performance on full validation sets to guide the development of CLIP. These validation sets often have thousands of examples, which is unrealistic for true zero-shot scenarios. Similar concerns have been raised in the field of semi-supervised learning (Oliver et al., 2018). Another potential issue is our selection of evaluation datasets. While we have reported results on Kornblith et al. (2019) 's 12 dataset evaluation suite as a standardized collection, our main results use a somewhat haphazardly assembled collection of 27 datasets that is undeniably co-adapted with the development and capabilities of CLIP. Creating a new benchmark of tasks designed explicitly to evaluate broad zero-shot transfer capabilities, rather than re-using existing supervised datasets, would help address these issues.\nCLIP is trained on text paired with images on the internet. These image-text pairs are unfiltered and uncurated and result in CLIP models learning many social biases. This has been previously demonstrated for image caption models (Bhargava & Forsyth, 2019). We refer readers to Section 7 for detailed analysis and quantification of these behaviors for CLIP as well as discussion of potential mitigation strategies.\nWhile we have emphasized throughout this work that specifying image classifiers through natural language is a flexible and general interface, it has its own limitations. Many complex tasks and visual concepts can be difficult to specify just through text. Actual training examples are undeniably useful but CLIP does not optimize for few-shot performance directly. In our work, we fall back to fitting linear classifiers on top of CLIP's features. This results in a counter-intuitive drop in performance when transitioning from a zero-shot to a few-shot setting. As discussed in Section 4, this is notably different from human performance which shows a large increase from a zero to a one shot setting. Future work is needed to develop methods that combine CLIP's strong zero-shot performance with efficient few-shot learning.\n\n7. Broader Impacts\nCLIP has a wide range of capabilities due to its ability to carry out arbitrary image classification tasks. One can give it images of cats and dogs and ask it to classify cats, or give it images taken in a department store and ask it to classify shoplifters-a task with significant social implications and for which AI may be unfit. Like any image classification system, CLIP's performance and fitness for purpose need to be evaluated, and its broader impacts analyzed in context. CLIP also introduces a capability that will magnify and alter such issues: CLIP makes it possible to easily create your own classes for categorization (to 'roll your own classifier') without a need for re-training. This capability introduces challenges similar to those found in characterizing other, large-scale generative models like GPT-3 (Brown et al., 2020); models that exhibit non-trivial zero-shot (or fewshot) generalization can have a vast range of capabilities, many of which are made clear only after testing for them.\nOur studies of CLIP in a zero-shot setting show that the model displays significant promise for widely-applicable tasks like image retrieval or search. For example, it can find relevant images in a database given text, or relevant text given an image. Further, the relative ease of steering CLIP toward bespoke applications with little or no additional data or training could unlock a variety of novel applications that are hard for us to envision today, as has occurred with large language models over the past few years.\nIn addition to the more than 30 datasets studied in earlier sections of this paper, we evaluate CLIP's performance on the FairFace benchmark and undertake exploratory bias probes. We then characterize the model's performance in a downstream task, surveillance, and discuss its usefulness as compared with other available systems. Many of CLIP's capabilities are omni-use in nature (e.g. OCR can be used to make scanned documents searchable, to power screen reading technologies, or to read license plates). Several of the capabilities measured, from action recognition, object classification, and geo-localization, to facial emotion recognition, can be used in surveillance. Given its social implications, we address this domain of use specifically in the Surveillance section.\nWe have also sought to characterize the social biases inherent to the model. Our bias tests represent our initial efforts to probe aspects of how the model responds in different scenarios, and are by nature limited in scope. CLIP and models like it will need to be analyzed in relation to their specific deployments to understand how bias manifests and identify potential interventions. Further community exploration will be required to develop broader, more contextual, and more robust testing schemes so that AI developers can better characterize biases in general purpose computer vision models.\n\nModel\nRace\n\n7.1. Bias\nAlgorithmic decisions, training data, and choices about how classes are defined and taxonomized (which we refer to informally as \"class design\") can all contribute to and amplify social biases and inequalities resulting from the use of AI systems (Noble, 2018; Bechmann & Bowker, 2019; Bowker & Star, 2000). Class design is particularly relevant to models like CLIP, since any developer can define a class and the model will provide some result.\nIn this section, we provide preliminary analysis of some of the biases in CLIP, using bias probes inspired by those outlined in Buolamwini & Gebru (2018) and Kärkkäinen & Joo (2019). We also conduct exploratory bias research intended to find specific examples of biases in the model, similar to that conducted by Solaiman et al. (2019).\nWe start by analyzing the performance of Zero-Shot CLIP on the face image dataset FairFace (Kärkkäinen & Joo, 2019) 6   6 FairFace is a face image dataset designed to balance age, gender, and race, in order to reduce asymmetries common in previous face datasets. It categorizes gender into 2 groups: female and male and race into 7 groups: White, Black, Indian, East Asian, Southeast Asian, Middle Eastern, and Latino. There are inherent problems with race and gender classifications, as e.g.  Bowker & Star (2000) as an initial bias probe, then probe the model further to surface additional biases and sources of biases, including class design.\nWe evaluated two versions of CLIP on the FairFace dataset: a zero-shot CLIP model (\"ZS CLIP\"), and a logistic regression classifier fitted to FairFace's dataset on top of CLIP's features (\"LR CLIP\"). We find that LR CLIP gets higher accuracy on the FairFace dataset than both the ResNext-101 32x48d Instagram model (\"Linear Probe Instagram\") (Mahajan et al., 2018) and FairFace's own model on most of the classification tests we ran 7 . ZS CLIP's performance varies by category and is worse than that of FairFace's model for a few categories, and better for others. (See Table 3 and Table  4). and Keyes (2018) have shown. While FairFace's dataset reduces the proportion of White faces, it still lacks representation of entire large demographic groups, effectively erasing such categories. We use the 2 gender categories and 7 race categories defined in the FairFace dataset in a number of our experiments not in order to reinforce or endorse the use of such reductive categories, but in order to enable us to make comparisons to prior work. 7 One challenge with this comparison is that the FairFace model uses binary classes for race (\"White\" and \"Non-White\"), instead of breaking down races into finer-grained sub-groups. Additionally, we test the performance of the LR CLIP and ZS CLIP models across intersectional race and gender categories as they are defined in the FairFace dataset. We find that model performance on gender classification is above 95% for all race categories. Table 5 summarizes these results.\nWhile LR CLIP achieves higher accuracy than the Linear Probe Instagram model on the FairFace benchmark dataset for gender, race and age classification of images by intersectional categories, accuracy on benchmarks offers only one approximation of algorithmic fairness, as Raji et al. (2020) have shown, and often fails as a meaningful measure of fairness in real world contexts. Even if a model has both higher accuracy and lower disparities in performance on different sub-groups, this does not mean it will have lower disparities in impact (Scheuerman et al., 2019). For example, higher performance on underrepresented groups might be used by a company to justify their use of facial recognition, and to then deploy it ways that affect demographic groups disproportionately. Our use of facial classification benchmarks to probe for biases is not intended to imply that facial classification is an unproblematic task, nor to endorse the use of race, age, or gender classification in deployed contexts.\nWe also probed the model using classification terms with high potential to cause representational harm, focusing on denigration harms in particular (Crawford, 2017). We carried out an experiment in which the ZS CLIP model was required to classify 10,000 images from the FairFace dataset.\nIn addition to the FairFace classes, we added in the following classes: 'animal', 'gorilla', 'chimpanzee', 'orangutan', 'thief', 'criminal' and 'suspicious person'. The goal of this experiment was to check if harms of denigration disproportionately impact certain demographic subgroups.\nWe found that 4.9% (confidence intervals between 4.6% and 5.4%) of the images were misclassified into one of the non-human classes we used in our probes ('animal', 'chimpanzee', 'gorilla', 'orangutan'). Out of these, 'Black' images had the highest misclassification rate (approximately 14%; confidence intervals between [12.6% and 16.4%]) while all other races had misclassification rates under 8%. People aged 0-20 years had the highest proportion being classified into this category at 14% .\nWe also found that 16.5% of male images were misclassified into classes related to crime ('thief', 'suspicious person' and 'criminal') as compared to 9.8% of female images. Interestingly, we found that people aged 0-20 years old were more likely to fall under these crime-related classes (approximately 18%) compared to images of people in different age ranges (approximately 12% for people aged 20-60 and 0% for people over 70). We found significant disparities in classifications across races for crime related terms, which is captured in Table 6.\nGiven that we observed that people under 20 were the most likely to be classified in both the crime-related and nonhuman animal categories, we carried out classification for the images with the same classes but with an additional category 'child' added to the categories. Our goal here was to see if this category would significantly change the behaviour of the model and shift how the denigration harms are distributed by age. We found that this drastically reduced the number of images of people under 20 classified in either crime-related categories or non-human animal categories (Table 7). This points to how class design has the potential to be a key factor determining both the model performance and the unwanted biases or behaviour the model may exhibit while also asks overarching questions about the use of face images to automatically classify people along such lines (y Arcas et al., 2017).\nThe results of these probes can change based on the class categories one chooses to include as well as the specific language one uses to describe each class. Poor class design can lead to poor real world performance; this concern is particularly relevant to a model like CLIP, given how easily developers can design their own classes.\nWe also carried out experiments similar to those outlined by Schwemmer et al. (2020) to test how CLIP treated images of men and women differently using images of Members of Congress. As part of these experiments, we studied how certain additional design decisions such as deciding thresholds for labels can impact the labels output by CLIP and how biases manifest.\nWe carried out three experiments -we tested for accuracy on gender classification and we tested for how labels were differentially distributed across two different label sets. For our first label set, we used a label set of 300 occupations and for our second label set we used a combined set of labels that Google Cloud Vision, Amazon Rekognition and Microsoft Azure Computer Vision returned for all the images.\nWe first simply looked into gender prediction performance of the model on the images of Members of Congress, in order to check to see if the model correctly recognized men as men and women as women given the image of a person who appeared to be in an official setting/position of power. We found that the model got 100% accuracy on the images. This is slightly better performance than the model's performance on the FairFace dataset. We hypothesize that one of the reasons for this is that all the images in the Members of Congress dataset were high-quality and clear, with the people clearly centered, unlike those in the FairFace dataset.\nIn order to study how the biases in returned labels depend on the thresholds set for label probability, we did an experiment in which we set threshold values at 0.5% and 4.0%. We found that the lower threshold led to lower quality of labels. However, even the differing distributions of labels under this threshold can hold signals for bias. For example, we find that under the 0.5% threshold labels such as 'nanny' and 'housekeeper' start appearing for women whereas labels such as 'prisoner' and 'mobster' start appearing for men. This points to gendered associations similar to those that have previously been found for occupations (Schwemmer et al., 2020) (Nosek et al., 2002) (Bolukbasi et al., 2016).\nAt the higher 4% threshold, the labels with the highest probability across both genders include \"lawmaker\", \"legislator\" and \"congressman\". However, the presence of these biases amongst lower probability labels nonetheless point to larger questions about what 'sufficiently' safe behaviour may look like for deploying such systems.\nWhen given the combined set of labels that Google Cloud Vision (GCV), Amazon Rekognition and Microsoft returned for all the images, similar to the biases Schwemmer et al. (2020) found in GCV systems, we found our system also disproportionately attached labels to do with hair and appearance in general to women more than men. For example, labels such as 'brown hair', 'blonde' and 'blond' appeared significantly more often for women. Additionally, CLIP attached some labels that described high status occupations disproportionately more often to men such as 'executive' and 'doctor'. Out of the only four occupations that it attached more often to women, three were 'newscaster', 'television presenter' and 'newsreader' and the fourth was 'Judge'. This is again similar to the biases found in GCV and points to historical gendered differences (Schwemmer et al., 2020).\nInterestingly, when we lowered the threshold to 0.5% for this set of labels, we found that the labels disproportionately describing men also shifted to appearance oriented words such as 'suit', 'tie' and 'necktie' (Figure 18). Many occupation oriented words such as 'military person' and 'executive' -which were not used to describe images of women at the higher 4% threshold -were used for both men and women at the lower 0.5% threshold, which could have caused the change in labels for men. The reverse was not true. Descriptive words used to describe women were still uncommon amongst men.\nDesign decisions at every stage of building a model impact how biases manifest and this is especially true for CLIP given the flexibility it offers. In addition to choices about training data and model architecture, decisions about things like class designs and thresholding values can alter the labels a model outputs and as a result heighten or lower certain kinds of harm, such as those described by Crawford (2017). People designing and developing models and AI systems have considerable power. Decisions about things like class design are a key determiner not only of model performance, but also of how and in what contexts model biases manifest.\nThese experiments are not comprehensive. They illustrate potential issues stemming from class design and other sources of bias, and are intended to spark inquiry.\n\n7.2. Surveillance\nWe next sought to characterize model performance in relation to a downstream task for which there is significant societal sensitivity: surveillance. Our analysis aims to better embody the characterization approach described above and to help orient the research community towards the potential future impacts of increasingly general purpose computer vision models and aid the development of norms and checks Top labels, images of men Women Men0\nFigure 18. CLIP performance on Member of Congress images when given the combined returned label set for the images from Google Cloud Vision, Amazon Rekognition and Microsoft Azure Computer Vision. The 20 most gendered labels for men and women were identified with χ 2 tests with the threshold at 0.5%. Labels are sorted by absolute frequencies. Bars denote the percentage of images for a certain label by gender. around such systems. Our inclusion of surveillance is not intended to indicate enthusiasm for this domain -rather, we think surveillance is an important domain to try to make predictions about given its societal implications (Zuboff, 2015; Browne, 2015).\nWe measure the model's performance on classification of images from CCTV cameras and zero-shot celebrity identification. We first tested model performance on low-resolution images captured from surveillance cameras (e.g. CCTV cameras). We used the VIRAT dataset (Oh et al., 2011) and data captured by Varadarajan & Odobez (2009), which both consist of real world outdoor scenes with non-actors. Given CLIP's flexible class construction, we tested 515 surveillance images captured from 12 different video sequences on self-constructed general classes for coarse and fine grained classification. Coarse classification required the model to correctly identify the main subject of the image (i.e. determine if the image was a picture of an empty parking lot, school campus, etc.). For fine-grained classification, the model had to choose between two options constructed to determine if the model could identify the presence/absence of smaller features in the image such as a person standing in the corner.\nFor coarse classification, we constructed the classes by handcaptioning the images ourselves to describe the contents of the image and there were always at least 6 options for the model to choose from. Additionally, we carried out a 'stress test' where the class set included at least one more caption for something that was 'close' to the image (for example, 'parking lot with white car' vs. 'parking lot with red car'). We found that the model had a top-1 accuracy of 91.8% on the CCTV images for the initial evaluation. The accuracy dropped significantly to 51.1% for the second evaluation, with the model incorrectly choosing the 'close' answer 40.7% of the time.\nFor fine-grained detection, the zero-shot model performed poorly, with results near random. Note that this experiment was targeted only towards detecting the presence or absence of small objects in image sequences.\nWe also tested CLIP's zero-shot performance for 'in the wild' identity detection using the CelebA dataset 8. We did this to evaluate the model's performance for identity detection using just the publicly available data it was pre-trained on. While we tested this on a dataset of celebrities who have a larger number of images on the internet, we hypothesize that the number of images in the pre-training data needed for the model to associate faces with names will keep decreasing as models get more powerful (see Table 8), which has significant societal implications (Garvie, 2019) mirrors recent developments in natural language processing, in which recent large language models trained on Internet data often exhibit a surprising ability to provide information related to relatively minor public figures (Brown et al., 2020).\nWe found that the model had 59.2% top-1 accuracy out of 100 possible classes for 'in the wild' 8k celebrity images. However, this performance dropped to 43.3% when we increased our class sizes to 1k celebrity names. This performance is not competitive when compared to production level models such as Google's Celebrity Recognition (Google). However, what makes these results noteworthy is that this analysis was done using only zero-shot identification capabilities based on names inferred from pre-training data -we didn't use any additional task-specific dataset, and so the (relatively) strong results further indicate that before deploying multimodal models, people will need to carefully study them for behaviors in a given context and domain.\nCLIP offers significant benefit for tasks that have relatively little data given its zero-shot capabilities. However, large datasets and high performing supervised models exist for many in-demand surveillance tasks such as facial recognition. As a result, CLIP's comparative appeal for such uses is low. Additionally, CLIP is not designed for common surveillance-relevant tasks like object detection and semantic segmentation. This means it has limited use for certain surveillance tasks when models that are designed with these uses in mind such as Detectron2 (Wu et al., 2019) are widely available.\nHowever, CLIP does unlock a certain aspect of usability given how it removes the need for training data. Thus, CLIP and similar models could enable bespoke, niche surveillance use cases for which no well-tailored models or datasets exist, and could lower the skill requirements to build such applications. As our experiments show, ZS CLIP displays nontrivial, but not exceptional, performance on a few surveillance relevant tasks today.\n\n7.3. Future Work\nThis preliminary analysis is intended to illustrate some of the challenges that general purpose computer vision models pose and to give a glimpse into their biases and impacts.\nWe hope that this work motivates future research on the characterization of the capabilities, shortcomings, and biases of such models, and we are excited to engage with the research community on such questions.\nWe believe one good step forward is community exploration to further characterize the capabilities of models like CLIP and -crucially -identify application areas where they have promising performance and areas where they may have reduced performance 9 . This process of characterization can help researchers increase the likelihood models are used beneficially by:\n• Identifying potentially beneficial downstream uses of models early in the research process, enabling other researchers to think about applications.\n• Surfacing tasks with significant sensitivity and a large set of societal stakeholders, which may call for intervention by policymakers.\n• Better characterizing biases in models, alerting other researchers to areas of concern and areas for interventions.\n• Creating suites of tests to evaluate systems like CLIP on, so we can better characterize model capabilities earlier in the development cycle.\n• Identifying potential failure modes and areas for further work.\nWe plan to contribute to this work, and hope this analysis provides some motivating examples for subsequent research.\n\n8. Related Work\nAny model that leverages written, spoken, signed or any other form of human language as part of its training signal is arguably using natural language as a source of supervision. This is an admittedly extremely broad area and covers most work in the field of distributional semantics including topic models (Blei et al., 2003), word, sentence, and paragraph vectors (Mikolov et al., 2013; Kiros et al., 2015; Le & Mikolov, 2014), and language models (Bengio et al., 2003).\nIt also includes much of the broader field of NLP that deals with predicting or modeling sequences of natural language in some way. Work in NLP intentionally leveraging natural language supervision in the form of explanations, feedback, instructions, and advice for tasks such as classification (as opposed to the commonly used representation of supervision as a set of arbitrarily encoded discrete category labels) has 9 A model could be unfit for use due to inadequate performance or due to the inappropriateness of AI use in the application area itself.\nbeen explored in many creative and advanced ways. Dialog based learning (Weston, 2016; Li et al., 2016; Hancock et al., 2019) develops techniques to learn from interactive natural language feedback in dialog. Several papers have leveraged semantic parsing to convert natural language explanations into features (Srivastava et al., 2017) or additional training labels (Hancock et al., 2018). More recently, ExpBERT (Murty et al., 2020) uses feature representations produced by conditioning a deep contextual language model on natural language explanations and descriptions of relations to improve performance on the task of relation extraction.\nCLIP is an example of using natural language as a training signal for learning about a domain other than language. In this context, the earliest use of the term natural language supervision that we are aware of is the work of Ramanathan et al. (2013) which showed that natural language descriptions could be used along side other sources of supervision to improve performance on the task of video event understanding. However, as mentioned in the introduction and approach section, methods of leveraging natural language descriptions in computer vision well predate the use of this specific term, especially for image retrieval (Mori et al., 1999) and object classification (Wang et al., 2009). Other early work leveraged tags (but not natural language) associated with images for the task of semantic segmentation (Barnard et al., 2003). More recently, He & Peng (2017) and Liang et al. (2020) demonstrated using natural language descriptions and explanations to improve fine-grained visual classification of birds. Others have investigated how grounded language can be used to improve visual representations and classifiers on the ShapeWorld dataset (Kuhnle & Copestake, 2017; Andreas et al., 2017; Mu et al., 2019). Finally, techniques which combine natural language with reinforcement learning environments (Narasimhan et al., 2015) have demonstrated exciting emergent behaviors such as systematically accomplishing zero-shot tasks (Hill et al., 2019). CLIP's pre-training task optimizes for text-image retrieval. This areas of research dates back to the mid-90s with the previously mentioned Mori et al. (1999) as representative of early work. While initial efforts focused primarily on predictive objectives over time research shifted towards learning joint multi-modal embedding spaces with techniques like kernel Canonical Correlation Analysis and various ranking objectives (Weston et al., 2010; Socher & Fei-Fei, 2010; Hodosh et al., 2013). Over time work explored many combinations of training objective, transfer, and more expressive models and steadily improved performance (Frome et al., 2013; Socher et al., 2014; Karpathy et al., 2014; Kiros et al., 2014; Faghri et al., 2017).\nOther work has leveraged natural language supervision for domains other than images.  Stroud et al. (2020) explores large scale representation learning by training a system to pair descriptive text with videos instead of images. Several works have explored using dense spoken natural language supervision for videos (Miech et al., 2019; 2020b). When considered together with CLIP, these works suggest that large scale natural language supervision is a promising way to learn high quality perceptual systems for many domains.  Alayrac et al. (2020) extended this line of work to an additional modality by adding raw audio as an additional supervision source and demonstrated benefits from combining all three sources of supervision.\nAs part of our work on CLIP we also construct a new dataset of image-text pairs. Modern work on image-text retrieval has relied on a set of crowd-sourced sentence level image caption evaluation datasets like Pascal1K (Rashtchian et al., 2010), Flickr8K (Hodosh et al., 2013), and Flickr30K (Young et al., 2014). However, these datasets are still relatively small and limit achievable performance. Several methods have been proposed to create larger datasets automatically with Ordonez et al. (2011) as a notable early example. In the deep learning era, Mithun et al. (2018) demonstrated an additional set of (image, text) pairs collected from the internet could improve retrieval performance and several new automatically constructed datasets such as Conceptual Captions (Sharma et al., 2018), LAIT (Qi et al., 2020), and OCR-CC (Yang et al., 2020) have been created. However, these datasets still use significantly more aggressive filtering or are designed for a specific task such as OCR and as a result are still much smaller than WIT with between 1 and 10 million training examples.\nA related idea to CLIP is webly supervised learning. This line of work queries image search engines to build image datasets by querying for terms and uses the queries as the labels for the returned images (Fergus et al., 2005). Classifiers trained on these large but noisily labeled datasets can be competitive with those trained on smaller carefully labeled datasets. These image-query pairs are also often used to improve performance on standard datasets as additional training data (Chen & Gupta, 2015). CLIP also uses search queries as part of its dataset creation process. However CLIP only uses full text sequences co-occuring with images as supervision rather than just the queries, which are often only a single word or short n-gram. We also restrict this step in CLIP to text only querying for sub-string matches while most webly supervised work uses standard image search engines which have their own complex retrieval and filtering pipelines that often involve computer vision systems. Of this line of work, Learning Everything about Anything: Webly-Supervised Visual Concept Learning (Divvala et al., 2014) has a notably similar ambition and goal as CLIP.\nFinally, CLIP is related to a recent burst of activity on learning joint models of vision and language (Lu et al., 2019; Tan & Bansal, 2019; Chen et al., 2019; Li et al., 2020b; Yu et al., 2020). This line of work focuses on richly connecting vision and language in order to solve complex downstream tasks such as visual question answering, visual commonsense reasoning, or multimodal entailment. These approaches leverage impressively engineered models which combine 3 (or more) pre-trained subsystems, typically an image feature model, a region proposal / object detection model, and a pre-trained masked language model such as BERT. These systems are then jointly fine-tuned via various training objectives on image-text pairs and applied to the aforementioned tasks and achieve impressive results. CLIP is instead focused on learning visual models from scratch via natural language supervision and does not densely connect the two domains with a joint attention model. The only interaction in a CLIP model between the image and text domain is a single dot product in a learned joint embedding space. We are excited to see CLIP hybridized with this line of work.\n\n9. Conclusion\nWe have investigated whether it is possible to transfer the success of task-agnostic web-scale pre-training in NLP to another domain. We find that adopting this formula results in similar behaviors emerging in the field of computer vision and discuss the social implications of this line of research. In order to optimize their training objective, CLIP models learn to perform a wide variety of tasks during pretraining. This task learning can then be leveraged via natural language prompting to enable zero-shot transfer to many existing datasets. At sufficient scale, the performance of this approach can be competitive with task-specific supervised models although there is still room for much improvement.\n\nA. Linear-probe evaluation\nWe provide additional details for linear probe experiments presented in this paper, including the list of the datasets and models used for evaluation.\n\nA.1. Datasets\nWe use the 12 datasets from the well-studied evaluation suite introduced by (Kornblith et al., 2019) and add 15 additional datasets in order to assess the performance of models on a wider variety of distributions and tasks. These datasets include MNIST, the Facial Expression Recognition 2013 dataset (Goodfellow et al., 2015), STL-10 (Coates et al., 2011), EuroSAT (Helber et al., 2019), the NWPU-RESISC45 dataset (Cheng et al., 2017), the German Traffic Sign Recognition Benchmark (GTSRB) dataset (Stallkamp et al., 2011), the KITTI dataset (Geiger et al., 2012), PatchCamelyon (Veeling et al., 2018), the UCF101 action recognition dataset (Soomro et al., 2012), Kinetics 700 (Carreira et al., 2019), 2,500 random samples of the CLEVR dataset (Johnson et al., 2017), the Hateful Memes dataset (Kiela et al., 2020), and the ImageNet-1k dataset (Deng et al., 2012). For the two video datasets (UCF101 and Ki-netics700), we use the middle frame of each video clip as the input image. STL-10 and UCF101 have multiple predefined train/validation/test splits, 10 and 3 respectively, and we report the average over all splits. Details on each dataset and the corresponding evaluation metrics are provided in Table 9.\nAdditionally, we created two datasets that we call Coun-try211 and Rendered SST2. The Country211 dataset is designed to assess the geolocation capability of visual representations. We filtered the YFCC100m dataset (Thomee et al., 2016) to find 211 countries (defined as having an ISO-3166 country code) that have at least 300 photos with GPS coordinates, and we built a balanced dataset with 211 categories, by sampling 200 photos for training and 100 photos for testing, for each country.\nThe Rendered SST2 dataset is designed to measure the optical character recognition capability of visual representations. To do so, we used the sentences from the Stanford Sentiment Treebank dataset (Socher et al., 2013) and rendered them into images, with black texts on a white background, in a 448×448 resolution. Two example images from this dataset are shown in Figure 19.\n\nA.2. Models\nIn combination with the datasets listed above, we evaluate the following series of models using linear probes.\nLM RN50 This is a multimodal model that uses an autoregressive loss instead of a contrastive loss, while using the ResNet-50 architecture as in the smallest contrastive model. To do so, the output from the CNN is projected into four tokens, which are then fed as a prefix to a language model autoregressively predicting the text tokens. Apart from the training objective, the model was trained on the same dataset for the same number of epochs as other CLIP models.\nCLIP-RN Five ResNet-based contrastive CLIP models are included. As discussed in the paper, the first two models follow ResNet-50 and ResNet-101, and we use EfficientNetstyle (Tan & Le, 2019) scaling for the next three models which simultaneously scale the model width, the number of layers, and the input resolution to obtain models with roughly 4x, 16x, and 64x computation.\n\nCLIP-ViT\nWe include four CLIP models that use the Vision Transformer (Dosovitskiy et al., 2020) architecture as the image encoder. We include three models trained on 224by-224 pixel images: ViT-B/32, ViT-B/16, ViT-L/14, and the ViT-L/14 model fine-tuned on 336-by-336 pixel input images.\nEfficietNet We use the nine models (B0-B8) from the original EfficientNet paper (Tan & Le, 2019), as well as the noisy-student variants (B0-B7, L2-475, and L2-800) (Tan & Le, 2019). The largest models (L2-475 and L2-800) take the input resolutions of 475x475 and 800x800 pixels, respectively.\nInstagram-pretrained ResNeXt We use the four models (32x8d, 32x16d, 32x32d, 32x48d) released by (Mahajan et al., 2018), as well as their two FixRes variants which use higher input resolutions (Touvron et al., 2019).\nBig Transfer (BiT) We use BiT-S and BiT-M models (Kolesnikov et al., 2019), trained on the ImageNet-1k and ImageNet-21k datasets. The model weights for BiT-L is not publicly available.\nVision Transformer (ViT) We also include four ViT (Dosovitskiy et al., 2020) checkpoints pretrained on the ImageNet-21k dataset, namely ViT-B/32, ViT-B/16, ViT-L/16, and ViT-H/14. We note that their best-performing models, trained on the JFT-300M dataset, are not available publicly.\nSimCLRv2 The SimCLRv2 (Chen et al., 2020c) project released pre-trained and fine-tuned models in various settings. We use the seven pretrain-only checkpoints with selective kernels.\nBYOL We use the recently released model weights of BYOL (Grill et al., 2020), specifically their 50x1 and 200x2 Momentum Contrast (MoCo) We include the MoCo-v1 (He et al., 2020) and the MoCo-v2 (Chen et al., 2020d) checkpoints.\nVirTex We use the pretrained model of VirTex (Desai & Johnson, 2020). We note that VirTex has a similar model design to CLIP-AR but is trained on a 1000x smaller dataset of high-quality captions from MSCOCO.\nResNet We add the original ResNet checkpoints released by (He et al., 2016b), namely ResNet-50, ResNet-101, and ResNet152.\n\nA.3. Evaluation\nWe use image features taken from the penultimate layer of each model, ignoring any classification layer provided. For CLIP-ViT models, we used the features before the linear projection to the embedding space, which corresponds to I f in Figure 3. We train a logistic regression classifier using scikit-learn's L-BFGS implementation, with maximum 1,000 iterations, and report the corresponding metric for each dataset. We determine the L2 regularization strength λ using a hyperparameter sweep on the validation sets over the range between 10 −6 and 10 6 , with 96 logarithmically spaced steps. To save compute required for the sweeps, we perform a parametric binary search that starts with λ = [10 −6 , 10 −4 , 10 −2 , 1, 10 2 , 10 4 , 10 6 ] and iteratively halves the interval around the peak until it reaches a resolution of 8 steps per decade. The hyperparameter sweeps are performed on a validation split of each dataset. For the datasets that contain a validation split in addition to a test split, we use the provided validation set to perform the hyperparameter search, and for the datasets that do not provide a validation split or have not published labels for the test data, we split the training dataset to perform the hyperparameter search. For the final result, we combine the validation split back with the training split and report the performance on the unused split.\n\nA.4. Results\nThe individual linear probe scores are provided in Table 10 and plotted in Figure 20. The best-performing CLIP model, using ViT-L/14 archiecture and 336-by-336 pixel images, achieved the state of the art in 21 of the 27 datasets, i.e. included in the Clopper-Pearson 99.5% confidence interval around each dataset's top score. For many datasets, CLIP performs significantly better than other models, demonstrating the advantage of natural language supervision over traditional pre-training approaches based on image classification. See Section 3.2 for more discussions on the linear probe results.\n\nDataset\nClasses\n\nB. Zero-Shot Prediction\nTo provide a qualitative summary / overview of CLIP's zeroshot performance we visualize a randomly selected prediction for 36 different zero-shot CLIP classifiers in Figure 21. In addition, Table 11 and Figure 22 show the individual zero-shot performance scores for each dataset.\n\nC. Duplicate Detector\nOur early attempts at duplicate detection and analysis used nearest neighbors in the model's learned embedding space. While it is intuitive to use a model's own notion of similarity, we encountered issues. We found the model's feature space is weighted very heavily towards semantic similarity. Many false positives occurred due to distinct objects that would be described similarly (soccer balls, flowers of the same species, etc...) having almost perfect similarity. We also observed the model was quite poor at assigning certain kinds of near-duplicates high similarity scores. We noticed repeatedly that images with high-frequency textures (such as fur or stripe patterns) pre-processed by different resizing algorithms (nearest neighbor vs bi-linear) could have surprisingly low similarity. This resulted in many false negatives.\nWe built our own near-duplicate detector to fix this issue. We created a synthetic data augmentation pipeline that combined a variety of common image manipulations. The augmentation pipeline combines random cropping and zooming, aspect ratio distortion, downsizing and upscaling to different resolutions, minor rotations, jpeg compression, and HSV color jitter. The pipeline also randomly selects from different interpolation algorithms for all relevant steps. We then trained a model to maximize the similarity of an image and its transformed variant while minimizing similarity to all other images in a training batch. We used the same n-pair / InfoNCE loss as CLIP but with a fixed temperature of 0.07.\nWe selected a ResNet-50 as the model architecture. We modified the base ResNet-50 with the anti-alias improvements from (Zhang, 2019) and used weight norm (Salimans & Kingma, 2016) instead of batch norm (Ioffe & Szegedy, 2015) to avoid leaking information about duplicates via batch statistics -a problem previously noted in (Henaff, 2020). We also found the GELU activation function (Hendrycks & Gimpel, 2016) to perform better for this task. We trained the model with a total batch size of 1,712 for approximately 30 million images sampled from our pretraining dataset. At the end of training it achieves nearly 100% accuracy on its proxy training task.\n\nD. Dataset Ablation on YFCC100M\nTo study whether our custom dataset is critical to the performance of CLIP, we trained a model on a filtered subset of the YFCC100M dataset (details described in Section 2.2) and compared its performance to the same model trained on an equally sized subset of WIT. We train each model for 32 epochs at which point transfer performance begins to plateau due to overfitting. Results are shown in Table 12. Across our whole eval suite, YFCC and WIT perform similarly on average for both zero-shot and linear probe settings. However, performance on specific fine-grained classification datasets can vary widely -sometimes by over 10%.\nOur speculation is that these differences in performance reflect the relative density of relevant data in each pre-training dataset. For instance, pre-training on YFCC100M, which might contain many photos of birds and flowers (common subjects for photographers), results in better performance on Birdsnap and Flowers102, while pre-training on WIT results in better car and pet classifiers (which appear common in our dataset).\nOverall, these results are encouraging as they suggest our approach can use any reasonably filtered collection of paired (text, image) data. This mirrors recent work which reported positive results using the same contrastive pre-training objective on the relatively different domain of medical imaging (Zhang et al., 2020). It also is similar to the findings of noisy student self-training which reported only slight improvements when using their JFT300M dataset over YFCC100M (Xie et al., 2020). We suspect the major advantage of our dataset over the already existing YFCC100M is its much larger size.\nFinally, we caution that WIT includes this filtered subset of YFCC100M. This could result in our ablation underestimating the size of performance differences between YFCC100M and the rest of WIT. We do not think this is likely as YFCC100M is only 3.7% of the overall WIT data blend and it did not noticeably change the performance of models when it was added to the existing data blend during the creation of WIT.\n\nE. Selected Task and Dataset Results\nDue to the large variety of datasets and experiments considered in this work, the main body focuses on summarizing and analyzing overall results. In the following subsections we report details of performance for specific groups of tasks, datasets, and evaluation settings.\n\nE.1. Image and Text Retrieval\nCLIP pre-trains for the task of image-text retrieval on our noisy web-scale dataset. Although the focus of this paper is on representation learning and task learning for the purpose of transfer to a wide variety of downstream datasets, validating that CLIP is able to achieve high transfer performance transfer on exactly what it is pre-trained for is an important sanity check / proof of concept. In Table 13 we check the zero-shot transfer performance of CLIP for both text and image retrieval on the Flickr30k and MSCOCO datsets. Zero-shot CLIP matches or outperforms all prior zero-shot results on these two datasets. Zero-shot CLIP is also competitive with the current overall SOTA for the task of text retrieval on Flickr30k. On image retrieval, CLIP's performance relative to the overall state of the art is noticeably lower. However, zero-shot CLIP is still competitive with a fine-tuned Unicoder-VL. On the larger MS-COCO dataset fine-tuning improves performance significantly and zero-shot CLIP is not competitive with the most recent work.\nFor both these datasets we prepend the prompt \"a photo of\" to the description of each image which we found boosts CLIP's zero-shot R@1 performance between 1 and 2 points.\n\nE.2. Optical Character Recognition\nAlthough visualizations have shown that ImageNet models contain features that respond to the presence of text in an image (Zeiler & Fergus, 2014), these representations are not sufficiently fine-grained to use for the task of optical character recognition (OCR). To compensate, models are augmented with the outputs of custom OCR engines and features to boost performance on tasks where this capability is required (Singh et al., 2019; Yang et al., 2020). Early during the development of CLIP, we noticed that CLIP began to learn primitive OCR capabilities which appeared to steadily improve over the course of the project. To evaluate this qualitatively noticed behavior, we measured performance on 5 datasets requiring the direct and indirect use of OCR. Three of these datasets MNIST (LeCun), SVHN (Netzer et al., 2011), and IIIT5K (Mishra et al., 2012) directly check the ability of a model to perform low-level character and word recognition, while Hateful Memes (Kiela et al., 2020) and SST-2 (Socher et al., 2013) SST-2 is a sentence level NLP dataset which we render into images. We include SST-2 in order to check whether CLIP is able to convert low level OCR capability into a higher level representation. Fitting a linear classifier on CLIP's representation of rendered sentences achives 80.5% accuracy. This is on par with the 80% accuracy of a continuous bag of words baseline using GloVe word vectors pre-trained on 840 billion tokens (Pennington et al., 2014). While this is a simple NLP baseline by today's standard, and well below the 97.5% of the current SOTA, it is encouraging to see that CLIP is able to turn an image of rendered text into a non-trivial sentence level representation. Fully supervised CLIP is also surprisingly strong on Hateful Meme detection, where CLIP is only 0.7 points behind the current single model SOTA and several points above the best baseline from the original paper. Similar to SST-2, these other results on Hateful Memes use the ground truth text which CLIP does not have access to. Finally, we note that zero-shot CLIP outperforms the best results using fully supervised linear probes across all other 56 models included in our evaluation suite. This suggests CLIP's OCR capability is at least somewhat unique compared to existing work on self-supervised and supervised representation learning.\nText Retrieval Image Retrieval Flickr30k MSCOCO Flickr30k MSCOCO R@1 R@5 R@10 R@1 R@5 R@10 R@1 R@5 R@10 R@1 R@5 R@10\n\nE.3. Action Recognition in Videos\nFor the purpose of learning, a potentially important aspect of natural language is its ability to express, and therefore supervise, an extremely wide set of concepts. A CLIP model, since it is trained to pair semi-arbitrary text with images, is likely to receive supervision for a wide range of visual concepts involving both common and proper nouns, verbs, and adjectives. ImageNet-1K, by contrast, only labels common nouns. Does the lack of broader supervision in ImageNet result in weaker transfer of ImageNet models to tasks involving the recognition of visual concepts that are not nouns?\nTo investigate this, we measure and compare the performance of CLIP and ImageNet models on several video et al., 2020) action classification datasets which measure the ability of a model to recognize verbs. In Table 15 we report results on UCF-101 (Soomro et al., 2012) and Kinetics-700 (Carreira et al., 2019) Touvron et al., 2019) Despite this handicap, CLIP features transfer surprisingly well to this task. CLIP matches the best prior result on UCF-101 in a linear probe evaluation setting and also outperforms all other models in our evaluation suite. On Kinetics-700, CLIP also outperforms the fine-tuned I3D baseline from the original paper. Since it does not require a training stage, we report CLIP's zero-shot performance when averaging predictions across all frames. CLIP also performs well in this setting and on Kinetics-700 its performance is within 1% of the fully supervised I3D baseline which is trained on 545000 labeled videos. Encouraged by these results, we also measure CLIP's performance on the recently introduced RareAct dataset (Miech et al., 2020a) which was designed to measure zero-shot recognition of unusual actions like \"hammering a phone\" and \"drilling an egg\". CLIP improves over the prior state of the art, a S3D model trained on automatically extracted captions from 100 million instructional videos, by 10 points.\nWhile CLIP has encouragingly strong performance on the task of action recognition, we note that there are many differences between the models being compared beyond just their\n\nE.4. Geolocalization\nAnother behavior we noticed during the development of CLIP was its ability to recognize many places and locations.\nTo quantify this we created the Country211 dataset as described in Appendix A and report results on it throughout the paper. However it is a new benchmark so to compare with prior work on geolocalization we also report results on the IM2GPS test set from Hays & Efros (2008) in Table 17. Since IM2GPS is a regression benchmark, we guess the GPS coordinates of the nearest image in a set of reference images using CLIP's embedding space. This is not a zeroshot result since it uses nearest-neighbor regression. Despite querying only 1 million images, which is much less than prior work, CLIP performs similarly to several task specific models. It is not, however, competitive with the current state of the art.\n\nE.5. Robustness to Distribution Shift\nSection 3.3 provides a high level summary and analysis of ImageNet-related robustness results. We briefly provide some additional numerical details in this appendix. Performance results per dataset are provided in\n\nFootnotes:\n1: The base query list is all words occurring at least 100 times in the English version of Wikipedia. This is augmented with bi-grams\n2: Alec learned much more about flower species and German traffic signs over the course of this project than he originally anticipated.\n3: We refer readers toHendrycks et al. (2020a)  for additional experiments and discussion on this claim.\n4: We caution that a zero-shot model can still exploit spurious correlations that are shared between the pre-training and evaluation distributions.\n8: Note: The CelebA dataset is more representative of faces with lighter skin tones. Due to the nature of the dataset, we were not able to control for race, gender, age, etc.\nWe updated the STL10 scores from the previous version of this paper after fixing a CUDA-related bug.\n\nReferences:\n\n- Abadi, M., Barham, P., Chen, J., Chen, Z., Davis, A., Dean, J., Devin, M., Ghemawat, S., Irving, G., Isard, M., et al. Tensorflow: A system for large-scale machine learning. In 12th {USENIX} symposium on operating systems design and implementation ({OSDI} 16), pp. 265-283, 2016.- Alayrac, J.-B., Recasens, A., Schneider, R., Arandjelović, R., Ramapuram, J., De Fauw, J., Smaira, L., Dieleman, S., and Zisserman, A. Self-supervised multimodal versatile networks. arXiv preprint arXiv:2006.16228, 2020.\n\n- Alcorn, M. A., Li, Q., Gong, Z., Wang, C., Mai, L., Ku, W.- S., and Nguyen, A. Strike (with) a pose: Neural networks are easily fooled by strange poses of familiar objects. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, pp. 4845-4854, 2019.\n\n- Andreas, J., Klein, D., and Levine, S. Learning with latent language. arXiv preprint arXiv:1711.00482, 2017.\n\n- Assiri, Y. Stochastic optimization of plain convolutional neural networks with simple methods. arXiv preprint arXiv:2001.08856, 2020.\n\n- Bachman, P., Hjelm, R. D., and Buchwalter, W. Learning representations by maximizing mutual information across views. In Advances in Neural Information Processing Systems, pp. 15535-15545, 2019.\n\n- Barbu, A., Mayo, D., Alverio, J., Luo, W., Wang, C., Gut- freund, D., Tenenbaum, J., and Katz, B. Objectnet: A large-scale bias-controlled dataset for pushing the lim- its of object recognition models. In Advances in Neural Information Processing Systems, pp. 9453-9463, 2019.\n\n- Barnard, K., Duygulu, P., Forsyth, D., Freitas, N. d., Blei, D. M., and Jordan, M. I. Matching words and pictures. Journal of machine learning research, 3(Feb):1107-1135, 2003. Bechmann, A. and Bowker, G. C. Unsupervised by any other name: Hidden layers of knowledge production in artificial intelligence on social media. Big Data & Society, 6(1):205395171881956, January 2019. doi: 10.1177/ 2053951718819569. URL https://doi.org/10. 1177/2053951718819569.\n\n- Bengio, Y., Ducharme, R., Vincent, P., and Jauvin, C. A neural probabilistic language model. Journal of machine learning research, 3(Feb):1137-1155, 2003.\n\n- Bhargava, S. and Forsyth, D. Exposing and correcting the gender bias in image captioning datasets and models. arXiv preprint arXiv:1912.00578, 2019.\n\n- Blei, D. M., Ng, A. Y., and Jordan, M. I. Latent dirichlet allocation. Journal of machine Learning research, 3(Jan): 993-1022, 2003.\n\n- Bolukbasi, T., Chang, K.-W., Zou, J. Y., Saligrama, V., and Kalai, A. T. Man is to computer programmer as woman is to homemaker? debiasing word embeddings. Advances in neural information processing systems, 29:4349-4357, 2016. Bowker, G. C. and Star, S. L. Sorting things out: Classifica- tion and its consequences. MIT press, 2000.\n\n- Brown, T. B., Mann, B., Ryder, N., Subbiah, M., Kaplan, J., Dhariwal, P., Neelakantan, A., Shyam, P., Sastry, G., Askell, A., et al. Language models are few-shot learners. arXiv preprint arXiv:2005.14165, 2020.\n\n- Browne, S. Dark Matters: Surveillance of Blackness. Duke University Press, 2015.\n\n- Bulent Sariyildiz, M., Perez, J., and Larlus, D. Learning visual representations with caption annotations. arXiv e-prints, pp. arXiv-2008, 2020.\n\n- Buolamwini, J. and Gebru, T. Gender shades: Intersec- tional accuracy disparities in commercial gender classi- fication. In Conference on fairness, accountability and transparency, pp. 77-91, 2018.\n\n- Carreira, J., Noland, E., Hillier, C., and Zisserman, A. A short note on the kinetics-700 human action dataset. arXiv preprint arXiv:1907.06987, 2019.\n\n- Chen, M., Radford, A., Child, R., Wu, J., Jun, H., Luan, D., and Sutskever, I. Generative pretraining from pixels. In International Conference on Machine Learning, pp. 1691-1703. PMLR, 2020a.\n\n- Chen, T., Xu, B., Zhang, C., and Guestrin, C. Training deep nets with sublinear memory cost. arXiv preprint arXiv:1604.06174, 2016.\n\n- Chen, T., Kornblith, S., Norouzi, M., and Hinton, G. A simple framework for contrastive learning of visual rep- resentations. arXiv preprint arXiv:2002.05709, 2020b.\n\n- Chen, T., Kornblith, S., Swersky, K., Norouzi, M., and Hinton, G. Big self-supervised models are strong semi- supervised learners. arXiv preprint arXiv:2006.10029, 2020c. Chen, X. and Gupta, A. Webly supervised learning of convolutional networks. In Proceedings of the IEEE International Conference on Computer Vision, pp. 1431- 1439, 2015. Chen, X., Fan, H., Girshick, R., and He, K. Improved baselines with momentum contrastive learning. arXiv preprint arXiv:2003.04297, 2020d.\n\n- Chen, Y.-C., Li, L., Yu, L., Kholy, A. E., Ahmed, F., Gan, Z., Cheng, Y., and Liu, J. Uniter: Learning universal image- text representations. arXiv preprint arXiv:1909.11740, 2019.\n\n- Cheng, G., Han, J., and Lu, X. Remote sensing image scene classification: Benchmark and state of the art. Proceed- ings of the IEEE, 105(10):1865-1883, 2017.\n\n- Choi, D., Shallue, C. J., Nado, Z., Lee, J., Maddison, C. J., and Dahl, G. E. On empirical comparisons of optimiz- ers for deep learning. arXiv preprint arXiv:1910.05446, 2019.\n\n- Coates, A., Ng, A., and Lee, H. An analysis of single- layer networks in unsupervised feature learning. In Pro- ceedings of the fourteenth international conference on artificial intelligence and statistics, pp. 215-223, 2011.\n\n- Crawford, K. The trouble with bias. NIPS 2017 Keynote, 2017. URL https://www.youtube.com/ watch?v=fMym_BKWQzk.\n\n- Dai, A. M. and Le, Q. V. Semi-supervised sequence learning. In Advances in neural information processing systems, pp. 3079-3087, 2015.\n\n- D'Amour, A., Heller, K., Moldovan, D., Adlam, B., Ali- panahi, B., Beutel, A., Chen, C., Deaton, J., Eisenstein, J., Hoffman, M. D., et al. Underspecification presents challenges for credibility in modern machine learning. arXiv preprint arXiv:2011.03395, 2020.\n\n- Deng, J., Dong, W., Socher, R., Li, L.-J., Li, K., and Fei- Fei, L. ImageNet: A Large-Scale Hierarchical Image Database. In CVPR09, 2009.\n\n- Deng, J., Berg, A. C., Satheesh, S., Su, H., Khosla, A., and Fei-Fei, L. Ilsvrc 2012, 2012. URL http://www. image-net.org/challenges/LSVRC/2012/.\n\n- Desai, K. and Johnson, J. Virtex: Learning visual rep- resentations from textual annotations. arXiv preprint arXiv:2006.06666, 2020.\n\n- Devlin, J., Chang, M.-W., Lee, K., and Toutanova, K. Bert: Pre-training of deep bidirectional transformers for lan- guage understanding. arXiv preprint arXiv:1810.04805, 2018. Dhariwal, P., Jun, H., Payne, C., Kim, J. W., Radford, A., and Sutskever, I. Jukebox: A generative model for music. arXiv preprint arXiv:2005.00341, 2020.\n\n- Divvala, S. K., Farhadi, A., and Guestrin, C. Learning everything about anything: Webly-supervised visual con- cept learning. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, pp. 3270- 3277, 2014.\n\n- Dodge, S. and Karam, L. A study and comparison of human and deep learning recognition performance under visual distortions. In 2017 26th international conference on computer communication and networks (ICCCN), pp. 1- 7. IEEE, 2017.\n\n- Dosovitskiy, A., Beyer, L., Kolesnikov, A., Weissenborn, D., Zhai, X., Unterthiner, T., Dehghani, M., Minderer, M., Heigold, G., Gelly, S., et al. An image is worth 16x16 words: Transformers for image recognition at scale. arXiv preprint arXiv:2010.11929, 2020.\n\n- Elhoseiny, M., Saleh, B., and Elgammal, A. Write a classi- fier: Zero-shot learning using purely textual descriptions. In Proceedings of the IEEE International Conference on Computer Vision, pp. 2584-2591, 2013.\n\n- Faghri, F., Fleet, D. J., Kiros, J. R., and Fidler, S. Vse++: Im- proving visual-semantic embeddings with hard negatives. arXiv preprint arXiv:1707.05612, 2017.\n\n- Fergus, R., Fei-Fei, L., Perona, P., and Zisserman, A. Learn- ing object categories from google's image search. In Tenth IEEE International Conference on Computer Vision (ICCV'05) Volume 1, volume 2, pp. 1816-1823. IEEE, 2005. Frome, A., Corrado, G. S., Shlens, J., Bengio, S., Dean, J., Ranzato, M., and Mikolov, T. Devise: A deep visual- semantic embedding model. In Advances in neural infor- mation processing systems, pp. 2121-2129, 2013.\n\n- Gan, Z., Chen, Y.-C., Li, L., Zhu, C., Cheng, Y., and Liu, J. Large-scale adversarial training for vision-and-language representation learning. arXiv preprint arXiv:2006.06195, 2020.\n\n- Gao, T., Fisch, A., and Chen, D. Making pre-trained lan- guage models better few-shot learners. arXiv preprint arXiv:2012.15723, 2020.\n\n- Garvie, C., May 2019. URL https://www. flawedfacedata.com/.\n\n- Geiger, A., Lenz, P., and Urtasun, R. Are we ready for autonomous driving? the kitti vision benchmark suite. In Conference on Computer Vision and Pattern Recognition (CVPR), 2012.\n\n- Geirhos, R., Rubisch, P., Michaelis, C., Bethge, M., Wich- mann, F. A., and Brendel, W. Imagenet-trained cnns are biased towards texture; increasing shape bias improves ac- curacy and robustness. arXiv preprint arXiv:1811.12231, 2018. Geirhos, R., Jacobsen, J.-H., Michaelis, C., Zemel, R., Brendel, W., Bethge, M., and Wichmann, F. A. Short- cut learning in deep neural networks. arXiv preprint arXiv:2004.07780, 2020.\n\n- Gomez, L., Patel, Y., Rusiñol, M., Karatzas, D., and Jawahar, C. Self-supervised learning of visual features through embedding images into text topic spaces. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, pp. 4230-4239, 2017.\n\n- Goodfellow, I. J., Shlens, J., and Szegedy, C. Explain- ing and harnessing adversarial examples. arXiv preprint arXiv:1412.6572, 2014.\n\n- Goodfellow, I. J., Erhan, D., Carrier, P. L., Courville, A., Mirza, M., Hamner, B., Cukierski, W., Tang, Y., Thaler, D., Lee, D.-H., et al. Challenges in representation learn- ing: A report on three machine learning contests. Neural Networks, 64:59-63, 2015.\n\n- Google. Google cloud api: Celebrity recognition. URL https://cloud.google.com/vision/docs/ celebrity-recognition.\n\n- Griewank, A. and Walther, A. Algorithm 799: revolve: an implementation of checkpointing for the reverse or ad- joint mode of computational differentiation. ACM Trans- actions on Mathematical Software (TOMS), 26(1):19-45, 2000.\n\n- Grill, J.-B., Strub, F., Altché, F., Tallec, C., Richemond, P. H., Buchatskaya, E., Doersch, C., Pires, B. A., Guo, Z. D., Azar, M. G., et al. Bootstrap your own latent: A new approach to self-supervised learning. arXiv preprint arXiv:2006.07733, 2020.\n\n- Ha, D., Dai, A., and Le, Q. V. Hypernetworks. arXiv preprint arXiv:1609.09106, 2016.\n\n- Hancock, B., Bringmann, M., Varma, P., Liang, P., Wang, S., and Ré, C. Training classifiers with natural language explanations. In Proceedings of the conference. Associ- ation for Computational Linguistics. Meeting, volume 2018, pp. 1884. NIH Public Access, 2018.\n\n- Hancock, B., Bordes, A., Mazare, P.-E., and Weston, J. Learning from dialogue after deployment: Feed yourself, chatbot! arXiv preprint arXiv:1901.05415, 2019.\n\n- Harris, C. R., Millman, K. J., van der Walt, S. J., Gommers, R., Virtanen, P., Cournapeau, D., Wieser, E., Taylor, J., Berg, S., Smith, N. J., Kern, R., Picus, M., Hoyer, S., van Kerkwijk, M. H., Brett, M., Haldane, A., Fernández del\n\n- Río, J., Wiebe, M., Peterson, P., Gérard-Marchant, P., Sheppard, K., Reddy, T., Weckesser, W., Abbasi, H., Gohlke, C., and Oliphant, T. E. Array programming with NumPy. Nature, 585:357-362, 2020. doi: 10.1038/ s41586-020-2649-2.\n\n- Hays, J. and Efros, A. A. Im2gps: estimating geographic information from a single image. In 2008 ieee confer- ence on computer vision and pattern recognition, pp. 1-8.\n\n- IEEE, 2008. He, K., Zhang, X., Ren, S., and Sun, J. Delving deep into rectifiers: Surpassing human-level performance on imagenet classification. In Proceedings of the IEEE inter- national conference on computer vision, pp. 1026-1034, 2015. He, K., Zhang, X., Ren, S., and Sun, J. Deep residual learn- ing for image recognition. In Proceedings of the IEEE conference on computer vision and pattern recognition, pp. 770-778, 2016a.\n\n- He, K., Zhang, X., Ren, S., and Sun, J. Deep residual learn- ing for image recognition. In Proceedings of the IEEE conference on computer vision and pattern recognition, pp. 770-778, 2016b.\n\n- He, K., Fan, H., Wu, Y., Xie, S., and Girshick, R. Mo- mentum contrast for unsupervised visual representation learning. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pp. 9729- 9738, 2020.\n\n- He, T., Zhang, Z., Zhang, H., Zhang, Z., Xie, J., and Li, M. Bag of tricks for image classification with convolutional neural networks. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition, pp. 558- 567, 2019.\n\n- He, X. and Peng, Y. Fine-grained image classification via combining vision and language. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recog- nition, pp. 5994-6002, 2017.\n\n- Helber, P., Bischke, B., Dengel, A., and Borth, D. Eurosat: A novel dataset and deep learning benchmark for land use and land cover classification. IEEE Journal of Se- lected Topics in Applied Earth Observations and Remote Sensing, 12(7):2217-2226, 2019.\n\n- Henaff, O. Data-efficient image recognition with contrastive predictive coding. In International Conference on Ma- chine Learning, pp. 4182-4192. PMLR, 2020.\n\n- Hendrycks, D. and Dietterich, T. Benchmarking neural network robustness to common corruptions and perturba- tions. arXiv preprint arXiv:1903.12261, 2019.\n\n- Hendrycks, D. and Gimpel, K. Gaussian error linear units (gelus). arXiv preprint arXiv:1606.08415, 2016.\n\n- Hendrycks, D., Zhao, K., Basart, S., Steinhardt, J., and Song, D. Natural adversarial examples. arXiv preprint arXiv:1907.07174, 2019.\n\n- Hendrycks, D., Basart, S., Mu, N., Kadavath, S., Wang, F., Dorundo, E., Desai, R., Zhu, T., Parajuli, S., Guo, M., et al. The many faces of robustness: A critical analy- sis of out-of-distribution generalization. arXiv preprint arXiv:2006.16241, 2020a.\n\n- Hendrycks, D., Liu, X., Wallace, E., Dziedzic, A., Krishnan, R., and Song, D. Pretrained transformers improve out-of- distribution robustness. arXiv preprint arXiv:2004.06100, 2020b. Hestness, J., Narang, S., Ardalani, N., Diamos, G., Jun, H., Kianinejad, H., Patwary, M., Ali, M., Yang, Y., and Zhou, Y. Deep learning scaling is predictable, empirically. arXiv preprint arXiv:1712.00409, 2017.\n\n- Hill, F., Lampinen, A., Schneider, R., Clark, S., Botvinick, M., McClelland, J. L., and Santoro, A. Environmental drivers of systematicity and generalization in a situated agent. In International Conference on Learning Repre- sentations, 2019.\n\n- Hodosh, M., Young, P., and Hockenmaier, J. Framing image description as a ranking task: Data, models and evaluation metrics. Journal of Artificial Intelligence Research, 47: 853-899, 2013.\n\n- Hongsuck Seo, P., Weyand, T., Sim, J., and Han, B. Cplanet: Enhancing image geolocalization by combinatorial parti- tioning of maps. In Proceedings of the European Confer- ence on Computer Vision (ECCV), pp. 536-551, 2018.\n\n- Howard, J. and Ruder, S. Universal language model fine-tuning for text classification. arXiv preprint arXiv:1801.06146, 2018.\n\n- Ilyas, A., Santurkar, S., Tsipras, D., Engstrom, L., Tran, B., and Madry, A. Adversarial examples are not bugs, they are features. In Advances in Neural Information Processing Systems, pp. 125-136, 2019.\n\n- Ioffe, S. and Szegedy, C. Batch normalization: Accelerating deep network training by reducing internal covariate shift. arXiv preprint arXiv:1502.03167, 2015.\n\n- Jaderberg, M., Simonyan, K., Vedaldi, A., and Zisserman, A. Deep structured output learning for unconstrained text recognition. arXiv preprint arXiv:1412.5903, 2014.\n\n- Jaderberg, M., Simonyan, K., Zisserman, A., et al. Spatial transformer networks. Advances in neural information processing systems, 28:2017-2025, 2015.\n\n- Johnson, J., Hariharan, B., van der Maaten, L., Fei-Fei, L., Lawrence Zitnick, C., and Girshick, R. Clevr: A diag- nostic dataset for compositional language and elementary visual reasoning. In Proceedings of the IEEE Confer- ence on Computer Vision and Pattern Recognition, pp. 2901-2910, 2017.\n\n- Joulin, A., Van Der Maaten, L., Jabri, A., and Vasilache, N. Learning visual features from large weakly supervised data. In European Conference on Computer Vision, pp. 67-84. Springer, 2016.\n\n- Kalfaoglu, M., Kalkan, S., and Alatan, A. A. Late temporal modeling in 3d cnn architectures with bert for action recognition. arXiv preprint arXiv:2008.01232, 2020.\n\n- Kaplan, J., McCandlish, S., Henighan, T., Brown, T. B., Chess, B., Child, R., Gray, S., Radford, A., Wu, J., and Amodei, D. Scaling laws for neural language models. arXiv preprint arXiv:2001.08361, 2020.\n\n- Karpathy, A., Joulin, A., and Fei-Fei, L. F. Deep fragment embeddings for bidirectional image sentence mapping. In Advances in neural information processing systems, pp. 1889-1897, 2014.\n\n- Keyes, O. The misgendering machines: Trans/hci implica- tions of automatic gender recognition. Proceedings of the ACM on Human-Computer Interaction, 2(CSCW):1-22, 2018. Kiela, D., Firooz, H., Mohan, A., Goswami, V., Singh, A., Ringshia, P., and Testuggine, D. The hateful memes challenge: Detecting hate speech in multimodal memes. arXiv preprint arXiv:2005.04790, 2020.\n\n- Kingma, D. P. and Ba, J. Adam: A method for stochastic optimization. arXiv preprint arXiv:1412.6980, 2014.\n\n- Kiros, R., Salakhutdinov, R., and Zemel, R. S. Unifying visual-semantic embeddings with multimodal neural lan- guage models. arXiv preprint arXiv:1411.2539, 2014.\n\n- Kiros, R., Zhu, Y., Salakhutdinov, R. R., Zemel, R., Urtasun, R., Torralba, A., and Fidler, S. Skip-thought vectors. Advances in neural information processing systems, 28: 3294-3302, 2015.\n\n- Kolesnikov, A., Beyer, L., Zhai, X., Puigcerver, J., Yung, J., Gelly, S., and Houlsby, N. Large scale learning of general visual representations for transfer. arXiv preprint arXiv:1912.11370, 2019.\n\n- Kornblith, S., Shlens, J., and Le, Q. V. Do better imagenet models transfer better? In Proceedings of the IEEE conference on computer vision and pattern recognition, pp. 2661-2671, 2019.\n\n- Krishna, R., Zhu, Y., Groth, O., Johnson, J., Hata, K., Kravitz, J., Chen, S., Kalantidis, Y., Li, L.-J., Shamma, D. A., et al. Visual genome: Connecting language and vision using crowdsourced dense image annotations. In- ternational journal of computer vision, 123(1):32-73, 2017.\n\n- Krizhevsky, A., Sutskever, I., and Hinton, G. E. Imagenet classification with deep convolutional neural networks. In Advances in neural information processing systems, pp. 1097-1105, 2012.\n\n- Kuhnle, A. and Copestake, A. Shapeworld-a new test methodology for multimodal language understanding. arXiv preprint arXiv:1704.04517, 2017.\n\n- Kärkkäinen, K. and Joo, J. Fairface: Face attribute dataset for balanced race, gender, and age, 2019.\n\n- Lake, B. M., Ullman, T. D., Tenenbaum, J. B., and Gersh- man, S. J. Building machines that learn and think like people, 2016.\n\n- Lampert, C. H., Nickisch, H., and Harmeling, S. Learning to detect unseen object classes by between-class attribute transfer. In 2009 IEEE Conference on Computer Vision and Pattern Recognition, pp. 951-958. IEEE, 2009.\n\n- Larochelle, H., Erhan, D., and Bengio, Y. Zero-data learning of new tasks. 2008.\n\n- Le, Q. and Mikolov, T. Distributed representations of sen- tences and documents. In International conference on machine learning, pp. 1188-1196, 2014.\n\n- LeCun, Y. The mnist database of handwritten digits. http://yann. lecun. com/exdb/mnist/.\n\n- Lee, D.-H. Pseudo-label: The simple and efficient semi- supervised learning method for deep neural networks.\n\n- Lei Ba, J., Swersky, K., Fidler, S., et al. Predicting deep zero-shot convolutional neural networks using textual descriptions. In Proceedings of the IEEE International Conference on Computer Vision, pp. 4247-4255, 2015.\n\n- Li, A., Jabri, A., Joulin, A., and van der Maaten, L. Learning visual n-grams from web data. In Proceedings of the IEEE International Conference on Computer Vision, pp. 4183-4192, 2017.\n\n- Li, G., Duan, N., Fang, Y., Gong, M., and Jiang, D. Unicoder-vl: A universal encoder for vision and language by cross-modal pre-training. 2020a.\n\n- Li, J., Miller, A. H., Chopra, S., Ranzato, M., and Weston, J. Learning through dialogue interactions by asking ques- tions. arXiv preprint arXiv:1612.04936, 2016.\n\n- Li, X., Yin, X., Li, C., Hu, X., Zhang, P., Zhang, L., Wang, L., Hu, H., Dong, L., Wei, F., et al. Oscar: Object- semantics aligned pre-training for vision-language tasks. arXiv preprint arXiv:2004.06165, 2020b.\n\n- Liang, W., Zou, J., and Yu, Z. Alice: Active learning with contrastive natural language explanations. arXiv preprint arXiv:2009.10259, 2020.\n\n- Lin, T.-Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ra- manan, D., Dollár, P., and Zitnick, C. L. Microsoft coco: Common objects in context. In European conference on computer vision, pp. 740-755. Springer, 2014.\n\n- Linzen, T. How can we accelerate progress towards human-like linguistic generalization? arXiv preprint arXiv:2005.00955, 2020.\n\n- Lippe, P., Holla, N., Chandra, S., Rajamanickam, S., An- toniou, G., Shutova, E., and Yannakoudakis, H. A mul- timodal framework for the detection hateful memes. arXiv preprint arXiv:2012.12871, 2020.\n\n- Liu, P. J., Saleh, M., Pot, E., Goodrich, B., Sepa- ssi, R., Kaiser, L., and Shazeer, N. Generating wikipedia by summarizing long sequences. arXiv preprint arXiv:1801.10198, 2018.\n\n- Locatello, F., Bauer, S., Lucic, M., Rätsch, G., Gelly, S., Schölkopf, B., and Bachem, O. A sober look at the unsupervised learning of disentangled representations and their evaluation. arXiv preprint arXiv:2010.14766, 2020.\n\n- Loshchilov, I. and Hutter, F. Sgdr: Stochastic gra- dient descent with warm restarts. arXiv preprint arXiv:1608.03983, 2016.\n\n- Loshchilov, I. and Hutter, F. Decoupled weight decay regu- larization. arXiv preprint arXiv:1711.05101, 2017.\n\n- Lu, J., Batra, D., Parikh, D., and Lee, S. Vilbert: Pretraining task-agnostic visiolinguistic representations for vision- and-language tasks. In Advances in Neural Information Processing Systems, pp. 13-23, 2019.\n\n- Lu, Z., Xiong, X., Li, Y., Stroud, J., and Ross, D. Leveraging weakly supervised data and pose representation for action recognition, 2020. URL https://www.youtube. com/watch?v=KOQFxbPPLOE&t=1390s.\n\n- Lucic, M., Kurach, K., Michalski, M., Gelly, S., and Bous- quet, O. Are gans created equal? a large-scale study. Advances in neural information processing systems, 31: 700-709, 2018.\n\n- Mahajan, D., Girshick, R., Ramanathan, V., He, K., Paluri, M., Li, Y., Bharambe, A., and van der Maaten, L. Ex- ploring the limits of weakly supervised pretraining. In Proceedings of the European Conference on Computer Vision (ECCV), pp. 181-196, 2018.\n\n- McCann, B., Bradbury, J., Xiong, C., and Socher, R. Learned in translation: Contextualized word vectors. In Advances in neural information processing systems, pp. 6294-6305, 2017.\n\n- McCann, B., Keskar, N. S., Xiong, C., and Socher, R. The natural language decathlon: Multitask learning as ques- tion answering. arXiv preprint arXiv:1806.08730, 2018.\n\n- Micikevicius, P., Narang, S., Alben, J., Diamos, G., Elsen, E., Garcia, D., Ginsburg, B., Houston, M., Kuchaiev, O., Venkatesh, G., et al. Mixed precision training. arXiv preprint arXiv:1710.03740, 2017.\n\n- Miech, A., Zhukov, D., Alayrac, J.-B., Tapaswi, M., Laptev, I., and Sivic, J. Howto100m: Learning a text-video em- bedding by watching hundred million narrated video clips. In Proceedings of the IEEE international conference on computer vision, pp. 2630-2640, 2019.\n\n- Miech, A., Alayrac, J.-B., Laptev, I., Sivic, J., and Zisser- man, A. Rareact: A video dataset of unusual interactions. arXiv preprint arXiv:2008.01018, 2020a.\n\n- Miech, A., Alayrac, J.-B., Smaira, L., Laptev, I., Sivic, J., and Zisserman, A. End-to-end learning of visual represen- tations from uncurated instructional videos. In Proceed- ings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pp. 9879-9889, 2020b.\n\n- Mikolov, T., Sutskever, I., Chen, K., Corrado, G. S., and Dean, J. Distributed representations of words and phrases and their compositionality. Advances in neural informa- tion processing systems, 26:3111-3119, 2013.\n\n- Miller, J., Krauth, K., Recht, B., and Schmidt, L. The effect of natural distribution shift on question answering models. arXiv preprint arXiv:2004.14444, 2020.\n\n- Mishra, A., Alahari, K., and Jawahar, C. Scene text recogni- tion using higher order language priors. 2012.\n\n- Mithun, N. C., Panda, R., Papalexakis, E. E., and Roy- Chowdhury, A. K. Webly supervised joint embedding for cross-modal image-text retrieval. In Proceedings of the 26th ACM international conference on Multimedia, pp. 1856-1864, 2018.\n\n- Mori, Y., Takahashi, H., and Oka, R. Image-to-word trans- formation based on dividing and vector quantizing images with words. Citeseer, 1999.\n\n- Mu, J., Liang, P., and Goodman, N. Shaping visual represen- tations with language for few-shot classification. arXiv preprint arXiv:1911.02683, 2019.\n\n- Muller-Budack, E., Pustu-Iren, K., and Ewerth, R. Geolo- cation estimation of photos using a hierarchical model and scene classification. In Proceedings of the European Conference on Computer Vision (ECCV), pp. 563-579, 2018. Murty, S., Koh, P. W., and Liang, P. Expbert: Representation engineering with natural language explanations. arXiv preprint arXiv:2005.01932, 2020.\n\n- Narasimhan, K., Kulkarni, T., and Barzilay, R. Language understanding for text-based games using deep reinforce- ment learning. arXiv preprint arXiv:1506.08941, 2015.\n\n- Netzer, Y., Wang, T., Coates, A., Bissacco, A., Wu, B., and Ng, A. Y. Reading digits in natural images with unsupervised feature learning. 2011.\n\n- Noble, S. U. Algorithms of oppression: How search engines reinforce racism. 2018.\n\n- Nosek, B. A., Banaji, M. R., and Greenwald, A. G. Harvest- ing implicit group attitudes and beliefs from a demonstra- tion web site. Group Dynamics: Theory, Research, and Practice, 6(1):101, 2002.\n\n- Oh, S., Hoogs, A., Perera, A., Cuntoor, N., Chen, C.-C., Lee, J. T., Mukherjee, S., Aggarwal, J., Lee, H., Davis, L., et al. A large-scale benchmark dataset for event recognition in surveillance video. In CVPR 2011, pp. 3153-3160. IEEE, 2011.\n\n- Oliver, A., Odena, A., Raffel, C. A., Cubuk, E. D., and Good- fellow, I. Realistic evaluation of deep semi-supervised learning algorithms. Advances in neural information pro- cessing systems, 31:3235-3246, 2018.\n\n- Oord, A. v. d., Li, Y., and Vinyals, O. Representation learn- ing with contrastive predictive coding. arXiv preprint arXiv:1807.03748, 2018.\n\n- Ordonez, V., Kulkarni, G., and Berg, T. Im2text: Describing images using 1 million captioned photographs. Advances in neural information processing systems, 24:1143-1151, 2011. pandas development team, T. pandas-dev/pandas: Pan- das, February 2020. URL https://doi.org/10. 5281/zenodo.3509134.\n\n- Parkhi, O. M., Vedaldi, A., Zisserman, A., and Jawahar, C. V. Cats and dogs. In IEEE Conference on Computer Vision and Pattern Recognition, 2012.\n\n- Paszke, A., Gross, S., Massa, F., Lerer, A., Bradbury, J., Chanan, G., Killeen, T., Lin, Z., Gimelshein, N., Antiga, L., Desmaison, A., Kopf, A., Yang, E., DeVito, Z., Raison, M., Tejani, A., Chilamkurthy, S., Steiner, B., Fang, L., Bai, J., and Chintala, S. Pytorch: An imperative style, high-performance deep learning library. In Advances in Neural Information Processing Systems 32, pp. 8024- 8035, 2019.\n\n- Pedregosa, F., Varoquaux, G., Gramfort, A., Michel, V., Thirion, B., Grisel, O., Blondel, M., Prettenhofer, P., Weiss, R., Dubourg, V., Vanderplas, J., Passos, A., Cour- napeau, D., Brucher, M., Perrot, M., and Duchesnay, E. Scikit-learn: Machine learning in Python. Journal of Machine Learning Research, 12:2825-2830, 2011.\n\n- Pennington, J., Socher, R., and Manning, C. D. Glove: Global vectors for word representation. In Proceedings of the 2014 conference on empirical methods in natural language processing (EMNLP), pp. 1532-1543, 2014.\n\n- Peters, M. E., Neumann, M., Iyyer, M., Gardner, M., Clark, C., Lee, K., and Zettlemoyer, L. Deep contextualized word representations. arXiv preprint arXiv:1802.05365, 2018. Qi, D., Su, L., Song, J., Cui, E., Bharti, T., and Sacheti, A. Imagebert: Cross-modal pre-training with large- scale weak-supervised image-text data. arXiv preprint arXiv:2001.07966, 2020.\n\n- Quattoni, A., Collins, M., and Darrell, T. Learning visual representations using images with captions. In 2007 IEEE Conference on Computer Vision and Pattern Recognition, pp. 1-8. IEEE, 2007.\n\n- Radford, A., Narasimhan, K., Salimans, T., and Sutskever, I. Improving language understanding by generative pre- training, 2018.\n\n- Radford, A., Wu, J., Child, R., Luan, D., Amodei, D., and Sutskever, I. Language models are unsupervised multitask learners. 2019.\n\n- Raffel, C., Shazeer, N., Roberts, A., Lee, K., Narang, S., Matena, M., Zhou, Y., Li, W., and Liu, P. J. Exploring the limits of transfer learning with a unified text-to-text transformer. arXiv preprint arXiv:1910.10683, 2019.\n\n- Raji, I. D., Gebru, T., Mitchell, M., Buolamwini, J., Lee, J., and Denton, E. Saving face: Investigating the ethical concerns of facial recognition auditing, 2020.\n\n- Ramanathan, V., Liang, P., and Fei-Fei, L. Video event understanding using natural language descriptions. In Proceedings of the IEEE International Conference on Computer Vision, pp. 905-912, 2013.\n\n- Rashtchian, C., Young, P., Hodosh, M., and Hockenmaier, J. Collecting image annotations using amazon's mechanical turk. In Proceedings of the NAACL HLT 2010 Workshop on Creating Speech and Language Data with Amazon's Mechanical Turk, pp. 139-147, 2010.\n\n- Recht, B., Roelofs, R., Schmidt, L., and Shankar, V. Do im- agenet classifiers generalize to imagenet? arXiv preprint arXiv:1902.10811, 2019.\n\n- Salimans, T. and Kingma, D. P. Weight normalization: A simple reparameterization to accelerate training of deep neural networks. In Advances in neural information pro- cessing systems, pp. 901-909, 2016.\n\n- Scheuerman, M. K., Paul, J. M., and Brubaker, J. R. How computers see gender: An evaluation of gender classifica- tion in commercial facial analysis services. Proceedings of the ACM on Human-Computer Interaction, 3(CSCW): 1-33, 2019.\n\n- Schwemmer, C., Knight, C., Bello-Pardo, E. D., Oklobdzija, S., Schoonvelde, M., and Lockhart, J. W. Diagnosing gender bias in image recognition systems. Socius, 6: 2378023120967171, 2020.\n\n- Sennrich, R., Haddow, B., and Birch, A. Neural machine translation of rare words with subword units. arXiv preprint arXiv:1508.07909, 2015.\n\n- Shankar, V., Dave, A., Roelofs, R., Ramanan, D., Recht, B., and Schmidt, L. Do image classifiers generalize across time? arXiv preprint arXiv:1906.02168, 2019.\n\n- Sharma, P., Ding, N., Goodman, S., and Soricut, R. Con- ceptual captions: A cleaned, hypernymed, image alt-text dataset for automatic image captioning. In Proceedings of the 56th Annual Meeting of the Association for Compu- tational Linguistics (Volume 1: Long Papers), pp. 2556- 2565, 2018.\n\n- Singh, A., Natarajan, V., Shah, M., Jiang, Y., Chen, X., Batra, D., Parikh, D., and Rohrbach, M. Towards vqa models that can read. In Proceedings of the IEEE Con- ference on Computer Vision and Pattern Recognition, pp. 8317-8326, 2019.\n\n- Socher, R. and Fei-Fei, L. Connecting modalities: Semi- supervised segmentation and annotation of images using unaligned text corpora. In 2010 IEEE Computer Society Conference on Computer Vision and Pattern Recognition, pp. 966-973. IEEE, 2010.\n\n- Socher, R., Perelygin, A., Wu, J., Chuang, J., Manning, C. D., Ng, A. Y., and Potts, C. Recursive deep models for semantic compositionality over a sentiment treebank. In Proceedings of the 2013 conference on empirical methods in natural language processing, pp. 1631-1642, 2013.\n\n- Socher, R., Karpathy, A., Le, Q. V., Manning, C. D., and Ng, A. Y. Grounded compositional semantics for finding and describing images with sentences. Transactions of the Association for Computational Linguistics, 2:207-218, 2014. Sohn, K. Improved deep metric learning with multi-class n-pair loss objective. In Advances in neural information processing systems, pp. 1857-1865, 2016.\n\n- Solaiman, I., Brundage, M., Clark, J., Askell, A., Herbert- Voss, A., Wu, J., Radford, A., Krueger, G., Kim, J. W., Kreps, S., McCain, M., Newhouse, A., Blazakis, J., McGuffie, K., and Wang, J. Release strategies and the social impacts of language models, 2019.\n\n- Soomro, K., Zamir, A. R., and Shah, M. Ucf101: A dataset of 101 human actions classes from videos in the wild. arXiv preprint arXiv:1212.0402, 2012.\n\n- Speer, R. ftfy. Zenodo, 2019. URL https://doi.org/ 10.5281/zenodo.2591652. Version 5.5.\n\n- Srivastava, N. and Salakhutdinov, R. Multimodal learning with deep boltzmann machines. In NIPS, 2012.\n\n- Srivastava, S., Labutov, I., and Mitchell, T. Joint concept learning and semantic parsing from natural language ex- planations. In Proceedings of the 2017 conference on empirical methods in natural language processing, pp. 1527-1536, 2017.\n\n- Stallkamp, J., Schlipsing, M., Salmen, J., and Igel, C. The German Traffic Sign Recognition Benchmark: A multi- class classification competition. In IEEE International Joint Conference on Neural Networks, pp. 1453-1460, 2011.\n\n- Stroud, J. C., Ross, D. A., Sun, C., Deng, J., Sukthankar, R., and Schmid, C. Learning video representations from tex- tual web supervision. arXiv preprint arXiv:2007.14937, 2020.\n\n- Szegedy, C., Ioffe, S., Vanhoucke, V., and Alemi, A. Inception-v4, inception-resnet and the impact of residual connections on learning. arXiv preprint arXiv:1602.07261, 2016.\n\n- Tan, H. and Bansal, M. Lxmert: Learning cross-modality encoder representations from transformers. arXiv preprint arXiv:1908.07490, 2019.\n\n- Tan, M. and Le, Q. V. Efficientnet: Rethinking model scaling for convolutional neural networks. arXiv preprint arXiv:1905.11946, 2019.\n\n- Taori, R., Dave, A., Shankar, V., Carlini, N., Recht, B., and Schmidt, L. Measuring robustness to natural dis- tribution shifts in image classification. arXiv preprint arXiv:2007.00644, 2020.\n\n- Thomee, B., Shamma, D. A., Friedland, G., Elizalde, B., Ni, K., Poland, D., Borth, D., and Li, L.-J. Yfcc100m: The new data in multimedia research. Communications of the ACM, 59(2):64-73, 2016.\n\n- Tian, Y., Krishnan, D., and Isola, P. Contrastive multiview coding. arXiv preprint arXiv:1906.05849, 2019.\n\n- Tian, Y., Wang, Y., Krishnan, D., Tenenbaum, J. B., and Isola, P. Rethinking few-shot image classification: a good embedding is all you need? arXiv preprint arXiv:2003.11539, 2020.\n\n- Torralba, A., Fergus, R., and Freeman, W. T. 80 million tiny images: A large data set for nonparametric object and scene recognition. IEEE transactions on pattern analysis and machine intelligence, 30(11):1958-1970, 2008.\n\n- Touvron, H., Vedaldi, A., Douze, M., and Jégou, H. Fix- ing the train-test resolution discrepancy. In Advances in neural information processing systems, pp. 8252-8262, 2019.\n\n- Varadarajan, J. and Odobez, J.-M. Topic models for scene analysis and abnormality detection. In 2009 IEEE 12th International Conference on Computer Vision Workshops, ICCV Workshops, pp. 1338-1345. IEEE, 2009.\n\n- Vaswani, A., Shazeer, N., Parmar, N., Uszkoreit, J., Jones, L., Gomez, A. N., Kaiser, Ł., and Polosukhin, I. Atten- tion is all you need. In Advances in neural information processing systems, pp. 5998-6008, 2017.\n\n- Veeling, B. S., Linmans, J., Winkens, J., Cohen, T., and Welling, M. Rotation equivariant CNNs for digital pathol- ogy. June 2018.\n\n- Virtanen, P., Gommers, R., Oliphant, T. E., Haberland, M., Reddy, T., Cournapeau, D., Burovski, E., Peterson, P., Weckesser, W., Bright, J., van der Walt, S. J., Brett, M., Wilson, J., Millman, K. J., Mayorov, N., Nelson, A. R. J., Jones, E., Kern, R., Larson, E., Carey, C. J., Polat, İ., Feng, Y., Moore, E. W., VanderPlas, J., Laxalde, D., Perktold, J., Cimrman, R., Henriksen, I., Quintero, E. A., Harris, C. R., Archibald, A. M., Ribeiro, A. H., Pedregosa, F., van Mulbregt, P., and SciPy 1.0 Contributors. SciPy 1.0: Fundamental Algorithms for Scientific Computing in Python. Nature Methods, 17:261-272, 2020. doi: 10.1038/s41592-019-0686-2.\n\n- Vo, N., Jacobs, N., and Hays, J. Revisiting im2gps in the deep learning era. In Proceedings of the IEEE Interna- tional Conference on Computer Vision, pp. 2621-2630, 2017.\n\n- Wang, A., Singh, A., Michael, J., Hill, F., Levy, O., and Bowman, S. R. Glue: A multi-task benchmark and anal- ysis platform for natural language understanding. arXiv preprint arXiv:1804.07461, 2018.\n\n- Wang, H., Ge, S., Lipton, Z., and Xing, E. P. Learning ro- bust global representations by penalizing local predictive power. In Advances in Neural Information Processing Systems, pp. 10506-10518, 2019.\n\n- Wang, H., Lu, P., Zhang, H., Yang, M., Bai, X., Xu, Y., He, M., Wang, Y., and Liu, W. All you need is boundary: To- ward arbitrary-shaped text spotting. In Proceedings of the AAAI Conference on Artificial Intelligence, volume 34, pp. 12160-12167, 2020.\n\n- Wang, J., Markert, K., and Everingham, M. Learning mod- els for object recognition from natural language descrip- tions. In BMVC, volume 1, pp. 2, 2009.\n\n- Weston, J., Bengio, S., and Usunier, N. Large scale im- age annotation: learning to rank with joint word-image embeddings. Machine learning, 81(1):21-35, 2010.\n\n- Weston, J. E. Dialog-based language learning. In Advances in Neural Information Processing Systems, pp. 829-837, 2016. Weyand, T., Kostrikov, I., and Philbin, J. Planet-photo geolo- cation with convolutional neural networks. In European Conference on Computer Vision, pp. 37-55. Springer, 2016. Wu, Y., Kirillov, A., Massa, F., Lo, W.-Y., and Gir- shick, R. Detectron2. https://github.com/ facebookresearch/detectron2, 2019.\n\n- Wu, Z., Xiong, Y., Yu, S., and Lin, D. Unsupervised feature learning via non-parametric instance-level discrimination. arXiv preprint arXiv:1805.01978, 2018.\n\n- Xie, Q., Luong, M.-T., Hovy, E., and Le, Q. V. Self-training with noisy student improves imagenet classification. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pp. 10687-10698, 2020.\n\n- y Arcas, B. A., Mitchell, M., and Todorov, A. Physiognomy's new clothes. 2017. URL https://medium.com/@blaisea/ physiognomys-new-clothes-f2d4b59fdd6a.\n\n- Yang, Z., Lu, Y., Wang, J., Yin, X., Florencio, D., Wang, L., Zhang, C., Zhang, L., and Luo, J. Tap: Text-aware pre-training for text-vqa and text-caption. arXiv preprint arXiv:2012.04638, 2020.\n\n- Yogatama, D., d'Autume, C. d. M., Connor, J., Kocisky, T., Chrzanowski, M., Kong, L., Lazaridou, A., Ling, W., Yu, L., Dyer, C., et al. Learning and evaluating general linguistic intelligence. arXiv preprint arXiv:1901.11373, 2019.\n\n- Young, P., Lai, A., Hodosh, M., and Hockenmaier, J. From image descriptions to visual denotations: New similarity metrics for semantic inference over event descriptions. Transactions of the Association for Computational Lin- guistics, 2:67-78, 2014.\n\n- Yu, F., Tang, J., Yin, W., Sun, Y., Tian, H., Wu, H., and Wang, H. Ernie-vil: Knowledge enhanced vision- language representations through scene graph. arXiv preprint arXiv:2006.16934, 2020.\n\n- Zeiler, M. D. and Fergus, R. Visualizing and understand- ing convolutional networks. In European conference on computer vision, pp. 818-833. Springer, 2014.\n\n- Zhai, X., Puigcerver, J., Kolesnikov, A., Ruyssen, P., Riquelme, C., Lucic, M., Djolonga, J., Pinto, A. S., Neu- mann, M., Dosovitskiy, A., et al. A large-scale study of representation learning with the visual task adaptation benchmark. arXiv preprint arXiv:1910.04867, 2019.\n\n- Zhang, R. Making convolutional networks shift-invariant again. arXiv preprint arXiv:1904.11486, 2019.\n\n- Zhang, Y., Jiang, H., Miura, Y., Manning, C. D., and Lan- glotz, C. P. Contrastive learning of medical visual repre- sentations from paired images and text. arXiv preprint arXiv:2010.00747, 2020.\n\n- Zuboff, S. Big other: surveillance capitalism and the prospects of an information civilization. Journal of Infor- mation Technology, 30(1):75-89, 2015. B0 78.1 94.0 78.6 63.5 65.5 57.2 53.7 85.6 75.6 93.8 93.1 94.5 98.1 55.6 98.2 97.0 84.3 74.0 71.6 14.0 83.1 76.7 51.7 47.3 55.7 55.0 78.5 B1 80.4 95.1 80.2 66.6 67.6 59.6 53.7 86.2 77.0 94.6 94.4 95.1 98.0 56.1 98.6 96.9 84.3 73.1 67.1 14.5 83.9 79.9 54.5 46.1 54.3 54.9 81.1 B2 80.9 95.3 81.3 67.6 67.9 60.9 55.2 86.3 77.7 95.0 94.7 94.4 98.0 55.5 98.8 97.3 84.6 71.7 70.0 14.6 82.9 80.1 55.1 46.1 54.1 55.3 82.2 B3 82.6 95.9 82.1 68.6 68.8 60.6 55.4 86.5 77.2 95.0 94.8 95.2 98.1 56.0 99.1 96.5 85.0 70.5 69.5 15.1 83.1 81.8 56.8 45.1 55.7 52.0 83.8 B4 85.2 95.6 81.0 72.5 69.7 56.1 52.6 87.0 78.7 94.8 95.2 95.3 98.2 56.0 99.3 95.3 84.8 61.9 64.8 16.0 82.8 83.4 59.8 43.2 55.3 53.0 85.4 B5 87.6 96.3 82.4 75.3 71.6 64.7 64.8 87.8 79.6 95.5 95.6 96.6 98.8 60.9 99.4 96.1 87.0 68.5 73.7 16.4 83.5 86.4 61.6 46.3 53.4 55.8 85.8 B6 87.3 97.0 83.9 75.8 71.4 67.6 65.6 87.3 78.5 95.2 96.4 97.2 98.6 61.9 99.5 96.6 86.1 70.7 72.4 17.6 84.2 85.5 61.0 49.6 54.6 55.7 86.4 B7 88.4 96.0 82.0 76.9 72.6 72.2 71.2 88.1 80.5 95.5 95.5 96.6 98.5 62.7 99.4 96.2 88.5 73.4 73.0 18.5 83.8 86.6 63.2 50.5 57.2 56.7 87.0\n\n- Instagram 32x8d 84.8 95.9 80.9 63.8 69.0 74.2 56.0 88.0 75.4 95.4 93.9 91.7 97.4 60.7 99.1 95.7 82.1 72.3 69.2 16.7 82.3 80.1 56.8 42.2 53.3 55.2 83.3 32x16d 85.7 96.5 80.9 64.8 70.5 77.5 56.7 87.9 76.2 95.6 94.9 92.5 97.4 61.6 99.3 95.5 82.8 73.8 66.1 17.5 83.4 81.1 58.2 41.3 54.2 56.1 84.4 32x32d 86.7 96.8 82.7 67.1 71.5 77.5 55.4 88.3 78.5 95.8 95.3 94.4 97.9 62.4 99.3 95.7 85.4 71.2 66.8 18.0 83.7 82.1 58.8 39.7 55.3 56.7 85.0 32x48d 86.9 96.8 83.4 65.9 72.2 76.6 53.2 88.0 77.2 95.5 95.8 93.6 98.1 63.7 99.4 95.3 85.4 73.0 67.2 18.5 82.7 82.8 59.2 41.3 55.5 56.7 85.2\n\n- FixRes-v1 88.5 95.7 81.1 67.4 72.9 80.5 57.6 88.0 77.9 95.8 96.1 94.5 97.9 62.2 99.4 96.2 86.6 76.5 64.8 19.3 82.5 83.4 59.8 43.5 56.6 59.0 86.0\n\n- FixRes-v2 88.5 95.7 81.1 67.3 72.9 80.7 57.5 88.0 77.9 95.0 96.0 94.5 98.0 62.1 99.4 96.5 86.6 76.3 64.8 19.5 82.3 83.5 59.8 44.2 56.6 59.0 86.0\n\n- BiT-S R50x1 72.5 91.7 74.8 57.7 61.1 53.5 52.5 83.7 72.4 92.3 91.2 92.0 98.4 56.1 96.4 97.4 85.0 70.0 66.0 12.5 83.0 72.3 47.5 48.3 54.1 55.3 75.2\n\n- BiT-M R50x1 83.3 94.9 82.2 70.9 69.9 59.0 55.6 86.8 77.3 91.5 93.9 99.4 98.0 60.6 98.4 97.5 87.4 68.6 68.2 16.6 82.5 79.4 53.2 49.4 54.5 53.4 76.7\n\n- ViT B/32 81.8 96.7 86.3 65.2 70.7 49.1 42.7 85.3 73.1 90.4 94.5 98.7 97.8 59.0 99.0 96.3 83.0 68.1 65.1 15.7 82.6 79.1 51.7 38.9 57.1 54.6 76.6\n\n- B/16 86.7 96.9 86.4 74.0 74.2 54.7 46.0 86.7 74.3 92.7 94.1 99.2 97.4 61.3 99.5 96.4 84.5 63.1 61.5 17.5 85.4 82.7 56.6 40.0 57.0 56.1 80.9\n\n- L/16 87.4 97.9 89.0 76.5 74.9 62.5 52.2 86.1 75.0 92.9 94.7 99.3 98.0 64.0 99.6 96.5 85.7 70.4 58.8 17.7 85.7 84.1 58.0 38.4 58.4 52.8 81.9\n\n- H/14 83.4 95.8 84.5 70.2 69.2 62.3 54.8 84.7 75.4 91.7 93.7 98.9 98.5 62.4 98.4 97.3 87.0 73.9 63.4 15.4 87.0 79.4 52.1 41.1 55.9 54.1 75.9\n\n- SimCLRv2 R50x1 76.4 93.2 77.9 48.6 64.1 56.3 51.7 84.4 77.0 88.3 91.8 92.9 97.6 59.7 96.7 97.5 85.8 71.1 69.1 15.8 84.8 78.4 51.0 56.2 53.9 53.8 73.8\n\n- BYOL 50x1 74.0 93.6 79.1 47.6 63.7 61.6 62.3 82.6 77.0 88.3 93.7 94.3 98.7 58.8 96.4 97.6 88.2 80.1 71.4 14.1 84.8 77.3 49.3 56.1 53.8 54.4 73.3 200x2 78.5 96.2 83.3 53.4 68.5 61.7 55.4 86.6 77.4 91.9 95.5 93.9 98.7 62.6 98.6 97.7 87.4 77.1 76.4 16.4 84.0 82.6 55.1 54.1 52.5 52.4 79.2\n\n- MoCo v1 65.9 85.0 63.1 27.5 52.6 35.9 43.5 75.7 70.0 70.4 78.1 85.4 97.6 54.3 85.6 97.1 82.9 62.6 60.2 12.6 85.7 64.2 40.7 54.7 55.6 53.5 57.2 v2 72.2 93.4 76.3 39.6 60.2 48.3 51.1 82.6 75.1 84.4 89.9 90.7 98.4 58.3 95.7 97.2 85.4 75.7 75.4 13.2 85.6 72.7 47.8 56.9 53.9 53.8 69.1\n\n- VirTex 57.9 83.9 57.5 17.0 49.8 22.4 34.5 83.8 58.2 53.6 70.6 74.7 98.1 56.5 86.7 94.8 74.1 69.5 71.3 8.7 83.1 61.5 39.9 45.5 53.5 55.8 50.7\n\n- ResNet 50 71.3 91.8 74.5 52.7 60.5 49.9 48.5 83.8 72.3 92.4 90.8 90.8 98.3 54.9 96.4 96.7 83.6 70.6 67.1 11.7 82.5 71.2 46.8 43.0 56.5 55.5 74.3 101 72.7 93.0 77.2 53.7 60.8 50.1 47.0 84.4 71.6 92.3 91.9 90.4 98.5 56.6 97.0 97.1 83.4 72.5 63.6 11.9 83.3 72.7 48.3 43.2 53.0 54.7 75.8 152 73.7 93.5 78.0 55.1 61.6 52.8 48.4 84.5 71.9 93.0 92.1 89.6 98.2 57.0 97.6 97.0 83.1 70.1 70.2 12.3 82.9 75.3 49.2 42.4 53.2 53.9 77.1\n\n- Table 10. Linear probe performance of various pre-trained models over 27 datasets. Scores within the 99.5% Clopper-Pearson confidence interval of each dataset's top score are shown in bold.\n\n", "annotations": {"Abstract": [{"begin": 71, "end": 1549, "idx": 0}], "Head": [{"begin": 1552, "end": 1587, "n": "1.", "idx": 0}, {"begin": 9092, "end": 9103, "n": "2.", "idx": 1}, {"begin": 9106, "end": 9139, "n": "2.1.", "idx": 2}, {"begin": 11131, "end": 11173, "n": "2.2.", "idx": 3}, {"begin": 12962, "end": 13009, "n": "2.3.", "idx": 4}, {"begin": 17879, "end": 17912, "n": "2.4.", "idx": 5}, {"begin": 20750, "end": 20763, "n": "2.5.", "idx": 6}, {"begin": 22919, "end": 22933, "n": "3.", "idx": 7}, {"begin": 22959, "end": 22976, "n": "3.1.1.", "idx": 8}, {"begin": 28101, "end": 28144, "n": "3.1.3.", "idx": 9}, {"begin": 29818, "end": 29858, "n": "3.1.4.", "idx": 10}, {"begin": 34164, "end": 34209, "n": "3.1.5.", "idx": 11}, {"begin": 43691, "end": 43719, "n": "3.2.", "idx": 12}, {"begin": 51505, "end": 51550, "n": "3.3.", "idx": 13}, {"begin": 62336, "end": 62370, "n": "4.", "idx": 14}, {"begin": 66167, "end": 66191, "n": "5.", "idx": 15}, {"begin": 71031, "end": 71045, "n": "6.", "idx": 16}, {"begin": 77888, "end": 77906, "n": "7.", "idx": 17}, {"begin": 80820, "end": 80825, "idx": 18}, {"begin": 80832, "end": 80841, "n": "7.1.", "idx": 19}, {"begin": 92384, "end": 92401, "n": "7.2.", "idx": 20}, {"begin": 98018, "end": 98034, "n": "7.3.", "idx": 21}, {"begin": 99523, "end": 99538, "n": "8.", "idx": 22}, {"begin": 107561, "end": 107574, "n": "9.", "idx": 23}, {"begin": 108286, "end": 108312, "idx": 24}, {"begin": 108465, "end": 108478, "idx": 25}, {"begin": 110559, "end": 110570, "idx": 26}, {"begin": 111525, "end": 111533, "idx": 27}, {"begin": 113533, "end": 113548, "idx": 28}, {"begin": 114935, "end": 114947, "idx": 29}, {"begin": 115546, "end": 115553, "idx": 30}, {"begin": 115563, "end": 115586, "idx": 31}, {"begin": 115868, "end": 115889, "idx": 32}, {"begin": 118088, "end": 118119, "idx": 33}, {"begin": 120196, "end": 120232, "idx": 34}, {"begin": 120507, "end": 120536, "idx": 35}, {"begin": 121760, "end": 121794, "idx": 36}, {"begin": 124261, "end": 124294, "idx": 37}, {"begin": 126416, "end": 126436, "idx": 38}, {"begin": 127263, "end": 127300, "idx": 39}], "ReferenceToBib": [{"begin": 1692, "end": 1708, "target": "#b26", "idx": 0}, {"begin": 1709, "end": 1729, "idx": 1}, {"begin": 1730, "end": 1751, "target": "#b70", "idx": 2}, {"begin": 1752, "end": 1773, "target": "#b140", "idx": 3}, {"begin": 1774, "end": 1794, "idx": 4}, {"begin": 1795, "end": 1815, "target": "#b142", "idx": 5}, {"begin": 2084, "end": 2105, "target": "#b114", "idx": 6}, {"begin": 2106, "end": 2127, "target": "#b141", "idx": 7}, {"begin": 2128, "end": 2148, "target": "#b142", "idx": 8}, {"begin": 2343, "end": 2362, "target": "#b12", "idx": 9}, {"begin": 2816, "end": 2835, "target": "#b28", "idx": 10}, {"begin": 3006, "end": 3024, "target": "#b123", "idx": 11}, {"begin": 3169, "end": 3191, "target": "#b139", "idx": 12}, {"begin": 3391, "end": 3424, "target": "#b160", "idx": 13}, {"begin": 3560, "end": 3580, "target": "#b76", "idx": 14}, {"begin": 3810, "end": 3831, "target": "#b168", "idx": 15}, {"begin": 3919, "end": 3944, "target": "#b87", "idx": 16}, {"begin": 4070, "end": 4086, "target": "#b97", "idx": 17}, {"begin": 4477, "end": 4500, "target": "#b30", "idx": 18}, {"begin": 4508, "end": 4540, "target": "#b14", "idx": 19}, {"begin": 4555, "end": 4575, "target": "#b194", "idx": 20}, {"begin": 5090, "end": 5106, "target": "#b97", "idx": 21}, {"begin": 5239, "end": 5257, "target": "#b185", "idx": 22}, {"begin": 5331, "end": 5350, "target": "#b29", "idx": 23}, {"begin": 5453, "end": 5474, "target": "#b112", "idx": 24}, {"begin": 5718, "end": 5742, "target": "#b84", "idx": 25}, {"begin": 5747, "end": 5772, "target": "#b34", "idx": 26}, {"begin": 6769, "end": 6790, "target": "#b112", "idx": 27}, {"begin": 6795, "end": 6819, "target": "#b84", "idx": 28}, {"begin": 7686, "end": 7709, "target": "#b66", "idx": 29}, {"begin": 7710, "end": 7730, "target": "#b78", "idx": 30}, {"begin": 8350, "end": 8371, "target": "#b76", "idx": 31}, {"begin": 9450, "end": 9469, "target": "#b194", "idx": 32}, {"begin": 9471, "end": 9490, "target": "#b43", "idx": 33}, {"begin": 9492, "end": 9512, "target": "#b76", "idx": 34}, {"begin": 9518, "end": 9540, "target": "#b30", "idx": 35}, {"begin": 10253, "end": 10274, "target": "#b113", "idx": 36}, {"begin": 11228, "end": 11246, "target": "#b102", "idx": 37}, {"begin": 11262, "end": 11284, "target": "#b86", "idx": 38}, {"begin": 11299, "end": 11320, "target": "#b168", "idx": 39}, {"begin": 11574, "end": 11596, "target": "#b112", "idx": 40}, {"begin": 13087, "end": 13108, "target": "#b112", "idx": 41}, {"begin": 13168, "end": 13185, "target": "#b185", "idx": 42}, {"begin": 14542, "end": 14561, "target": "#b169", "idx": 43}, {"begin": 14775, "end": 14795, "target": "#b17", "idx": 44}, {"begin": 16238, "end": 16256, "target": "#b132", "idx": 45}, {"begin": 16393, "end": 16412, "target": "#b194", "idx": 46}, {"begin": 16583, "end": 16602, "target": "#b194", "idx": 47}, {"begin": 16917, "end": 16936, "idx": 48}, {"begin": 17339, "end": 17358, "target": "#b194", "idx": 49}, {"begin": 18008, "end": 18026, "target": "#b55", "idx": 50}, {"begin": 18220, "end": 18236, "target": "#b58", "idx": 51}, {"begin": 18282, "end": 18294, "target": "#b193", "idx": 52}, {"begin": 18671, "end": 18697, "target": "#b34", "idx": 53}, {"begin": 18970, "end": 18992, "target": "#b174", "idx": 54}, {"begin": 19042, "end": 19063, "target": "#b141", "idx": 55}, {"begin": 19269, "end": 19292, "target": "#b150", "idx": 56}, {"begin": 19964, "end": 19986, "target": "#b112", "idx": 57}, {"begin": 19996, "end": 20014, "target": "#b55", "idx": 58}, {"begin": 20084, "end": 20099, "target": "#b166", "idx": 59}, {"begin": 20263, "end": 20278, "target": "#b166", "idx": 60}, {"begin": 21204, "end": 21223, "target": "#b81", "idx": 61}, {"begin": 21267, "end": 21294, "target": "#b108", "idx": 62}, {"begin": 21400, "end": 21427, "target": "#b107", "idx": 63}, {"begin": 21777, "end": 21794, "target": "#b184", "idx": 64}, {"begin": 21974, "end": 22001, "target": "#b115", "idx": 65}, {"begin": 22101, "end": 22127, "target": "#b47", "idx": 66}, {"begin": 22128, "end": 22146, "target": "#b18", "idx": 67}, {"begin": 22179, "end": 22202, "idx": 68}, {"begin": 22734, "end": 22756, "target": "#b172", "idx": 69}, {"begin": 23112, "end": 23134, "target": "#b91", "idx": 70}, {"begin": 23330, "end": 23354, "target": "#b92", "idx": 71}, {"begin": 24217, "end": 24240, "target": "#b171", "idx": 72}, {"begin": 24499, "end": 24516, "target": "#b97", "idx": 73}, {"begin": 25505, "end": 25522, "target": "#b105", "idx": 74}, {"begin": 25717, "end": 25739, "target": "#b140", "idx": 75}, {"begin": 26072, "end": 26094, "target": "#b141", "idx": 76}, {"begin": 27239, "end": 27256, "target": "#b49", "idx": 77}, {"begin": 27389, "end": 27405, "target": "#b96", "idx": 78}, {"begin": 27552, "end": 27575, "target": "#b35", "idx": 79}, {"begin": 28315, "end": 28332, "target": "#b97", "idx": 80}, {"begin": 30390, "end": 30406, "target": "#b97", "idx": 81}, {"begin": 32218, "end": 32238, "target": "#b12", "idx": 82}, {"begin": 32239, "end": 32256, "target": "#b39", "idx": 83}, {"begin": 34145, "end": 34161, "target": "#b97", "idx": 84}, {"begin": 42814, "end": 42837, "target": "#b66", "idx": 85}, {"begin": 42838, "end": 42858, "target": "#b78", "idx": 86}, {"begin": 44075, "end": 44099, "target": "#b106", "idx": 87}, {"begin": 44492, "end": 44516, "target": "#b85", "idx": 88}, {"begin": 44517, "end": 44535, "target": "#b192", "idx": 89}, {"begin": 45784, "end": 45804, "target": "#b111", "idx": 90}, {"begin": 45805, "end": 45823, "target": "#b23", "idx": 91}, {"begin": 46213, "end": 46236, "target": "#b85", "idx": 92}, {"begin": 47007, "end": 47032, "target": "#b34", "idx": 93}, {"begin": 47763, "end": 47786, "target": "#b85", "idx": 94}, {"begin": 47843, "end": 47866, "target": "#b85", "idx": 95}, {"begin": 48151, "end": 48175, "target": "#b162", "idx": 96}, {"begin": 48229, "end": 48248, "target": "#b192", "idx": 97}, {"begin": 48564, "end": 48580, "target": "#b166", "idx": 98}, {"begin": 48581, "end": 48598, "target": "#b185", "idx": 99}, {"begin": 48605, "end": 48625, "idx": 100}, {"begin": 48663, "end": 48685, "target": "#b112", "idx": 101}, {"begin": 48686, "end": 48707, "target": "#b172", "idx": 102}, {"begin": 48713, "end": 48738, "target": "#b84", "idx": 103}, {"begin": 48744, "end": 48770, "target": "#b34", "idx": 104}, {"begin": 48781, "end": 48801, "idx": 105}, {"begin": 48808, "end": 48828, "target": "#b48", "idx": 106}, {"begin": 48861, "end": 48879, "target": "#b56", "idx": 107}, {"begin": 48936, "end": 48959, "target": "#b85", "idx": 108}, {"begin": 49693, "end": 49716, "target": "#b85", "idx": 109}, {"begin": 50568, "end": 50593, "idx": 110}, {"begin": 51656, "end": 51673, "target": "#b55", "idx": 111}, {"begin": 51788, "end": 51809, "target": "#b33", "idx": 112}, {"begin": 51810, "end": 51831, "idx": 113}, {"begin": 51832, "end": 51852, "target": "#b2", "idx": 114}, {"begin": 51999, "end": 52019, "target": "#b146", "idx": 115}, {"begin": 52020, "end": 52039, "target": "#b6", "idx": 116}, {"begin": 52119, "end": 52139, "target": "#b71", "idx": 117}, {"begin": 52140, "end": 52161, "target": "#b42", "idx": 118}, {"begin": 53071, "end": 53090, "target": "#b167", "idx": 119}, {"begin": 53206, "end": 53225, "target": "#b167", "idx": 120}, {"begin": 53396, "end": 53416, "target": "#b146", "idx": 121}, {"begin": 53434, "end": 53453, "target": "#b179", "idx": 122}, {"begin": 53483, "end": 53505, "target": "#b151", "idx": 123}, {"begin": 53517, "end": 53537, "target": "#b6", "idx": 124}, {"begin": 53560, "end": 53584, "idx": 125}, {"begin": 53609, "end": 53634, "idx": 126}, {"begin": 53794, "end": 53824, "target": "#b62", "idx": 127}, {"begin": 53844, "end": 53866, "idx": 128}, {"begin": 53891, "end": 53916, "target": "#b44", "idx": 129}, {"begin": 54879, "end": 54898, "target": "#b167", "idx": 130}, {"begin": 55061, "end": 55080, "target": "#b167", "idx": 131}, {"begin": 57299, "end": 57320, "target": "#b112", "idx": 132}, {"begin": 59019, "end": 59040, "target": "#b112", "idx": 133}, {"begin": 59042, "end": 59066, "target": "#b84", "idx": 134}, {"begin": 59072, "end": 59097, "target": "#b34", "idx": 135}, {"begin": 59589, "end": 59608, "target": "#b167", "idx": 136}, {"begin": 61752, "end": 61774, "target": "#b188", "idx": 137}, {"begin": 62016, "end": 62040, "idx": 138}, {"begin": 62124, "end": 62144, "target": "#b120", "idx": 139}, {"begin": 62252, "end": 62271, "target": "#b167", "idx": 140}, {"begin": 62972, "end": 62993, "target": "#b134", "idx": 141}, {"begin": 63582, "end": 63603, "target": "#b24", "idx": 142}, {"begin": 64787, "end": 64805, "target": "#b90", "idx": 143}, {"begin": 65162, "end": 65182, "target": "#b134", "idx": 144}, {"begin": 65669, "end": 65688, "target": "#b170", "idx": 145}, {"begin": 70668, "end": 70689, "target": "#b112", "idx": 146}, {"begin": 70694, "end": 70718, "target": "#b84", "idx": 147}, {"begin": 75074, "end": 75095, "target": "#b3", "idx": 148}, {"begin": 75519, "end": 75533, "target": "#b61", "idx": 149}, {"begin": 75534, "end": 75553, "idx": 150}, {"begin": 75572, "end": 75577, "target": "#b95", "idx": 151}, {"begin": 75578, "end": 75595, "target": "#b185", "idx": 152}, {"begin": 76092, "end": 76113, "target": "#b131", "idx": 153}, {"begin": 76214, "end": 76237, "target": "#b85", "idx": 154}, {"begin": 76875, "end": 76901, "target": "#b9", "idx": 155}, {"begin": 78730, "end": 78750, "target": "#b12", "idx": 156}, {"begin": 81089, "end": 81102, "target": "#b128", "idx": 157}, {"begin": 81103, "end": 81127, "target": "#b7", "idx": 158}, {"begin": 81128, "end": 81148, "idx": 159}, {"begin": 81416, "end": 81441, "target": "#b15", "idx": 160}, {"begin": 81446, "end": 81469, "target": "#b89", "idx": 161}, {"begin": 81601, "end": 81623, "target": "#b157", "idx": 162}, {"begin": 82119, "end": 82139, "idx": 163}, {"begin": 82613, "end": 82634, "target": "#b112", "idx": 164}, {"begin": 82869, "end": 82881, "target": "#b80", "idx": 165}, {"begin": 84061, "end": 84079, "target": "#b143", "idx": 166}, {"begin": 84331, "end": 84356, "target": "#b148", "idx": 167}, {"begin": 84940, "end": 84956, "target": "#b25", "idx": 168}, {"begin": 87293, "end": 87312, "target": "#b186", "idx": 169}, {"begin": 87710, "end": 87733, "target": "#b149", "idx": 170}, {"begin": 89702, "end": 89726, "target": "#b149", "idx": 171}, {"begin": 89727, "end": 89747, "target": "#b129", "idx": 172}, {"begin": 89748, "end": 89772, "target": "#b11", "idx": 173}, {"begin": 90260, "end": 90283, "target": "#b149", "idx": 174}, {"begin": 90949, "end": 90973, "target": "#b149", "idx": 175}, {"begin": 91971, "end": 91986, "target": "#b25", "idx": 176}, {"begin": 93485, "end": 93499, "target": "#b195", "idx": 177}, {"begin": 93500, "end": 93513, "target": "#b13", "idx": 178}, {"begin": 93777, "end": 93794, "target": "#b130", "idx": 179}, {"begin": 93816, "end": 93843, "target": "#b173", "idx": 180}, {"begin": 95968, "end": 95982, "target": "#b40", "idx": 181}, {"begin": 96207, "end": 96227, "target": "#b12", "idx": 182}, {"begin": 97540, "end": 97557, "idx": 183}, {"begin": 99846, "end": 99865, "target": "#b10", "idx": 184}, {"begin": 99905, "end": 99927, "target": "#b119", "idx": 185}, {"begin": 99928, "end": 99947, "target": "#b83", "idx": 186}, {"begin": 99948, "end": 99967, "target": "#b93", "idx": 187}, {"begin": 99989, "end": 100010, "target": "#b8", "idx": 188}, {"begin": 100641, "end": 100655, "idx": 189}, {"begin": 100656, "end": 100672, "target": "#b99", "idx": 190}, {"begin": 100673, "end": 100694, "target": "#b51", "idx": 191}, {"begin": 100880, "end": 100905, "target": "#b161", "idx": 192}, {"begin": 100936, "end": 100958, "target": "#b50", "idx": 193}, {"begin": 100975, "end": 101003, "idx": 194}, {"begin": 101439, "end": 101463, "target": "#b144", "idx": 195}, {"begin": 101841, "end": 101860, "target": "#b123", "idx": 196}, {"begin": 101887, "end": 101906, "target": "#b181", "idx": 197}, {"begin": 102028, "end": 102050, "target": "#b7", "idx": 198}, {"begin": 102067, "end": 102083, "target": "#b59", "idx": 199}, {"begin": 102088, "end": 102107, "target": "#b101", "idx": 200}, {"begin": 102365, "end": 102391, "target": "#b88", "idx": 201}, {"begin": 102392, "end": 102413, "target": "#b3", "idx": 202}, {"begin": 102414, "end": 102430, "target": "#b124", "idx": 203}, {"begin": 102524, "end": 102549, "target": "#b126", "idx": 204}, {"begin": 102649, "end": 102668, "target": "#b67", "idx": 205}, {"begin": 102810, "end": 102828, "target": "#b123", "idx": 206}, {"begin": 103096, "end": 103117, "target": "#b182", "idx": 207}, {"begin": 103118, "end": 103141, "target": "#b154", "idx": 208}, {"begin": 103142, "end": 103162, "target": "#b68", "idx": 209}, {"begin": 103300, "end": 103320, "target": "#b37", "idx": 210}, {"begin": 103321, "end": 103341, "target": "#b156", "idx": 211}, {"begin": 103342, "end": 103364, "target": "#b79", "idx": 212}, {"begin": 103365, "end": 103384, "target": "#b82", "idx": 213}, {"begin": 103385, "end": 103405, "target": "#b36", "idx": 214}, {"begin": 103493, "end": 103513, "target": "#b163", "idx": 215}, {"begin": 103723, "end": 103743, "target": "#b116", "idx": 216}, {"begin": 103744, "end": 103750, "target": "#b118", "idx": 217}, {"begin": 103933, "end": 103954, "target": "#b1", "idx": 218}, {"begin": 104356, "end": 104381, "target": "#b145", "idx": 219}, {"begin": 104392, "end": 104413, "target": "#b68", "idx": 220}, {"begin": 104429, "end": 104449, "target": "#b189", "idx": 221}, {"begin": 104616, "end": 104637, "target": "#b133", "idx": 222}, {"begin": 104692, "end": 104712, "target": "#b122", "idx": 223}, {"begin": 104910, "end": 104931, "target": "#b152", "idx": 224}, {"begin": 104933, "end": 104955, "idx": 225}, {"begin": 104968, "end": 104987, "target": "#b187", "idx": 226}, {"begin": 105431, "end": 105452, "target": "#b37", "idx": 227}, {"begin": 105711, "end": 105731, "target": "#b20", "idx": 228}, {"begin": 106322, "end": 106344, "target": "#b32", "idx": 229}, {"begin": 106497, "end": 106514, "target": "#b109", "idx": 230}, {"begin": 106515, "end": 106534, "target": "#b165", "idx": 231}, {"begin": 106535, "end": 106553, "target": "#b21", "idx": 232}, {"begin": 106554, "end": 106571, "idx": 233}, {"begin": 106572, "end": 106588, "target": "#b190", "idx": 234}, {"begin": 108555, "end": 108579, "target": "#b85", "idx": 235}, {"begin": 108780, "end": 108805, "target": "#b45", "idx": 236}, {"begin": 108807, "end": 108835, "idx": 237}, {"begin": 108845, "end": 108866, "target": "#b60", "idx": 238}, {"begin": 108894, "end": 108914, "target": "#b22", "idx": 239}, {"begin": 108978, "end": 109002, "target": "#b162", "idx": 240}, {"begin": 109022, "end": 109043, "target": "#b41", "idx": 241}, {"begin": 109059, "end": 109081, "target": "#b175", "idx": 242}, {"begin": 109121, "end": 109142, "target": "#b158", "idx": 243}, {"begin": 109157, "end": 109180, "target": "#b16", "idx": 244}, {"begin": 109224, "end": 109246, "target": "#b75", "idx": 245}, {"begin": 109274, "end": 109294, "target": "#b80", "idx": 246}, {"begin": 109324, "end": 109343, "target": "#b29", "idx": 247}, {"begin": 109905, "end": 109926, "target": "#b168", "idx": 248}, {"begin": 110379, "end": 110400, "target": "#b155", "idx": 249}, {"begin": 111322, "end": 111338, "target": "#b166", "idx": 250}, {"begin": 111594, "end": 111620, "target": "#b34", "idx": 251}, {"begin": 111893, "end": 111909, "target": "#b166", "idx": 252}, {"begin": 111977, "end": 111993, "target": "#b166", "idx": 253}, {"begin": 112158, "end": 112189, "idx": 254}, {"begin": 112202, "end": 112224, "target": "#b112", "idx": 255}, {"begin": 112298, "end": 112320, "target": "#b172", "idx": 256}, {"begin": 112371, "end": 112396, "target": "#b84", "idx": 257}, {"begin": 112557, "end": 112583, "target": "#b34", "idx": 258}, {"begin": 112813, "end": 112833, "idx": 259}, {"begin": 113029, "end": 113049, "target": "#b48", "idx": 260}, {"begin": 113133, "end": 113150, "target": "#b57", "idx": 261}, {"begin": 113167, "end": 113187, "idx": 262}, {"begin": 113246, "end": 113269, "target": "#b30", "idx": 263}, {"begin": 113467, "end": 113485, "target": "#b56", "idx": 264}, {"begin": 117551, "end": 117564, "target": "#b193", "idx": 265}, {"begin": 117634, "end": 117657, "target": "#b72", "idx": 266}, {"begin": 117756, "end": 117770, "target": "#b61", "idx": 267}, {"begin": 117815, "end": 117841, "target": "#b63", "idx": 268}, {"begin": 119480, "end": 119500, "target": "#b194", "idx": 269}, {"begin": 119655, "end": 119673, "target": "#b185", "idx": 270}, {"begin": 121917, "end": 121940, "target": "#b191", "idx": 271}, {"begin": 122210, "end": 122230, "target": "#b153", "idx": 272}, {"begin": 122231, "end": 122249, "target": "#b187", "idx": 273}, {"begin": 122596, "end": 122622, "target": "#b127", "idx": 274}, {"begin": 122623, "end": 122651, "idx": 275}, {"begin": 122763, "end": 122783, "target": "#b80", "idx": 276}, {"begin": 122794, "end": 122815, "target": "#b155", "idx": 277}, {"begin": 123244, "end": 123269, "target": "#b137", "idx": 278}, {"begin": 124994, "end": 125007, "idx": 279}, {"begin": 125137, "end": 125158, "target": "#b158", "idx": 280}, {"begin": 125176, "end": 125199, "target": "#b16", "idx": 281}, {"begin": 125200, "end": 125221, "target": "#b172", "idx": 282}, {"begin": 125943, "end": 125964, "idx": 283}, {"begin": 126807, "end": 126826, "target": "#b54", "idx": 284}], "ReferenceToFootnote": [{"begin": 12712, "end": 12713, "target": "#foot_0", "idx": 0}, {"begin": 30337, "end": 30338, "target": "#foot_1", "idx": 1}, {"begin": 54231, "end": 54232, "target": "#foot_2", "idx": 2}, {"begin": 56019, "end": 56020, "target": "#foot_3", "idx": 3}, {"begin": 95506, "end": 95507, "target": "#foot_4", "idx": 4}], "SectionFootnote": [{"begin": 127516, "end": 128325, "idx": 0}], "ReferenceString": [{"begin": 128342, "end": 128621, "id": "b0", "idx": 0}, {"begin": 128623, "end": 128843, "id": "b1", "idx": 1}, {"begin": 128847, "end": 129122, "id": "b2", "idx": 2}, {"begin": 129126, "end": 129234, "id": "b3", "idx": 3}, {"begin": 129238, "end": 129371, "id": "b4", "idx": 4}, {"begin": 129375, "end": 129569, "id": "b5", "idx": 5}, {"begin": 129573, "end": 129849, "id": "b6", "idx": 6}, {"begin": 129853, "end": 130309, "id": "b7", "idx": 7}, {"begin": 130313, "end": 130467, "id": "b8", "idx": 8}, {"begin": 130471, "end": 130619, "id": "b9", "idx": 9}, {"begin": 130623, "end": 130755, "id": "b10", "idx": 10}, {"begin": 130759, "end": 131091, "id": "b11", "idx": 11}, {"begin": 131095, "end": 131305, "id": "b12", "idx": 12}, {"begin": 131309, "end": 131389, "id": "b13", "idx": 13}, {"begin": 131393, "end": 131537, "id": "b14", "idx": 14}, {"begin": 131541, "end": 131738, "id": "b15", "idx": 15}, {"begin": 131742, "end": 131892, "id": "b16", "idx": 16}, {"begin": 131896, "end": 132087, "id": "b17", "idx": 17}, {"begin": 132091, "end": 132222, "id": "b18", "idx": 18}, {"begin": 132226, "end": 132391, "id": "b19", "idx": 19}, {"begin": 132395, "end": 132874, "id": "b20", "idx": 20}, {"begin": 132878, "end": 133058, "id": "b21", "idx": 21}, {"begin": 133062, "end": 133219, "id": "b22", "idx": 22}, {"begin": 133223, "end": 133399, "id": "b23", "idx": 23}, {"begin": 133403, "end": 133628, "id": "b24", "idx": 24}, {"begin": 133632, "end": 133742, "id": "b25", "idx": 25}, {"begin": 133746, "end": 133880, "id": "b26", "idx": 26}, {"begin": 133884, "end": 134145, "id": "b27", "idx": 27}, {"begin": 134149, "end": 134286, "id": "b28", "idx": 28}, {"begin": 134290, "end": 134435, "id": "b29", "idx": 29}, {"begin": 134439, "end": 134571, "id": "b30", "idx": 30}, {"begin": 134575, "end": 134905, "id": "b31", "idx": 31}, {"begin": 134909, "end": 135138, "id": "b32", "idx": 32}, {"begin": 135142, "end": 135373, "id": "b33", "idx": 33}, {"begin": 135377, "end": 135638, "id": "b34", "idx": 34}, {"begin": 135642, "end": 135853, "id": "b35", "idx": 35}, {"begin": 135857, "end": 136017, "id": "b36", "idx": 36}, {"begin": 136021, "end": 136463, "id": "b37", "idx": 37}, {"begin": 136467, "end": 136649, "id": "b38", "idx": 38}, {"begin": 136653, "end": 136787, "id": "b39", "idx": 39}, {"begin": 136791, "end": 136850, "id": "b40", "idx": 40}, {"begin": 136854, "end": 137033, "id": "b41", "idx": 41}, {"begin": 137037, "end": 137456, "id": "b42", "idx": 42}, {"begin": 137460, "end": 137720, "id": "b43", "idx": 43}, {"begin": 137724, "end": 137858, "id": "b44", "idx": 44}, {"begin": 137862, "end": 138120, "id": "b45", "idx": 45}, {"begin": 138124, "end": 138237, "id": "b46", "idx": 46}, {"begin": 138241, "end": 138467, "id": "b47", "idx": 47}, {"begin": 138471, "end": 138723, "id": "b48", "idx": 48}, {"begin": 138727, "end": 138811, "id": "b49", "idx": 49}, {"begin": 138815, "end": 139078, "id": "b50", "idx": 50}, {"begin": 139082, "end": 139240, "id": "b51", "idx": 51}, {"begin": 139244, "end": 139477, "id": "b52", "idx": 52}, {"begin": 139481, "end": 139709, "id": "b53", "idx": 53}, {"begin": 139713, "end": 139880, "id": "b54", "idx": 54}, {"begin": 139884, "end": 140313, "id": "b55", "idx": 55}, {"begin": 140317, "end": 140506, "id": "b56", "idx": 56}, {"begin": 140510, "end": 140737, "id": "b57", "idx": 57}, {"begin": 140741, "end": 140978, "id": "b58", "idx": 58}, {"begin": 140982, "end": 141175, "id": "b59", "idx": 59}, {"begin": 141179, "end": 141433, "id": "b60", "idx": 60}, {"begin": 141437, "end": 141594, "id": "b61", "idx": 61}, {"begin": 141598, "end": 141751, "id": "b62", "idx": 62}, {"begin": 141755, "end": 141859, "id": "b63", "idx": 63}, {"begin": 141863, "end": 141997, "id": "b64", "idx": 64}, {"begin": 142001, "end": 142253, "id": "b65", "idx": 65}, {"begin": 142257, "end": 142651, "id": "b66", "idx": 66}, {"begin": 142655, "end": 142898, "id": "b67", "idx": 67}, {"begin": 142902, "end": 143090, "id": "b68", "idx": 68}, {"begin": 143094, "end": 143316, "id": "b69", "idx": 69}, {"begin": 143320, "end": 143445, "id": "b70", "idx": 70}, {"begin": 143449, "end": 143652, "id": "b71", "idx": 71}, {"begin": 143656, "end": 143814, "id": "b72", "idx": 72}, {"begin": 143818, "end": 143983, "id": "b73", "idx": 73}, {"begin": 143987, "end": 144138, "id": "b74", "idx": 74}, {"begin": 144142, "end": 144436, "id": "b75", "idx": 75}, {"begin": 144440, "end": 144630, "id": "b76", "idx": 76}, {"begin": 144634, "end": 144798, "id": "b77", "idx": 77}, {"begin": 144802, "end": 145005, "id": "b78", "idx": 78}, {"begin": 145009, "end": 145195, "id": "b79", "idx": 79}, {"begin": 145199, "end": 145569, "id": "b80", "idx": 80}, {"begin": 145573, "end": 145679, "id": "b81", "idx": 81}, {"begin": 145683, "end": 145845, "id": "b82", "idx": 82}, {"begin": 145849, "end": 146037, "id": "b83", "idx": 83}, {"begin": 146041, "end": 146238, "id": "b84", "idx": 84}, {"begin": 146242, "end": 146428, "id": "b85", "idx": 85}, {"begin": 146432, "end": 146713, "id": "b86", "idx": 86}, {"begin": 146717, "end": 146905, "id": "b87", "idx": 87}, {"begin": 146909, "end": 147049, "id": "b88", "idx": 88}, {"begin": 147053, "end": 147154, "id": "b89", "idx": 89}, {"begin": 147158, "end": 147283, "id": "b90", "idx": 90}, {"begin": 147287, "end": 147505, "id": "b91", "idx": 91}, {"begin": 147509, "end": 147589, "id": "b92", "idx": 92}, {"begin": 147593, "end": 147743, "id": "b93", "idx": 93}, {"begin": 147747, "end": 147835, "id": "b94", "idx": 94}, {"begin": 147839, "end": 147947, "id": "b95", "idx": 95}, {"begin": 147951, "end": 148171, "id": "b96", "idx": 96}, {"begin": 148175, "end": 148360, "id": "b97", "idx": 97}, {"begin": 148364, "end": 148508, "id": "b98", "idx": 98}, {"begin": 148512, "end": 148675, "id": "b99", "idx": 99}, {"begin": 148679, "end": 148890, "id": "b100", "idx": 100}, {"begin": 148894, "end": 149034, "id": "b101", "idx": 101}, {"begin": 149038, "end": 149257, "id": "b102", "idx": 102}, {"begin": 149261, "end": 149387, "id": "b103", "idx": 103}, {"begin": 149391, "end": 149591, "id": "b104", "idx": 104}, {"begin": 149595, "end": 149774, "id": "b105", "idx": 105}, {"begin": 149778, "end": 150002, "id": "b106", "idx": 106}, {"begin": 150006, "end": 150130, "id": "b107", "idx": 107}, {"begin": 150134, "end": 150243, "id": "b108", "idx": 108}, {"begin": 150247, "end": 150459, "id": "b109", "idx": 109}, {"begin": 150463, "end": 150660, "id": "b110", "idx": 110}, {"begin": 150664, "end": 150846, "id": "b111", "idx": 111}, {"begin": 150850, "end": 151102, "id": "b112", "idx": 112}, {"begin": 151106, "end": 151285, "id": "b113", "idx": 113}, {"begin": 151289, "end": 151456, "id": "b114", "idx": 114}, {"begin": 151460, "end": 151663, "id": "b115", "idx": 115}, {"begin": 151667, "end": 151932, "id": "b116", "idx": 116}, {"begin": 151936, "end": 152095, "id": "b117", "idx": 117}, {"begin": 152099, "end": 152373, "id": "b118", "idx": 118}, {"begin": 152377, "end": 152593, "id": "b119", "idx": 119}, {"begin": 152597, "end": 152757, "id": "b120", "idx": 120}, {"begin": 152761, "end": 152868, "id": "b121", "idx": 121}, {"begin": 152872, "end": 153106, "id": "b122", "idx": 122}, {"begin": 153110, "end": 153252, "id": "b123", "idx": 123}, {"begin": 153256, "end": 153405, "id": "b124", "idx": 124}, {"begin": 153409, "end": 153782, "id": "b125", "idx": 125}, {"begin": 153786, "end": 153952, "id": "b126", "idx": 126}, {"begin": 153956, "end": 154100, "id": "b127", "idx": 127}, {"begin": 154104, "end": 154185, "id": "b128", "idx": 128}, {"begin": 154189, "end": 154385, "id": "b129", "idx": 129}, {"begin": 154389, "end": 154631, "id": "b130", "idx": 130}, {"begin": 154635, "end": 154846, "id": "b131", "idx": 131}, {"begin": 154850, "end": 154990, "id": "b132", "idx": 132}, {"begin": 154994, "end": 155287, "id": "b133", "idx": 133}, {"begin": 155291, "end": 155436, "id": "b134", "idx": 134}, {"begin": 155440, "end": 155847, "id": "b135", "idx": 135}, {"begin": 155851, "end": 156175, "id": "b136", "idx": 136}, {"begin": 156179, "end": 156392, "id": "b137", "idx": 137}, {"begin": 156396, "end": 156757, "id": "b138", "idx": 138}, {"begin": 156761, "end": 156952, "id": "b139", "idx": 139}, {"begin": 156956, "end": 157084, "id": "b140", "idx": 140}, {"begin": 157088, "end": 157218, "id": "b141", "idx": 141}, {"begin": 157222, "end": 157447, "id": "b142", "idx": 142}, {"begin": 157451, "end": 157614, "id": "b143", "idx": 143}, {"begin": 157618, "end": 157814, "id": "b144", "idx": 144}, {"begin": 157818, "end": 158070, "id": "b145", "idx": 145}, {"begin": 158074, "end": 158215, "id": "b146", "idx": 146}, {"begin": 158219, "end": 158422, "id": "b147", "idx": 147}, {"begin": 158426, "end": 158659, "id": "b148", "idx": 148}, {"begin": 158663, "end": 158850, "id": "b149", "idx": 149}, {"begin": 158854, "end": 158993, "id": "b150", "idx": 150}, {"begin": 158997, "end": 159156, "id": "b151", "idx": 151}, {"begin": 159160, "end": 159451, "id": "b152", "idx": 152}, {"begin": 159455, "end": 159690, "id": "b153", "idx": 153}, {"begin": 159694, "end": 159938, "id": "b154", "idx": 154}, {"begin": 159942, "end": 160220, "id": "b155", "idx": 155}, {"begin": 160224, "end": 160607, "id": "b156", "idx": 156}, {"begin": 160611, "end": 160872, "id": "b157", "idx": 157}, {"begin": 160876, "end": 161024, "id": "b158", "idx": 158}, {"begin": 161028, "end": 161115, "id": "b159", "idx": 159}, {"begin": 161119, "end": 161220, "id": "b160", "idx": 160}, {"begin": 161224, "end": 161463, "id": "b161", "idx": 161}, {"begin": 161467, "end": 161692, "id": "b162", "idx": 162}, {"begin": 161696, "end": 161875, "id": "b163", "idx": 163}, {"begin": 161879, "end": 162053, "id": "b164", "idx": 164}, {"begin": 162057, "end": 162193, "id": "b165", "idx": 165}, {"begin": 162197, "end": 162331, "id": "b166", "idx": 166}, {"begin": 162335, "end": 162526, "id": "b167", "idx": 167}, {"begin": 162530, "end": 162723, "id": "b168", "idx": 168}, {"begin": 162727, "end": 162833, "id": "b169", "idx": 169}, {"begin": 162837, "end": 163017, "id": "b170", "idx": 170}, {"begin": 163021, "end": 163242, "id": "b171", "idx": 171}, {"begin": 163246, "end": 163419, "id": "b172", "idx": 172}, {"begin": 163423, "end": 163631, "id": "b173", "idx": 173}, {"begin": 163635, "end": 163847, "id": "b174", "idx": 174}, {"begin": 163851, "end": 163981, "id": "b175", "idx": 175}, {"begin": 163985, "end": 164632, "id": "b176", "idx": 176}, {"begin": 164636, "end": 164807, "id": "b177", "idx": 177}, {"begin": 164811, "end": 165010, "id": "b178", "idx": 178}, {"begin": 165014, "end": 165215, "id": "b179", "idx": 179}, {"begin": 165219, "end": 165471, "id": "b180", "idx": 180}, {"begin": 165475, "end": 165627, "id": "b181", "idx": 181}, {"begin": 165631, "end": 165790, "id": "b182", "idx": 182}, {"begin": 165794, "end": 166218, "id": "b183", "idx": 183}, {"begin": 166222, "end": 166379, "id": "b184", "idx": 184}, {"begin": 166383, "end": 166605, "id": "b185", "idx": 185}, {"begin": 166609, "end": 166759, "id": "b186", "idx": 186}, {"begin": 166763, "end": 166957, "id": "b187", "idx": 187}, {"begin": 166961, "end": 167192, "id": "b188", "idx": 188}, {"begin": 167196, "end": 167445, "id": "b189", "idx": 189}, {"begin": 167449, "end": 167638, "id": "b190", "idx": 190}, {"begin": 167642, "end": 167798, "id": "b191", "idx": 191}, {"begin": 167802, "end": 168077, "id": "b192", "idx": 192}, {"begin": 168081, "end": 168182, "id": "b193", "idx": 193}, {"begin": 168186, "end": 168381, "id": "b194", "idx": 194}, {"begin": 168385, "end": 169640, "id": "b195", "idx": 195}, {"begin": 169644, "end": 170220, "id": "b196", "idx": 196}, {"begin": 170224, "end": 170368, "id": "b197", "idx": 197}, {"begin": 170372, "end": 170516, "id": "b198", "idx": 198}, {"begin": 170520, "end": 170666, "id": "b199", "idx": 199}, {"begin": 170670, "end": 170816, "id": "b200", "idx": 200}, {"begin": 170820, "end": 170963, "id": "b201", "idx": 201}, {"begin": 170967, "end": 171106, "id": "b202", "idx": 202}, {"begin": 171110, "end": 171249, "id": "b203", "idx": 203}, {"begin": 171253, "end": 171392, "id": "b204", "idx": 204}, {"begin": 171396, "end": 171545, "id": "b205", "idx": 205}, {"begin": 171549, "end": 171834, "id": "b206", "idx": 206}, {"begin": 171838, "end": 172118, "id": "b207", "idx": 207}, {"begin": 172122, "end": 172262, "id": "b208", "idx": 208}, {"begin": 172266, "end": 172688, "id": "b209", "idx": 209}, {"begin": 172692, "end": 172881, "id": "b210", "idx": 210}], "ReferenceToTable": [{"begin": 49168, "end": 49170, "target": "#tab_0", "idx": 0}, {"begin": 82848, "end": 82862, "target": "#tab_10", "idx": 1}, {"begin": 83761, "end": 83762, "target": "#tab_11", "idx": 2}, {"begin": 86408, "end": 86409, "target": "#tab_12", "idx": 3}, {"begin": 87002, "end": 87003, "target": "#tab_13", "idx": 4}, {"begin": 95920, "end": 95921, "target": "#tab_15", "idx": 5}, {"begin": 109688, "end": 109689, "target": "#tab_16", "idx": 6}, {"begin": 115005, "end": 115007, "target": "#tab_0", "idx": 7}, {"begin": 115783, "end": 115785, "target": "#tab_17", "idx": 8}, {"begin": 118520, "end": 118522, "target": "#tab_18", "idx": 9}, {"begin": 120944, "end": 120946, "target": "#tab_20", "idx": 10}, {"begin": 125105, "end": 125107, "target": "#tab_22", "idx": 11}, {"begin": 126836, "end": 126838, "target": "#tab_24", "idx": 12}], "Footnote": [{"begin": 127527, "end": 127660, "id": "foot_0", "n": "1", "idx": 0}, {"begin": 127661, "end": 127796, "id": "foot_1", "n": "2", "idx": 1}, {"begin": 127797, "end": 127901, "id": "foot_2", "n": "3", "idx": 2}, {"begin": 127902, "end": 128049, "id": "foot_3", "n": "4", "idx": 3}, {"begin": 128050, "end": 128224, "id": "foot_4", "n": "8", "idx": 4}, {"begin": 128225, "end": 128325, "id": "foot_5", "idx": 5}], "ReferenceToFormula": [{"begin": 16892, "end": 16896, "idx": 0}, {"begin": 43559, "end": 43563, "idx": 1}, {"begin": 70833, "end": 70837, "idx": 2}], "Paragraph": [{"begin": 81, "end": 1549, "idx": 0}, {"begin": 1588, "end": 1816, "idx": 1}, {"begin": 1817, "end": 2482, "idx": 2}, {"begin": 2483, "end": 2987, "idx": 3}, {"begin": 2988, "end": 4751, "idx": 4}, {"begin": 4844, "end": 5934, "idx": 5}, {"begin": 5935, "end": 6603, "idx": 6}, {"begin": 6604, "end": 8484, "idx": 7}, {"begin": 8485, "end": 9090, "idx": 8}, {"begin": 9140, "end": 9738, "idx": 9}, {"begin": 9739, "end": 10275, "idx": 10}, {"begin": 10276, "end": 11129, "idx": 11}, {"begin": 11174, "end": 12074, "idx": 12}, {"begin": 12075, "end": 12960, "idx": 13}, {"begin": 13010, "end": 13631, "idx": 14}, {"begin": 13632, "end": 14126, "idx": 15}, {"begin": 14127, "end": 15225, "idx": 16}, {"begin": 15226, "end": 16413, "idx": 17}, {"begin": 16414, "end": 17877, "idx": 18}, {"begin": 17913, "end": 18935, "idx": 19}, {"begin": 18936, "end": 19875, "idx": 20}, {"begin": 19876, "end": 20748, "idx": 21}, {"begin": 20764, "end": 20821, "idx": 22}, {"begin": 20822, "end": 22917, "idx": 23}, {"begin": 22934, "end": 22957, "idx": 24}, {"begin": 22977, "end": 24141, "idx": 25}, {"begin": 24142, "end": 24465, "idx": 26}, {"begin": 24466, "end": 25105, "idx": 27}, {"begin": 25106, "end": 25343, "idx": 28}, {"begin": 25344, "end": 26206, "idx": 29}, {"begin": 26207, "end": 26742, "idx": 30}, {"begin": 26743, "end": 28099, "idx": 31}, {"begin": 28145, "end": 28333, "idx": 32}, {"begin": 28334, "end": 29310, "idx": 33}, {"begin": 29311, "end": 29816, "idx": 34}, {"begin": 29859, "end": 30980, "idx": 35}, {"begin": 30981, "end": 31598, "idx": 36}, {"begin": 31599, "end": 33029, "idx": 37}, {"begin": 33030, "end": 34162, "idx": 38}, {"begin": 34210, "end": 36085, "idx": 39}, {"begin": 36086, "end": 37096, "idx": 40}, {"begin": 37097, "end": 38202, "idx": 41}, {"begin": 38203, "end": 38449, "idx": 42}, {"begin": 38450, "end": 38627, "idx": 43}, {"begin": 38628, "end": 39070, "idx": 44}, {"begin": 39071, "end": 39352, "idx": 45}, {"begin": 39353, "end": 39724, "idx": 46}, {"begin": 39725, "end": 40203, "idx": 47}, {"begin": 40204, "end": 41314, "idx": 48}, {"begin": 41315, "end": 42617, "idx": 49}, {"begin": 42618, "end": 43689, "idx": 50}, {"begin": 43720, "end": 46019, "idx": 51}, {"begin": 46020, "end": 47389, "idx": 52}, {"begin": 47390, "end": 48291, "idx": 53}, {"begin": 48439, "end": 49234, "idx": 54}, {"begin": 49235, "end": 50001, "idx": 55}, {"begin": 50002, "end": 51503, "idx": 56}, {"begin": 51551, "end": 52547, "idx": 57}, {"begin": 52548, "end": 54718, "idx": 58}, {"begin": 54719, "end": 55118, "idx": 59}, {"begin": 55256, "end": 55627, "idx": 60}, {"begin": 55628, "end": 56414, "idx": 61}, {"begin": 56415, "end": 57383, "idx": 62}, {"begin": 57384, "end": 58201, "idx": 63}, {"begin": 58202, "end": 59161, "idx": 64}, {"begin": 59162, "end": 60472, "idx": 65}, {"begin": 60473, "end": 61515, "idx": 66}, {"begin": 61516, "end": 62334, "idx": 67}, {"begin": 62371, "end": 62865, "idx": 68}, {"begin": 62866, "end": 63894, "idx": 69}, {"begin": 63895, "end": 64630, "idx": 70}, {"begin": 64631, "end": 65595, "idx": 71}, {"begin": 65596, "end": 65804, "idx": 72}, {"begin": 65805, "end": 66165, "idx": 73}, {"begin": 66192, "end": 66952, "idx": 74}, {"begin": 66953, "end": 67330, "idx": 75}, {"begin": 67331, "end": 67647, "idx": 76}, {"begin": 67648, "end": 67946, "idx": 77}, {"begin": 67947, "end": 69291, "idx": 78}, {"begin": 69292, "end": 69451, "idx": 79}, {"begin": 69452, "end": 69799, "idx": 80}, {"begin": 69800, "end": 70540, "idx": 81}, {"begin": 70541, "end": 71029, "idx": 82}, {"begin": 71046, "end": 71201, "idx": 83}, {"begin": 71202, "end": 71678, "idx": 84}, {"begin": 71679, "end": 72335, "idx": 85}, {"begin": 72336, "end": 73069, "idx": 86}, {"begin": 73070, "end": 73363, "idx": 87}, {"begin": 73364, "end": 74237, "idx": 88}, {"begin": 74238, "end": 75096, "idx": 89}, {"begin": 75097, "end": 75723, "idx": 90}, {"begin": 75724, "end": 76644, "idx": 91}, {"begin": 76645, "end": 77059, "idx": 92}, {"begin": 77060, "end": 77886, "idx": 93}, {"begin": 77907, "end": 78918, "idx": 94}, {"begin": 78919, "end": 79441, "idx": 95}, {"begin": 79442, "end": 80219, "idx": 96}, {"begin": 80220, "end": 80818, "idx": 97}, {"begin": 80826, "end": 80830, "idx": 98}, {"begin": 80842, "end": 81287, "idx": 99}, {"begin": 81288, "end": 81624, "idx": 100}, {"begin": 81625, "end": 82270, "idx": 101}, {"begin": 82271, "end": 83788, "idx": 102}, {"begin": 83789, "end": 84791, "idx": 103}, {"begin": 84792, "end": 85079, "idx": 104}, {"begin": 85080, "end": 85366, "idx": 105}, {"begin": 85367, "end": 85860, "idx": 106}, {"begin": 85861, "end": 86410, "idx": 107}, {"begin": 86411, "end": 87313, "idx": 108}, {"begin": 87314, "end": 87648, "idx": 109}, {"begin": 87649, "end": 88013, "idx": 110}, {"begin": 88014, "end": 88425, "idx": 111}, {"begin": 88426, "end": 89066, "idx": 112}, {"begin": 89067, "end": 89773, "idx": 113}, {"begin": 89774, "end": 90105, "idx": 114}, {"begin": 90106, "end": 90974, "idx": 115}, {"begin": 90975, "end": 91567, "idx": 116}, {"begin": 91568, "end": 92219, "idx": 117}, {"begin": 92220, "end": 92382, "idx": 118}, {"begin": 92402, "end": 92845, "idx": 119}, {"begin": 92847, "end": 93514, "idx": 120}, {"begin": 93515, "end": 94516, "idx": 121}, {"begin": 94517, "end": 95184, "idx": 122}, {"begin": 95185, "end": 95399, "idx": 123}, {"begin": 95400, "end": 96228, "idx": 124}, {"begin": 96229, "end": 96978, "idx": 125}, {"begin": 96979, "end": 97579, "idx": 126}, {"begin": 97580, "end": 98016, "idx": 127}, {"begin": 98035, "end": 98211, "idx": 128}, {"begin": 98212, "end": 98422, "idx": 129}, {"begin": 98423, "end": 98787, "idx": 130}, {"begin": 98788, "end": 98937, "idx": 131}, {"begin": 98938, "end": 99075, "idx": 132}, {"begin": 99076, "end": 99193, "idx": 133}, {"begin": 99194, "end": 99337, "idx": 134}, {"begin": 99338, "end": 99403, "idx": 135}, {"begin": 99404, "end": 99521, "idx": 136}, {"begin": 99539, "end": 100011, "idx": 137}, {"begin": 100012, "end": 100568, "idx": 138}, {"begin": 100569, "end": 101212, "idx": 139}, {"begin": 101213, "end": 103406, "idx": 140}, {"begin": 103407, "end": 104138, "idx": 141}, {"begin": 104139, "end": 105225, "idx": 142}, {"begin": 105226, "end": 106393, "idx": 143}, {"begin": 106394, "end": 107559, "idx": 144}, {"begin": 107575, "end": 108284, "idx": 145}, {"begin": 108313, "end": 108463, "idx": 146}, {"begin": 108479, "end": 109690, "idx": 147}, {"begin": 109691, "end": 110180, "idx": 148}, {"begin": 110181, "end": 110557, "idx": 149}, {"begin": 110571, "end": 110681, "idx": 150}, {"begin": 110682, "end": 111147, "idx": 151}, {"begin": 111148, "end": 111523, "idx": 152}, {"begin": 111534, "end": 111812, "idx": 153}, {"begin": 111813, "end": 112105, "idx": 154}, {"begin": 112106, "end": 112321, "idx": 155}, {"begin": 112322, "end": 112506, "idx": 156}, {"begin": 112507, "end": 112790, "idx": 157}, {"begin": 112791, "end": 112972, "idx": 158}, {"begin": 112973, "end": 113200, "idx": 159}, {"begin": 113201, "end": 113408, "idx": 160}, {"begin": 113409, "end": 113531, "idx": 161}, {"begin": 113549, "end": 114933, "idx": 162}, {"begin": 114948, "end": 115544, "idx": 163}, {"begin": 115554, "end": 115561, "idx": 164}, {"begin": 115587, "end": 115866, "idx": 165}, {"begin": 115890, "end": 116724, "idx": 166}, {"begin": 116725, "end": 117430, "idx": 167}, {"begin": 117431, "end": 118086, "idx": 168}, {"begin": 118120, "end": 118750, "idx": 169}, {"begin": 118751, "end": 119177, "idx": 170}, {"begin": 119178, "end": 119780, "idx": 171}, {"begin": 119781, "end": 120194, "idx": 172}, {"begin": 120233, "end": 120505, "idx": 173}, {"begin": 120537, "end": 121587, "idx": 174}, {"begin": 121588, "end": 121758, "idx": 175}, {"begin": 121795, "end": 124142, "idx": 176}, {"begin": 124143, "end": 124259, "idx": 177}, {"begin": 124295, "end": 124888, "idx": 178}, {"begin": 124889, "end": 126239, "idx": 179}, {"begin": 126240, "end": 126414, "idx": 180}, {"begin": 126437, "end": 126551, "idx": 181}, {"begin": 126552, "end": 127261, "idx": 182}, {"begin": 127301, "end": 127514, "idx": 183}], "SectionHeader": [{"begin": 0, "end": 1549, "idx": 0}], "SectionReference": [{"begin": 128327, "end": 172883, "idx": 0}], "Sentence": [{"begin": 81, "end": 192, "idx": 0}, {"begin": 193, "end": 343, "idx": 1}, {"begin": 344, "end": 469, "idx": 2}, {"begin": 470, "end": 727, "idx": 3}, {"begin": 728, "end": 894, "idx": 4}, {"begin": 895, "end": 1138, "idx": 5}, {"begin": 1139, "end": 1296, "idx": 6}, {"begin": 1297, "end": 1464, "idx": 7}, {"begin": 1465, "end": 1549, "idx": 8}, {"begin": 1588, "end": 1816, "idx": 9}, {"begin": 1817, "end": 2008, "idx": 10}, {"begin": 2009, "end": 2314, "idx": 11}, {"begin": 2315, "end": 2482, "idx": 12}, {"begin": 2483, "end": 2673, "idx": 13}, {"begin": 2674, "end": 2836, "idx": 14}, {"begin": 2837, "end": 2960, "idx": 15}, {"begin": 2961, "end": 2987, "idx": 16}, {"begin": 2988, "end": 3167, "idx": 17}, {"begin": 3168, "end": 3389, "idx": 18}, {"begin": 3390, "end": 3558, "idx": 19}, {"begin": 3559, "end": 3715, "idx": 20}, {"begin": 3716, "end": 4068, "idx": 21}, {"begin": 4069, "end": 4405, "idx": 22}, {"begin": 4406, "end": 4751, "idx": 23}, {"begin": 4844, "end": 4964, "idx": 24}, {"begin": 4965, "end": 5076, "idx": 25}, {"begin": 5077, "end": 5168, "idx": 26}, {"begin": 5169, "end": 5258, "idx": 27}, {"begin": 5259, "end": 5351, "idx": 28}, {"begin": 5352, "end": 5451, "idx": 29}, {"begin": 5452, "end": 5578, "idx": 30}, {"begin": 5579, "end": 5716, "idx": 31}, {"begin": 5717, "end": 5934, "idx": 32}, {"begin": 5935, "end": 6127, "idx": 33}, {"begin": 6128, "end": 6168, "idx": 34}, {"begin": 6169, "end": 6281, "idx": 35}, {"begin": 6282, "end": 6403, "idx": 36}, {"begin": 6404, "end": 6519, "idx": 37}, {"begin": 6520, "end": 6603, "idx": 38}, {"begin": 6604, "end": 6762, "idx": 39}, {"begin": 6763, "end": 6992, "idx": 40}, {"begin": 6993, "end": 7127, "idx": 41}, {"begin": 7128, "end": 7482, "idx": 42}, {"begin": 7483, "end": 7731, "idx": 43}, {"begin": 7732, "end": 7905, "idx": 44}, {"begin": 7906, "end": 8021, "idx": 45}, {"begin": 8022, "end": 8104, "idx": 46}, {"begin": 8105, "end": 8238, "idx": 47}, {"begin": 8239, "end": 8372, "idx": 48}, {"begin": 8373, "end": 8484, "idx": 49}, {"begin": 8485, "end": 8550, "idx": 50}, {"begin": 8551, "end": 8755, "idx": 51}, {"begin": 8756, "end": 8994, "idx": 52}, {"begin": 8995, "end": 9090, "idx": 53}, {"begin": 9140, "end": 9250, "idx": 54}, {"begin": 9251, "end": 9448, "idx": 55}, {"begin": 9449, "end": 9738, "idx": 56}, {"begin": 9739, "end": 9916, "idx": 57}, {"begin": 9917, "end": 9986, "idx": 58}, {"begin": 9987, "end": 10275, "idx": 59}, {"begin": 10276, "end": 10367, "idx": 60}, {"begin": 10368, "end": 10642, "idx": 61}, {"begin": 10643, "end": 10785, "idx": 62}, {"begin": 10786, "end": 11052, "idx": 63}, {"begin": 11053, "end": 11129, "idx": 64}, {"begin": 11174, "end": 11321, "idx": 65}, {"begin": 11322, "end": 11478, "idx": 66}, {"begin": 11479, "end": 11597, "idx": 67}, {"begin": 11598, "end": 11723, "idx": 68}, {"begin": 11724, "end": 11865, "idx": 69}, {"begin": 11866, "end": 12025, "idx": 70}, {"begin": 12026, "end": 12074, "idx": 71}, {"begin": 12075, "end": 12207, "idx": 72}, {"begin": 12208, "end": 12368, "idx": 73}, {"begin": 12369, "end": 12521, "idx": 74}, {"begin": 12522, "end": 12813, "idx": 75}, {"begin": 12814, "end": 12910, "idx": 76}, {"begin": 12911, "end": 12960, "idx": 77}, {"begin": 13010, "end": 13085, "idx": 78}, {"begin": 13086, "end": 13260, "idx": 79}, {"begin": 13261, "end": 13443, "idx": 80}, {"begin": 13444, "end": 13631, "idx": 81}, {"begin": 13632, "end": 13771, "idx": 82}, {"begin": 13772, "end": 13841, "idx": 83}, {"begin": 13842, "end": 14126, "idx": 84}, {"begin": 14127, "end": 14172, "idx": 85}, {"begin": 14173, "end": 14245, "idx": 86}, {"begin": 14246, "end": 14365, "idx": 87}, {"begin": 14366, "end": 14562, "idx": 88}, {"begin": 14563, "end": 14796, "idx": 89}, {"begin": 14797, "end": 14998, "idx": 90}, {"begin": 14999, "end": 15225, "idx": 91}, {"begin": 15226, "end": 15377, "idx": 92}, {"begin": 15378, "end": 15520, "idx": 93}, {"begin": 15521, "end": 15589, "idx": 94}, {"begin": 15590, "end": 15863, "idx": 95}, {"begin": 15864, "end": 15936, "idx": 96}, {"begin": 15937, "end": 16012, "idx": 97}, {"begin": 16013, "end": 16413, "idx": 98}, {"begin": 16414, "end": 16603, "idx": 99}, {"begin": 16604, "end": 16737, "idx": 100}, {"begin": 16738, "end": 16937, "idx": 101}, {"begin": 16938, "end": 17055, "idx": 102}, {"begin": 17056, "end": 17281, "idx": 103}, {"begin": 17282, "end": 17511, "idx": 104}, {"begin": 17512, "end": 17568, "idx": 105}, {"begin": 17569, "end": 17661, "idx": 106}, {"begin": 17662, "end": 17877, "idx": 107}, {"begin": 17913, "end": 17975, "idx": 108}, {"begin": 17976, "end": 18128, "idx": 109}, {"begin": 18129, "end": 18295, "idx": 110}, {"begin": 18296, "end": 18381, "idx": 111}, {"begin": 18382, "end": 18573, "idx": 112}, {"begin": 18574, "end": 18698, "idx": 113}, {"begin": 18699, "end": 18935, "idx": 114}, {"begin": 18936, "end": 19064, "idx": 115}, {"begin": 19065, "end": 19149, "idx": 116}, {"begin": 19150, "end": 19293, "idx": 117}, {"begin": 19294, "end": 19365, "idx": 118}, {"begin": 19366, "end": 19649, "idx": 119}, {"begin": 19650, "end": 19875, "idx": 120}, {"begin": 19876, "end": 20256, "idx": 121}, {"begin": 20257, "end": 20496, "idx": 122}, {"begin": 20497, "end": 20748, "idx": 123}, {"begin": 20764, "end": 20821, "idx": 124}, {"begin": 20822, "end": 21002, "idx": 125}, {"begin": 21003, "end": 21065, "idx": 126}, {"begin": 21066, "end": 21142, "idx": 127}, {"begin": 21143, "end": 21177, "idx": 128}, {"begin": 21178, "end": 21428, "idx": 129}, {"begin": 21429, "end": 21590, "idx": 130}, {"begin": 21591, "end": 21691, "idx": 131}, {"begin": 21692, "end": 21911, "idx": 132}, {"begin": 21912, "end": 21957, "idx": 133}, {"begin": 21958, "end": 22050, "idx": 134}, {"begin": 22051, "end": 22277, "idx": 135}, {"begin": 22278, "end": 22459, "idx": 136}, {"begin": 22460, "end": 22601, "idx": 137}, {"begin": 22602, "end": 22757, "idx": 138}, {"begin": 22758, "end": 22797, "idx": 139}, {"begin": 22798, "end": 22917, "idx": 140}, {"begin": 22934, "end": 22938, "idx": 141}, {"begin": 22939, "end": 22957, "idx": 142}, {"begin": 22977, "end": 23135, "idx": 143}, {"begin": 23136, "end": 23223, "idx": 144}, {"begin": 23224, "end": 23355, "idx": 145}, {"begin": 23356, "end": 23615, "idx": 146}, {"begin": 23616, "end": 23699, "idx": 147}, {"begin": 23700, "end": 23928, "idx": 148}, {"begin": 23929, "end": 24141, "idx": 149}, {"begin": 24142, "end": 24241, "idx": 150}, {"begin": 24242, "end": 24412, "idx": 151}, {"begin": 24413, "end": 24465, "idx": 152}, {"begin": 24466, "end": 24622, "idx": 153}, {"begin": 24623, "end": 24850, "idx": 154}, {"begin": 24851, "end": 25105, "idx": 155}, {"begin": 25106, "end": 25343, "idx": 156}, {"begin": 25344, "end": 25487, "idx": 157}, {"begin": 25488, "end": 25704, "idx": 158}, {"begin": 25705, "end": 26027, "idx": 159}, {"begin": 26028, "end": 26206, "idx": 160}, {"begin": 26207, "end": 26213, "idx": 161}, {"begin": 26214, "end": 26345, "idx": 162}, {"begin": 26346, "end": 26408, "idx": 163}, {"begin": 26409, "end": 26583, "idx": 164}, {"begin": 26584, "end": 26742, "idx": 165}, {"begin": 26743, "end": 26904, "idx": 166}, {"begin": 26905, "end": 27068, "idx": 167}, {"begin": 27069, "end": 27384, "idx": 168}, {"begin": 27385, "end": 27576, "idx": 169}, {"begin": 27577, "end": 27853, "idx": 170}, {"begin": 27854, "end": 28004, "idx": 171}, {"begin": 28005, "end": 28099, "idx": 172}, {"begin": 28145, "end": 28149, "idx": 173}, {"begin": 28150, "end": 28216, "idx": 174}, {"begin": 28217, "end": 28333, "idx": 175}, {"begin": 28334, "end": 28430, "idx": 176}, {"begin": 28431, "end": 28719, "idx": 177}, {"begin": 28720, "end": 28985, "idx": 178}, {"begin": 28986, "end": 29181, "idx": 179}, {"begin": 29182, "end": 29310, "idx": 180}, {"begin": 29311, "end": 29381, "idx": 181}, {"begin": 29382, "end": 29514, "idx": 182}, {"begin": 29515, "end": 29816, "idx": 183}, {"begin": 29859, "end": 30029, "idx": 184}, {"begin": 30030, "end": 30180, "idx": 185}, {"begin": 30181, "end": 30338, "idx": 186}, {"begin": 30339, "end": 30480, "idx": 187}, {"begin": 30481, "end": 30666, "idx": 188}, {"begin": 30667, "end": 30825, "idx": 189}, {"begin": 30826, "end": 30980, "idx": 190}, {"begin": 30981, "end": 31008, "idx": 191}, {"begin": 31009, "end": 31173, "idx": 192}, {"begin": 31174, "end": 31282, "idx": 193}, {"begin": 31283, "end": 31368, "idx": 194}, {"begin": 31369, "end": 31598, "idx": 195}, {"begin": 31599, "end": 31745, "idx": 196}, {"begin": 31746, "end": 31815, "idx": 197}, {"begin": 31816, "end": 32001, "idx": 198}, {"begin": 32002, "end": 32081, "idx": 199}, {"begin": 32082, "end": 32157, "idx": 200}, {"begin": 32158, "end": 32381, "idx": 201}, {"begin": 32382, "end": 32421, "idx": 202}, {"begin": 32422, "end": 32524, "idx": 203}, {"begin": 32525, "end": 32639, "idx": 204}, {"begin": 32640, "end": 32738, "idx": 205}, {"begin": 32739, "end": 32850, "idx": 206}, {"begin": 32851, "end": 33029, "idx": 207}, {"begin": 33030, "end": 33142, "idx": 208}, {"begin": 33143, "end": 33277, "idx": 209}, {"begin": 33278, "end": 33358, "idx": 210}, {"begin": 33359, "end": 33543, "idx": 211}, {"begin": 33544, "end": 33686, "idx": 212}, {"begin": 33687, "end": 33840, "idx": 213}, {"begin": 33841, "end": 33940, "idx": 214}, {"begin": 33941, "end": 34162, "idx": 215}, {"begin": 34210, "end": 34387, "idx": 216}, {"begin": 34388, "end": 34478, "idx": 217}, {"begin": 34479, "end": 34557, "idx": 218}, {"begin": 34558, "end": 34762, "idx": 219}, {"begin": 34763, "end": 34822, "idx": 220}, {"begin": 34823, "end": 34888, "idx": 221}, {"begin": 34889, "end": 34967, "idx": 222}, {"begin": 34968, "end": 35193, "idx": 223}, {"begin": 35194, "end": 35249, "idx": 224}, {"begin": 35250, "end": 35364, "idx": 225}, {"begin": 35365, "end": 35555, "idx": 226}, {"begin": 35556, "end": 35677, "idx": 227}, {"begin": 35678, "end": 35785, "idx": 228}, {"begin": 35786, "end": 35841, "idx": 229}, {"begin": 35842, "end": 35914, "idx": 230}, {"begin": 35915, "end": 36085, "idx": 231}, {"begin": 36086, "end": 36525, "idx": 232}, {"begin": 36526, "end": 36610, "idx": 233}, {"begin": 36611, "end": 36811, "idx": 234}, {"begin": 36812, "end": 37096, "idx": 235}, {"begin": 37097, "end": 37305, "idx": 236}, {"begin": 37306, "end": 37534, "idx": 237}, {"begin": 37535, "end": 37719, "idx": 238}, {"begin": 37720, "end": 37810, "idx": 239}, {"begin": 37811, "end": 37955, "idx": 240}, {"begin": 37956, "end": 38052, "idx": 241}, {"begin": 38053, "end": 38202, "idx": 242}, {"begin": 38203, "end": 38264, "idx": 243}, {"begin": 38265, "end": 38449, "idx": 244}, {"begin": 38450, "end": 38627, "idx": 245}, {"begin": 38628, "end": 38913, "idx": 246}, {"begin": 38914, "end": 39070, "idx": 247}, {"begin": 39071, "end": 39352, "idx": 248}, {"begin": 39353, "end": 39482, "idx": 249}, {"begin": 39483, "end": 39724, "idx": 250}, {"begin": 39725, "end": 39876, "idx": 251}, {"begin": 39877, "end": 40069, "idx": 252}, {"begin": 40070, "end": 40203, "idx": 253}, {"begin": 40204, "end": 40466, "idx": 254}, {"begin": 40467, "end": 40827, "idx": 255}, {"begin": 40828, "end": 40936, "idx": 256}, {"begin": 40937, "end": 41069, "idx": 257}, {"begin": 41070, "end": 41314, "idx": 258}, {"begin": 41315, "end": 41434, "idx": 259}, {"begin": 41435, "end": 41530, "idx": 260}, {"begin": 41531, "end": 41687, "idx": 261}, {"begin": 41688, "end": 41790, "idx": 262}, {"begin": 41791, "end": 41923, "idx": 263}, {"begin": 41924, "end": 42061, "idx": 264}, {"begin": 42062, "end": 42148, "idx": 265}, {"begin": 42149, "end": 42286, "idx": 266}, {"begin": 42287, "end": 42518, "idx": 267}, {"begin": 42519, "end": 42617, "idx": 268}, {"begin": 42618, "end": 42859, "idx": 269}, {"begin": 42860, "end": 43002, "idx": 270}, {"begin": 43003, "end": 43101, "idx": 271}, {"begin": 43102, "end": 43315, "idx": 272}, {"begin": 43316, "end": 43423, "idx": 273}, {"begin": 43424, "end": 43689, "idx": 274}, {"begin": 43720, "end": 43925, "idx": 275}, {"begin": 43926, "end": 44100, "idx": 276}, {"begin": 44101, "end": 44245, "idx": 277}, {"begin": 44246, "end": 44329, "idx": 278}, {"begin": 44330, "end": 44536, "idx": 279}, {"begin": 44537, "end": 44694, "idx": 280}, {"begin": 44695, "end": 44795, "idx": 281}, {"begin": 44796, "end": 45012, "idx": 282}, {"begin": 45013, "end": 45150, "idx": 283}, {"begin": 45151, "end": 45359, "idx": 284}, {"begin": 45360, "end": 45452, "idx": 285}, {"begin": 45453, "end": 45550, "idx": 286}, {"begin": 45551, "end": 45824, "idx": 287}, {"begin": 45825, "end": 45962, "idx": 288}, {"begin": 45963, "end": 46019, "idx": 289}, {"begin": 46020, "end": 46054, "idx": 290}, {"begin": 46055, "end": 46237, "idx": 291}, {"begin": 46238, "end": 46430, "idx": 292}, {"begin": 46431, "end": 46541, "idx": 293}, {"begin": 46542, "end": 46775, "idx": 294}, {"begin": 46776, "end": 46952, "idx": 295}, {"begin": 46953, "end": 47158, "idx": 296}, {"begin": 47159, "end": 47290, "idx": 297}, {"begin": 47291, "end": 47389, "idx": 298}, {"begin": 47390, "end": 47581, "idx": 299}, {"begin": 47582, "end": 47702, "idx": 300}, {"begin": 47703, "end": 47787, "idx": 301}, {"begin": 47788, "end": 47917, "idx": 302}, {"begin": 47918, "end": 48004, "idx": 303}, {"begin": 48005, "end": 48249, "idx": 304}, {"begin": 48250, "end": 48291, "idx": 305}, {"begin": 48439, "end": 48880, "idx": 306}, {"begin": 48881, "end": 48960, "idx": 307}, {"begin": 48961, "end": 49052, "idx": 308}, {"begin": 49053, "end": 49157, "idx": 309}, {"begin": 49158, "end": 49234, "idx": 310}, {"begin": 49235, "end": 49305, "idx": 311}, {"begin": 49306, "end": 49408, "idx": 312}, {"begin": 49409, "end": 49508, "idx": 313}, {"begin": 49509, "end": 49604, "idx": 314}, {"begin": 49605, "end": 49780, "idx": 315}, {"begin": 49781, "end": 49920, "idx": 316}, {"begin": 49921, "end": 50001, "idx": 317}, {"begin": 50002, "end": 50205, "idx": 318}, {"begin": 50206, "end": 50282, "idx": 319}, {"begin": 50283, "end": 50479, "idx": 320}, {"begin": 50480, "end": 50594, "idx": 321}, {"begin": 50595, "end": 50665, "idx": 322}, {"begin": 50666, "end": 50827, "idx": 323}, {"begin": 50828, "end": 50961, "idx": 324}, {"begin": 50962, "end": 51038, "idx": 325}, {"begin": 51039, "end": 51159, "idx": 326}, {"begin": 51160, "end": 51263, "idx": 327}, {"begin": 51264, "end": 51356, "idx": 328}, {"begin": 51357, "end": 51503, "idx": 329}, {"begin": 51551, "end": 51674, "idx": 330}, {"begin": 51675, "end": 52040, "idx": 331}, {"begin": 52041, "end": 52072, "idx": 332}, {"begin": 52073, "end": 52162, "idx": 333}, {"begin": 52163, "end": 52377, "idx": 334}, {"begin": 52378, "end": 52547, "idx": 335}, {"begin": 52548, "end": 52649, "idx": 336}, {"begin": 52650, "end": 52755, "idx": 337}, {"begin": 52756, "end": 52862, "idx": 338}, {"begin": 52863, "end": 53069, "idx": 339}, {"begin": 53070, "end": 53204, "idx": 340}, {"begin": 53205, "end": 53324, "idx": 341}, {"begin": 53325, "end": 53635, "idx": 342}, {"begin": 53636, "end": 53981, "idx": 343}, {"begin": 53982, "end": 54232, "idx": 344}, {"begin": 54233, "end": 54365, "idx": 345}, {"begin": 54366, "end": 54578, "idx": 346}, {"begin": 54579, "end": 54718, "idx": 347}, {"begin": 54719, "end": 54855, "idx": 348}, {"begin": 54856, "end": 55059, "idx": 349}, {"begin": 55060, "end": 55118, "idx": 350}, {"begin": 55256, "end": 55350, "idx": 351}, {"begin": 55351, "end": 55522, "idx": 352}, {"begin": 55523, "end": 55627, "idx": 353}, {"begin": 55628, "end": 55666, "idx": 354}, {"begin": 55667, "end": 55834, "idx": 355}, {"begin": 55835, "end": 56020, "idx": 356}, {"begin": 56021, "end": 56111, "idx": 357}, {"begin": 56112, "end": 56232, "idx": 358}, {"begin": 56233, "end": 56414, "idx": 359}, {"begin": 56415, "end": 56577, "idx": 360}, {"begin": 56578, "end": 56791, "idx": 361}, {"begin": 56792, "end": 57063, "idx": 362}, {"begin": 57064, "end": 57144, "idx": 363}, {"begin": 57145, "end": 57383, "idx": 364}, {"begin": 57384, "end": 57585, "idx": 365}, {"begin": 57586, "end": 57782, "idx": 366}, {"begin": 57783, "end": 57989, "idx": 367}, {"begin": 57990, "end": 58104, "idx": 368}, {"begin": 58105, "end": 58201, "idx": 369}, {"begin": 58202, "end": 58338, "idx": 370}, {"begin": 58339, "end": 58401, "idx": 371}, {"begin": 58402, "end": 58543, "idx": 372}, {"begin": 58544, "end": 58613, "idx": 373}, {"begin": 58614, "end": 58679, "idx": 374}, {"begin": 58680, "end": 58851, "idx": 375}, {"begin": 58852, "end": 59161, "idx": 376}, {"begin": 59162, "end": 59285, "idx": 377}, {"begin": 59286, "end": 59392, "idx": 378}, {"begin": 59393, "end": 59472, "idx": 379}, {"begin": 59473, "end": 59587, "idx": 380}, {"begin": 59588, "end": 59713, "idx": 381}, {"begin": 59714, "end": 59763, "idx": 382}, {"begin": 59764, "end": 59913, "idx": 383}, {"begin": 59914, "end": 60029, "idx": 384}, {"begin": 60030, "end": 60169, "idx": 385}, {"begin": 60170, "end": 60226, "idx": 386}, {"begin": 60227, "end": 60472, "idx": 387}, {"begin": 60473, "end": 60612, "idx": 388}, {"begin": 60613, "end": 60751, "idx": 389}, {"begin": 60752, "end": 60930, "idx": 390}, {"begin": 60931, "end": 61181, "idx": 391}, {"begin": 61182, "end": 61293, "idx": 392}, {"begin": 61294, "end": 61515, "idx": 393}, {"begin": 61516, "end": 61897, "idx": 394}, {"begin": 61898, "end": 62009, "idx": 395}, {"begin": 62010, "end": 62334, "idx": 396}, {"begin": 62371, "end": 62433, "idx": 397}, {"begin": 62434, "end": 62571, "idx": 398}, {"begin": 62572, "end": 62744, "idx": 399}, {"begin": 62745, "end": 62865, "idx": 400}, {"begin": 62866, "end": 63116, "idx": 401}, {"begin": 63117, "end": 63267, "idx": 402}, {"begin": 63268, "end": 63429, "idx": 403}, {"begin": 63430, "end": 63532, "idx": 404}, {"begin": 63533, "end": 63791, "idx": 405}, {"begin": 63792, "end": 63894, "idx": 406}, {"begin": 63895, "end": 64074, "idx": 407}, {"begin": 64075, "end": 64186, "idx": 408}, {"begin": 64187, "end": 64344, "idx": 409}, {"begin": 64345, "end": 64630, "idx": 410}, {"begin": 64631, "end": 64817, "idx": 411}, {"begin": 64818, "end": 65077, "idx": 412}, {"begin": 65078, "end": 65240, "idx": 413}, {"begin": 65241, "end": 65397, "idx": 414}, {"begin": 65398, "end": 65595, "idx": 415}, {"begin": 65596, "end": 65804, "idx": 416}, {"begin": 65805, "end": 65940, "idx": 417}, {"begin": 65941, "end": 66165, "idx": 418}, {"begin": 66192, "end": 66300, "idx": 419}, {"begin": 66301, "end": 66518, "idx": 420}, {"begin": 66519, "end": 66611, "idx": 421}, {"begin": 66612, "end": 66759, "idx": 422}, {"begin": 66760, "end": 66833, "idx": 423}, {"begin": 66834, "end": 66952, "idx": 424}, {"begin": 66953, "end": 67048, "idx": 425}, {"begin": 67049, "end": 67145, "idx": 426}, {"begin": 67146, "end": 67201, "idx": 427}, {"begin": 67202, "end": 67330, "idx": 428}, {"begin": 67331, "end": 67450, "idx": 429}, {"begin": 67451, "end": 67507, "idx": 430}, {"begin": 67508, "end": 67647, "idx": 431}, {"begin": 67648, "end": 67858, "idx": 432}, {"begin": 67859, "end": 67946, "idx": 433}, {"begin": 67947, "end": 68000, "idx": 434}, {"begin": 68001, "end": 68072, "idx": 435}, {"begin": 68073, "end": 68371, "idx": 436}, {"begin": 68372, "end": 68536, "idx": 437}, {"begin": 68537, "end": 68602, "idx": 438}, {"begin": 68603, "end": 68735, "idx": 439}, {"begin": 68736, "end": 68811, "idx": 440}, {"begin": 68812, "end": 68912, "idx": 441}, {"begin": 68913, "end": 68960, "idx": 442}, {"begin": 68961, "end": 69075, "idx": 443}, {"begin": 69076, "end": 69159, "idx": 444}, {"begin": 69160, "end": 69291, "idx": 445}, {"begin": 69292, "end": 69451, "idx": 446}, {"begin": 69452, "end": 69509, "idx": 447}, {"begin": 69510, "end": 69544, "idx": 448}, {"begin": 69545, "end": 69799, "idx": 449}, {"begin": 69800, "end": 69934, "idx": 450}, {"begin": 69935, "end": 70020, "idx": 451}, {"begin": 70021, "end": 70097, "idx": 452}, {"begin": 70098, "end": 70154, "idx": 453}, {"begin": 70155, "end": 70328, "idx": 454}, {"begin": 70329, "end": 70439, "idx": 455}, {"begin": 70440, "end": 70540, "idx": 456}, {"begin": 70541, "end": 70666, "idx": 457}, {"begin": 70667, "end": 70799, "idx": 458}, {"begin": 70800, "end": 71029, "idx": 459}, {"begin": 71046, "end": 71087, "idx": 460}, {"begin": 71088, "end": 71201, "idx": 461}, {"begin": 71202, "end": 71542, "idx": 462}, {"begin": 71543, "end": 71678, "idx": 463}, {"begin": 71679, "end": 71749, "idx": 464}, {"begin": 71750, "end": 71857, "idx": 465}, {"begin": 71858, "end": 71954, "idx": 466}, {"begin": 71955, "end": 72182, "idx": 467}, {"begin": 72183, "end": 72233, "idx": 468}, {"begin": 72234, "end": 72335, "idx": 469}, {"begin": 72336, "end": 72446, "idx": 470}, {"begin": 72447, "end": 72651, "idx": 471}, {"begin": 72652, "end": 72763, "idx": 472}, {"begin": 72764, "end": 72956, "idx": 473}, {"begin": 72957, "end": 73069, "idx": 474}, {"begin": 73070, "end": 73285, "idx": 475}, {"begin": 73286, "end": 73363, "idx": 476}, {"begin": 73364, "end": 73556, "idx": 477}, {"begin": 73557, "end": 73633, "idx": 478}, {"begin": 73634, "end": 73732, "idx": 479}, {"begin": 73733, "end": 73887, "idx": 480}, {"begin": 73888, "end": 74003, "idx": 481}, {"begin": 74004, "end": 74161, "idx": 482}, {"begin": 74162, "end": 74237, "idx": 483}, {"begin": 74238, "end": 74429, "idx": 484}, {"begin": 74430, "end": 74559, "idx": 485}, {"begin": 74560, "end": 74707, "idx": 486}, {"begin": 74708, "end": 74885, "idx": 487}, {"begin": 74886, "end": 75096, "idx": 488}, {"begin": 75097, "end": 75166, "idx": 489}, {"begin": 75167, "end": 75289, "idx": 490}, {"begin": 75290, "end": 75481, "idx": 491}, {"begin": 75482, "end": 75723, "idx": 492}, {"begin": 75724, "end": 75776, "idx": 493}, {"begin": 75777, "end": 75909, "idx": 494}, {"begin": 75910, "end": 76016, "idx": 495}, {"begin": 76017, "end": 76114, "idx": 496}, {"begin": 76115, "end": 76179, "idx": 497}, {"begin": 76180, "end": 76455, "idx": 498}, {"begin": 76456, "end": 76644, "idx": 499}, {"begin": 76645, "end": 76704, "idx": 500}, {"begin": 76705, "end": 76811, "idx": 501}, {"begin": 76812, "end": 76902, "idx": 502}, {"begin": 76903, "end": 77059, "idx": 503}, {"begin": 77060, "end": 77229, "idx": 504}, {"begin": 77230, "end": 77315, "idx": 505}, {"begin": 77316, "end": 77424, "idx": 506}, {"begin": 77425, "end": 77507, "idx": 507}, {"begin": 77508, "end": 77622, "idx": 508}, {"begin": 77623, "end": 77762, "idx": 509}, {"begin": 77763, "end": 77886, "idx": 510}, {"begin": 77907, "end": 78014, "idx": 511}, {"begin": 78015, "end": 78239, "idx": 512}, {"begin": 78240, "end": 78387, "idx": 513}, {"begin": 78388, "end": 78602, "idx": 514}, {"begin": 78603, "end": 78918, "idx": 515}, {"begin": 78919, "end": 79070, "idx": 516}, {"begin": 79071, "end": 79170, "idx": 517}, {"begin": 79171, "end": 79441, "idx": 518}, {"begin": 79442, "end": 79621, "idx": 519}, {"begin": 79622, "end": 79771, "idx": 520}, {"begin": 79772, "end": 79828, "idx": 521}, {"begin": 79829, "end": 79948, "idx": 522}, {"begin": 79949, "end": 80116, "idx": 523}, {"begin": 80117, "end": 80219, "idx": 524}, {"begin": 80220, "end": 80296, "idx": 525}, {"begin": 80297, "end": 80444, "idx": 526}, {"begin": 80445, "end": 80606, "idx": 527}, {"begin": 80607, "end": 80818, "idx": 528}, {"begin": 80826, "end": 80830, "idx": 529}, {"begin": 80842, "end": 81149, "idx": 530}, {"begin": 81150, "end": 81287, "idx": 531}, {"begin": 81288, "end": 81470, "idx": 532}, {"begin": 81471, "end": 81624, "idx": 533}, {"begin": 81625, "end": 81887, "idx": 534}, {"begin": 81888, "end": 82043, "idx": 535}, {"begin": 82044, "end": 82117, "idx": 536}, {"begin": 82118, "end": 82270, "idx": 537}, {"begin": 82271, "end": 82470, "idx": 538}, {"begin": 82471, "end": 82707, "idx": 539}, {"begin": 82708, "end": 82836, "idx": 540}, {"begin": 82837, "end": 82864, "idx": 541}, {"begin": 82865, "end": 82893, "idx": 542}, {"begin": 82894, "end": 83060, "idx": 543}, {"begin": 83061, "end": 83314, "idx": 544}, {"begin": 83315, "end": 83494, "idx": 545}, {"begin": 83495, "end": 83660, "idx": 546}, {"begin": 83661, "end": 83754, "idx": 547}, {"begin": 83755, "end": 83788, "idx": 548}, {"begin": 83789, "end": 84167, "idx": 549}, {"begin": 84168, "end": 84357, "idx": 550}, {"begin": 84358, "end": 84565, "idx": 551}, {"begin": 84566, "end": 84791, "idx": 552}, {"begin": 84792, "end": 84957, "idx": 553}, {"begin": 84958, "end": 85079, "idx": 554}, {"begin": 85080, "end": 85244, "idx": 555}, {"begin": 85245, "end": 85366, "idx": 556}, {"begin": 85367, "end": 85569, "idx": 557}, {"begin": 85570, "end": 85765, "idx": 558}, {"begin": 85766, "end": 85860, "idx": 559}, {"begin": 85861, "end": 86033, "idx": 560}, {"begin": 86034, "end": 86290, "idx": 561}, {"begin": 86291, "end": 86410, "idx": 562}, {"begin": 86411, "end": 86682, "idx": 563}, {"begin": 86683, "end": 86838, "idx": 564}, {"begin": 86839, "end": 87005, "idx": 565}, {"begin": 87006, "end": 87313, "idx": 566}, {"begin": 87314, "end": 87471, "idx": 567}, {"begin": 87472, "end": 87648, "idx": 568}, {"begin": 87649, "end": 87831, "idx": 569}, {"begin": 87832, "end": 88013, "idx": 570}, {"begin": 88014, "end": 88189, "idx": 571}, {"begin": 88190, "end": 88425, "idx": 572}, {"begin": 88426, "end": 88712, "idx": 573}, {"begin": 88713, "end": 88769, "idx": 574}, {"begin": 88770, "end": 88859, "idx": 575}, {"begin": 88860, "end": 89066, "idx": 576}, {"begin": 89067, "end": 89242, "idx": 577}, {"begin": 89243, "end": 89308, "idx": 578}, {"begin": 89309, "end": 89408, "idx": 579}, {"begin": 89409, "end": 89599, "idx": 580}, {"begin": 89600, "end": 89773, "idx": 581}, {"begin": 89774, "end": 89913, "idx": 582}, {"begin": 89914, "end": 90105, "idx": 583}, {"begin": 90106, "end": 90431, "idx": 584}, {"begin": 90432, "end": 90539, "idx": 585}, {"begin": 90540, "end": 90689, "idx": 586}, {"begin": 90690, "end": 90853, "idx": 587}, {"begin": 90854, "end": 90974, "idx": 588}, {"begin": 90975, "end": 91201, "idx": 589}, {"begin": 91202, "end": 91467, "idx": 590}, {"begin": 91468, "end": 91493, "idx": 591}, {"begin": 91494, "end": 91567, "idx": 592}, {"begin": 91568, "end": 91716, "idx": 593}, {"begin": 91717, "end": 91987, "idx": 594}, {"begin": 91988, "end": 92066, "idx": 595}, {"begin": 92067, "end": 92219, "idx": 596}, {"begin": 92220, "end": 92260, "idx": 597}, {"begin": 92261, "end": 92382, "idx": 598}, {"begin": 92402, "end": 92550, "idx": 599}, {"begin": 92551, "end": 92845, "idx": 600}, {"begin": 92847, "end": 92857, "idx": 601}, {"begin": 92858, "end": 93043, "idx": 602}, {"begin": 93044, "end": 93148, "idx": 603}, {"begin": 93149, "end": 93191, "idx": 604}, {"begin": 93192, "end": 93259, "idx": 605}, {"begin": 93260, "end": 93280, "idx": 606}, {"begin": 93281, "end": 93514, "idx": 607}, {"begin": 93515, "end": 93635, "idx": 608}, {"begin": 93636, "end": 93735, "idx": 609}, {"begin": 93736, "end": 93750, "idx": 610}, {"begin": 93751, "end": 93909, "idx": 611}, {"begin": 93910, "end": 94108, "idx": 612}, {"begin": 94109, "end": 94207, "idx": 613}, {"begin": 94208, "end": 94291, "idx": 614}, {"begin": 94292, "end": 94516, "idx": 615}, {"begin": 94517, "end": 94718, "idx": 616}, {"begin": 94719, "end": 94938, "idx": 617}, {"begin": 94939, "end": 95039, "idx": 618}, {"begin": 95040, "end": 95184, "idx": 619}, {"begin": 95185, "end": 95276, "idx": 620}, {"begin": 95277, "end": 95399, "idx": 621}, {"begin": 95400, "end": 95508, "idx": 622}, {"begin": 95509, "end": 95641, "idx": 623}, {"begin": 95642, "end": 96228, "idx": 624}, {"begin": 96229, "end": 96344, "idx": 625}, {"begin": 96345, "end": 96444, "idx": 626}, {"begin": 96445, "end": 96570, "idx": 627}, {"begin": 96571, "end": 96978, "idx": 628}, {"begin": 96979, "end": 97087, "idx": 629}, {"begin": 97088, "end": 97221, "idx": 630}, {"begin": 97222, "end": 97282, "idx": 631}, {"begin": 97283, "end": 97405, "idx": 632}, {"begin": 97406, "end": 97579, "idx": 633}, {"begin": 97580, "end": 97684, "idx": 634}, {"begin": 97685, "end": 97885, "idx": 635}, {"begin": 97886, "end": 98016, "idx": 636}, {"begin": 98035, "end": 98211, "idx": 637}, {"begin": 98212, "end": 98422, "idx": 638}, {"begin": 98423, "end": 98676, "idx": 639}, {"begin": 98677, "end": 98787, "idx": 640}, {"begin": 98788, "end": 98937, "idx": 641}, {"begin": 98938, "end": 99075, "idx": 642}, {"begin": 99076, "end": 99193, "idx": 643}, {"begin": 99194, "end": 99337, "idx": 644}, {"begin": 99338, "end": 99403, "idx": 645}, {"begin": 99404, "end": 99521, "idx": 646}, {"begin": 99539, "end": 99717, "idx": 647}, {"begin": 99718, "end": 100011, "idx": 648}, {"begin": 100012, "end": 100143, "idx": 649}, {"begin": 100144, "end": 100568, "idx": 650}, {"begin": 100569, "end": 100618, "idx": 651}, {"begin": 100619, "end": 100777, "idx": 652}, {"begin": 100778, "end": 100959, "idx": 653}, {"begin": 100960, "end": 101212, "idx": 654}, {"begin": 101213, "end": 101327, "idx": 655}, {"begin": 101328, "end": 101630, "idx": 656}, {"begin": 101631, "end": 101907, "idx": 657}, {"begin": 101908, "end": 102051, "idx": 658}, {"begin": 102052, "end": 102229, "idx": 659}, {"begin": 102230, "end": 102431, "idx": 660}, {"begin": 102432, "end": 102669, "idx": 661}, {"begin": 102670, "end": 102730, "idx": 662}, {"begin": 102731, "end": 102861, "idx": 663}, {"begin": 102862, "end": 103163, "idx": 664}, {"begin": 103164, "end": 103406, "idx": 665}, {"begin": 103407, "end": 103491, "idx": 666}, {"begin": 103492, "end": 103635, "idx": 667}, {"begin": 103636, "end": 103751, "idx": 668}, {"begin": 103752, "end": 103931, "idx": 669}, {"begin": 103932, "end": 104138, "idx": 670}, {"begin": 104139, "end": 104219, "idx": 671}, {"begin": 104220, "end": 104450, "idx": 672}, {"begin": 104451, "end": 104535, "idx": 673}, {"begin": 104536, "end": 104665, "idx": 674}, {"begin": 104666, "end": 105006, "idx": 675}, {"begin": 105007, "end": 105225, "idx": 676}, {"begin": 105226, "end": 105278, "idx": 677}, {"begin": 105279, "end": 105453, "idx": 678}, {"begin": 105454, "end": 105594, "idx": 679}, {"begin": 105595, "end": 105732, "idx": 680}, {"begin": 105733, "end": 105803, "idx": 681}, {"begin": 105804, "end": 105967, "idx": 682}, {"begin": 105968, "end": 106222, "idx": 683}, {"begin": 106223, "end": 106393, "idx": 684}, {"begin": 106394, "end": 106589, "idx": 685}, {"begin": 106590, "end": 106790, "idx": 686}, {"begin": 106791, "end": 107029, "idx": 687}, {"begin": 107030, "end": 107195, "idx": 688}, {"begin": 107196, "end": 107366, "idx": 689}, {"begin": 107367, "end": 107497, "idx": 690}, {"begin": 107498, "end": 107559, "idx": 691}, {"begin": 107575, "end": 107708, "idx": 692}, {"begin": 107709, "end": 107875, "idx": 693}, {"begin": 107876, "end": 107995, "idx": 694}, {"begin": 107996, "end": 108123, "idx": 695}, {"begin": 108124, "end": 108284, "idx": 696}, {"begin": 108313, "end": 108463, "idx": 697}, {"begin": 108479, "end": 108702, "idx": 698}, {"begin": 108703, "end": 109344, "idx": 699}, {"begin": 109345, "end": 109461, "idx": 700}, {"begin": 109462, "end": 109600, "idx": 701}, {"begin": 109601, "end": 109690, "idx": 702}, {"begin": 109691, "end": 109772, "idx": 703}, {"begin": 109773, "end": 109871, "idx": 704}, {"begin": 109872, "end": 110180, "idx": 705}, {"begin": 110181, "end": 110301, "idx": 706}, {"begin": 110302, "end": 110496, "idx": 707}, {"begin": 110497, "end": 110557, "idx": 708}, {"begin": 110571, "end": 110681, "idx": 709}, {"begin": 110682, "end": 110857, "idx": 710}, {"begin": 110858, "end": 111018, "idx": 711}, {"begin": 111019, "end": 111147, "idx": 712}, {"begin": 111148, "end": 111211, "idx": 713}, {"begin": 111212, "end": 111523, "idx": 714}, {"begin": 111534, "end": 111655, "idx": 715}, {"begin": 111656, "end": 111812, "idx": 716}, {"begin": 111813, "end": 111994, "idx": 717}, {"begin": 111995, "end": 112105, "idx": 718}, {"begin": 112106, "end": 112321, "idx": 719}, {"begin": 112322, "end": 112451, "idx": 720}, {"begin": 112452, "end": 112506, "idx": 721}, {"begin": 112507, "end": 112686, "idx": 722}, {"begin": 112687, "end": 112790, "idx": 723}, {"begin": 112791, "end": 112905, "idx": 724}, {"begin": 112906, "end": 112972, "idx": 725}, {"begin": 112973, "end": 113200, "idx": 726}, {"begin": 113201, "end": 113270, "idx": 727}, {"begin": 113271, "end": 113408, "idx": 728}, {"begin": 113409, "end": 113531, "idx": 729}, {"begin": 113549, "end": 113662, "idx": 730}, {"begin": 113663, "end": 113795, "idx": 731}, {"begin": 113796, "end": 113966, "idx": 732}, {"begin": 113967, "end": 114142, "idx": 733}, {"begin": 114143, "end": 114396, "idx": 734}, {"begin": 114397, "end": 114475, "idx": 735}, {"begin": 114476, "end": 114802, "idx": 736}, {"begin": 114803, "end": 114933, "idx": 737}, {"begin": 114948, "end": 115033, "idx": 738}, {"begin": 115034, "end": 115273, "idx": 739}, {"begin": 115274, "end": 115478, "idx": 740}, {"begin": 115479, "end": 115544, "idx": 741}, {"begin": 115554, "end": 115561, "idx": 742}, {"begin": 115587, "end": 115763, "idx": 743}, {"begin": 115764, "end": 115866, "idx": 744}, {"begin": 115890, "end": 116007, "idx": 745}, {"begin": 116008, "end": 116095, "idx": 746}, {"begin": 116096, "end": 116184, "idx": 747}, {"begin": 116185, "end": 116358, "idx": 748}, {"begin": 116359, "end": 116470, "idx": 749}, {"begin": 116471, "end": 116685, "idx": 750}, {"begin": 116686, "end": 116724, "idx": 751}, {"begin": 116725, "end": 116784, "idx": 752}, {"begin": 116785, "end": 116889, "idx": 753}, {"begin": 116890, "end": 117086, "idx": 754}, {"begin": 117087, "end": 117185, "idx": 755}, {"begin": 117186, "end": 117345, "idx": 756}, {"begin": 117346, "end": 117430, "idx": 757}, {"begin": 117431, "end": 117481, "idx": 758}, {"begin": 117482, "end": 117771, "idx": 759}, {"begin": 117772, "end": 117874, "idx": 760}, {"begin": 117875, "end": 118002, "idx": 761}, {"begin": 118003, "end": 118086, "idx": 762}, {"begin": 118120, "end": 118384, "idx": 763}, {"begin": 118385, "end": 118492, "idx": 764}, {"begin": 118493, "end": 118523, "idx": 765}, {"begin": 118524, "end": 118640, "idx": 766}, {"begin": 118641, "end": 118750, "idx": 767}, {"begin": 118751, "end": 118883, "idx": 768}, {"begin": 118884, "end": 119177, "idx": 769}, {"begin": 119178, "end": 119318, "idx": 770}, {"begin": 119319, "end": 119501, "idx": 771}, {"begin": 119502, "end": 119674, "idx": 772}, {"begin": 119675, "end": 119780, "idx": 773}, {"begin": 119781, "end": 119852, "idx": 774}, {"begin": 119853, "end": 119976, "idx": 775}, {"begin": 119977, "end": 120194, "idx": 776}, {"begin": 120233, "end": 120378, "idx": 777}, {"begin": 120379, "end": 120505, "idx": 778}, {"begin": 120537, "end": 120621, "idx": 779}, {"begin": 120622, "end": 120934, "idx": 780}, {"begin": 120935, "end": 121069, "idx": 781}, {"begin": 121070, "end": 121158, "idx": 782}, {"begin": 121159, "end": 121268, "idx": 783}, {"begin": 121269, "end": 121369, "idx": 784}, {"begin": 121370, "end": 121445, "idx": 785}, {"begin": 121446, "end": 121587, "idx": 786}, {"begin": 121588, "end": 121758, "idx": 787}, {"begin": 121795, "end": 122057, "idx": 788}, {"begin": 122058, "end": 122250, "idx": 789}, {"begin": 122251, "end": 122418, "idx": 790}, {"begin": 122419, "end": 122551, "idx": 791}, {"begin": 122552, "end": 122882, "idx": 792}, {"begin": 122883, "end": 123010, "idx": 793}, {"begin": 123011, "end": 123109, "idx": 794}, {"begin": 123110, "end": 123270, "idx": 795}, {"begin": 123271, "end": 123500, "idx": 796}, {"begin": 123501, "end": 123712, "idx": 797}, {"begin": 123713, "end": 123829, "idx": 798}, {"begin": 123830, "end": 123993, "idx": 799}, {"begin": 123994, "end": 124142, "idx": 800}, {"begin": 124143, "end": 124259, "idx": 801}, {"begin": 124295, "end": 124461, "idx": 802}, {"begin": 124462, "end": 124668, "idx": 803}, {"begin": 124669, "end": 124720, "idx": 804}, {"begin": 124721, "end": 124888, "idx": 805}, {"begin": 124889, "end": 125095, "idx": 806}, {"begin": 125096, "end": 125299, "idx": 807}, {"begin": 125300, "end": 125445, "idx": 808}, {"begin": 125446, "end": 125537, "idx": 809}, {"begin": 125538, "end": 125666, "idx": 810}, {"begin": 125667, "end": 125835, "idx": 811}, {"begin": 125836, "end": 126083, "idx": 812}, {"begin": 126084, "end": 126239, "idx": 813}, {"begin": 126240, "end": 126414, "idx": 814}, {"begin": 126437, "end": 126551, "idx": 815}, {"begin": 126552, "end": 126676, "idx": 816}, {"begin": 126677, "end": 126839, "idx": 817}, {"begin": 126840, "end": 126988, "idx": 818}, {"begin": 126989, "end": 127061, "idx": 819}, {"begin": 127062, "end": 127194, "idx": 820}, {"begin": 127195, "end": 127261, "idx": 821}, {"begin": 127301, "end": 127395, "idx": 822}, {"begin": 127396, "end": 127466, "idx": 823}, {"begin": 127467, "end": 127514, "idx": 824}], "ReferenceToFigure": [{"begin": 13852, "end": 13853, "target": "#fig_2", "idx": 0}, {"begin": 15128, "end": 15129, "target": "#fig_2", "idx": 1}, {"begin": 15947, "end": 15948, "target": "#fig_3", "idx": 2}, {"begin": 30414, "end": 30415, "idx": 3}, {"begin": 33951, "end": 33952, "idx": 4}, {"begin": 34773, "end": 34774, "idx": 5}, {"begin": 37316, "end": 37317, "idx": 6}, {"begin": 39887, "end": 39888, "idx": 7}, {"begin": 40838, "end": 40839, "idx": 8}, {"begin": 43013, "end": 43014, "target": "#fig_5", "idx": 9}, {"begin": 46027, "end": 46029, "target": "#fig_0", "idx": 10}, {"begin": 47400, "end": 47402, "target": "#fig_2", "idx": 11}, {"begin": 49204, "end": 49206, "target": "#fig_2", "idx": 12}, {"begin": 50202, "end": 50204, "target": "#fig_0", "idx": 13}, {"begin": 56122, "end": 56124, "target": "#fig_9", "idx": 14}, {"begin": 57141, "end": 57143, "target": "#fig_11", "idx": 15}, {"begin": 57701, "end": 57703, "target": "#fig_11", "idx": 16}, {"begin": 60040, "end": 60042, "target": "#fig_11", "idx": 17}, {"begin": 60532, "end": 60534, "target": "#fig_11", "idx": 18}, {"begin": 60762, "end": 60764, "target": "#fig_12", "idx": 19}, {"begin": 64449, "end": 64450, "idx": 20}, {"begin": 64513, "end": 64515, "target": "#fig_9", "idx": 21}, {"begin": 65868, "end": 65870, "target": "#fig_0", "idx": 22}, {"begin": 67997, "end": 67999, "target": "#fig_13", "idx": 23}, {"begin": 91197, "end": 91199, "target": "#fig_0", "idx": 24}, {"begin": 92854, "end": 92856, "target": "#fig_0", "idx": 25}, {"begin": 110554, "end": 110556, "target": "#fig_14", "idx": 26}, {"begin": 113793, "end": 113794, "target": "#fig_3", "idx": 27}, {"begin": 115030, "end": 115032, "target": "#fig_2", "idx": 28}, {"begin": 115760, "end": 115762, "target": "#fig_2", "idx": 29}, {"begin": 115797, "end": 115799, "target": "#fig_16", "idx": 30}], "Div": [{"begin": 81, "end": 1549, "idx": 0}, {"begin": 1552, "end": 9090, "idx": 1}, {"begin": 9092, "end": 9104, "idx": 2}, {"begin": 9106, "end": 11129, "idx": 3}, {"begin": 11131, "end": 12960, "idx": 4}, {"begin": 12962, "end": 17877, "idx": 5}, {"begin": 17879, "end": 20748, "idx": 6}, {"begin": 20750, "end": 22917, "idx": 7}, {"begin": 22919, "end": 22957, "idx": 8}, {"begin": 22959, "end": 28099, "idx": 9}, {"begin": 28101, "end": 29816, "idx": 10}, {"begin": 29818, "end": 34162, "idx": 11}, {"begin": 34164, "end": 43689, "idx": 12}, {"begin": 43691, "end": 51503, "idx": 13}, {"begin": 51505, "end": 62334, "idx": 14}, {"begin": 62336, "end": 66165, "idx": 15}, {"begin": 66167, "end": 71029, "idx": 16}, {"begin": 71031, "end": 77886, "idx": 17}, {"begin": 77888, "end": 80818, "idx": 18}, {"begin": 80820, "end": 80830, "idx": 19}, {"begin": 80832, "end": 92382, "idx": 20}, {"begin": 92384, "end": 98016, "idx": 21}, {"begin": 98018, "end": 99521, "idx": 22}, {"begin": 99523, "end": 107559, "idx": 23}, {"begin": 107561, "end": 108284, "idx": 24}, {"begin": 108286, "end": 108463, "idx": 25}, {"begin": 108465, "end": 110557, "idx": 26}, {"begin": 110559, "end": 111523, "idx": 27}, {"begin": 111525, "end": 113531, "idx": 28}, {"begin": 113533, "end": 114933, "idx": 29}, {"begin": 114935, "end": 115544, "idx": 30}, {"begin": 115546, "end": 115561, "idx": 31}, {"begin": 115563, "end": 115866, "idx": 32}, {"begin": 115868, "end": 118086, "idx": 33}, {"begin": 118088, "end": 120194, "idx": 34}, {"begin": 120196, "end": 120505, "idx": 35}, {"begin": 120507, "end": 121758, "idx": 36}, {"begin": 121760, "end": 124259, "idx": 37}, {"begin": 124261, "end": 126414, "idx": 38}, {"begin": 126416, "end": 127261, "idx": 39}, {"begin": 127263, "end": 127514, "idx": 40}], "SectionMain": [{"begin": 1549, "end": 127514, "idx": 0}]}}