{"text": "Re Co CoRD: Bridging the Gap between Human and Machine Commonsense Reading Comprehension\n\nAbstract:\nWe present a large-scale dataset, ReCoRD, for machine reading comprehension requiring commonsense reasoning. Experiments on this dataset demonstrate that the performance of state-of-the-art MRC systems fall far behind human performance. ReCoRD represents a challenge for future research to bridge the gap between human and machine commonsense reading comprehension. ReCoRD is available at http://nlp.jhu.edu/record.\n\n\n1 Introduction\nMachine reading comprehension (MRC) is a central task in natural language understanding, with techniques lately driven by a surge of large-scale datasets (Hermann et al., 2015; Hill et al., 2015; Rajpurkar et al., 2016; Trischler et al., 2017; Nguyen et al., 2016), usually formalized as a task of answering questions given a passage. An increasing number of analyses (Jia and Liang, 2017; Rajpurkar et al., 2018; Kaushik and Lipton, 2018) have revealed that a large portion of questions in these datasets can be answered by simply matching the patterns between the question and the answer sentence in the passage. While systems may match or even outperform humans on these datasets, our intuition suggests that there are at least some instances in human reading comprehension that require more than what existing challenge tasks are emphasizing. One primary type of questions these datasets lack are the ones that require reasoning over common sense or understanding across multiple sentences in the passage (Rajpurkar et al., 2016; Trischler et al., 2017).\nTo overcome this limitation, we introduce a large-scale dataset for reading comprehension, ReCoRD ([\"rEk@rd]), which consists of over 120,000 examples, most of which require * Work done when Sheng Zhang was visiting Microsoft.\n\nPassage (Cloze-style) Query\nAccording to claims in the suit, \"Parts of 'Stairway to Heaven,' instantly recognizable to the music fans across the world, sound almost identical to significant portions of 'X.'\"\n\nReference Answers\nTaurus (CNN) --A lawsuit has been filed claiming that the iconic Led Zeppelin song \"Stairway to Heaven\" was far from original. The suit, filed on May 31 in the United States District Court Eastern District of Pennsylvania, was brought by the estate of the late musician Randy California against the surviving members of Led Zeppelin and their record label. The copyright infringement case alleges that the Zeppelin song was taken from the single \"Taurus\" by the 1960s band Spirit, for whom California served as lead guitarist. \"Late in 1968, a then new band named Led Zeppelin began touring in the United States, opening for Spirit,\" the suit states. \"It was during this time that Jimmy Page, Led Zeppelin's guitarist, grew familiar with 'Taurus' and the rest of Spirit's catalog. Page stated in interviews that he found Spirit to be 'very good' and that the band's performances struck him 'on an emotional level.' \"\n• Suit claims similarities between two songs • Randy California was guitarist for the group Spirit • Jimmy Page has called the accusation \"ridiculous\" Figure 1 : An example from ReCoRD. The passage is a snippet from a news article followed by some bullet points which summarize the news event. Named entities highlighted in the passage are possible answers to the query. The query is a statement that is factually supported by the passage. X in the statement indicates a missing named entity. The goal is to find the correct entity in the passage that best fits X.\ndeep commonsense reasoning. ReCoRD is an acronym for the Reading Comprehension with Commonsense Reasoning Dataset.\nFigure 1 shows a ReCoRD example: the passage describes a lawsuit claiming that the band \"Led Zeppelin\" had plagiarized the song \"Taurus\" to their most iconic song, \"Stairway to Heaven\". The cloze-style query asks what does \"Stairway to Heaven\" sound similar to. To find the correct answer, we need to understand from the passage that \"a copyright infringement case alleges that 'Stairway to Heaven' was taken from 'Taurus'\", and from the bullet point that \"these two songs are claimed similar\". Then based on the commonsense knowledge that \"if two songs are claimed similar, it is likely that (parts of) these songs sound almost identical\", we can reasonably infer that the answer is \"Taurus\".\nDiffering from most of the existing MRC datasets, all queries and passages in ReCoRD are automatically mined from news articles, which maximally reduces the human elicitation bias (Gordon and Van Durme, 2013; Misra et al., 2016; Zhang et al., 2017), and the data collection method we propose is cost-efficient. Further analysis shows that a large portion of ReCoRD requires commonsense reasoning.\nExperiments on ReCoRD demonstrate that human readers are able to achieve a high performance at 91.69 F1, whereas the state-of-the-art MRC models fall far behind at 46.65 F1. Thus, ReCoRD presents a real challenge for future research to bridge the gap between human and machine commonsense reading comprehension.\n\n2 Task Motivation\nA program has common sense if it automatically deduces for itself a sufficiently wide class of immediate consequences of anything it is told and what it already knows. - McCarthy (1959) Commonsense Reasoning in MRC As illustrated by the example in Figure 1, the commonsense knowledge \"if two songs are claimed similar, it is likely that (parts of) these songs sound almost identica\" is not explicitly described in the passage, but is necessary to acquire in order to generate the answer. Human is able to infer the answer because the commonsense knowledge is commonly known by nearly all people. Our goal is to evaluate whether a machine is able to learn such knowledge. However, since commonsense knowledge is massive and mostly implicit, defining an explicit free-form evaluation is challenging (Levesque et al., 2011). Motivated by Mc-Carthy (1959), we instead evaluate a machine's ability of commonsense reasoning -a reasoning process requiring commonsense knowledge; that is, if a machine has common sense, it can deduce for itself the likely consequences or details of anything it is told and what it already knows rather than the unlikely ones. To formalize it in MRC, given a passage p (i.e., \"anything it is told\" and \"what it already knows\"), and a set of consequences or details C which are factually supported by the passage p with different likelihood, if a machine M has common sense, it can choose the most likely consequence or detail c * from C, i.e.,c * = arg max c∈C P (c | p, M).\n(1)\nTask Definition With the above discussion, we propose a specific task to evaluate a machine's ability of commonsense reasoning in MRC: as shown in Figure 1, given a passage p describing an event, a set of text spans E marked in p, and a cloze-style query Q(X) with a missing text span indicated by X, a machine M is expected to act like human, reading the passage p and then using its hidden commonsense knowledge to choose a text span e ∈ E that best fits X, i.e.,e * = arg max e∈E P (Q(e) | p, M).\nOnce the cloze-style query Q(X) is filled in by a text span e, the resulted statement Q(e) becomes a consequence or detail c as described in Equation (1), which is factually supported by the passage with certain likelihood.\n\n3 Data Collection\nWe describe the framework for automatically generating the dataset, ReCoRD, for our task defined in Equation ( 2), which consists of passages with text spans marked, cloze-style queries, and reference answers. We collect ReCoRD in four stages as shown in Figure 2: (1) curating CNN/Daily Mail news articles, (2) generating passage-queryanswers triples based on the news articles, (3) filtering out the queries that can be easily answered by state-of-the-art MRC models, and (4) filtering out the queries ambiguous to human readers.\n\n3.1 News Article Curation\nWe choose to create ReCoRD by exploiting news articles, because the structure of news makes it a good source for our task: normally, the first few paragraphs of a news article summarize the news event, which can be used to generate passages of the task; and the rest of the news article provides consequences or details of the news event, which can be used to generate queries of the task. In addition, news providers such as CNN and Daily Mail supplement their articles with a number of bullet points (Svore et al., 2007; Woodsend and Lapata, 2010; Hermann et al., 2015), which outline the highlights of the news and hence form a supplemental source for generating passages.\nWe first downloaded CNN and Daily Mail news articles using the script 1 provided by Hermann et al. (2015), and then sampled 148K articles from CNN and Daily Mail. In these articles, named entities and their coreference information have been annotated by a Google NLP pipeline, and will be used in the second stage of our data collection. Since these articles can be easily downloaded using the public script, we are concerned about potential cheating if using them as the source for generating the dev./test datasets. Therefore, we crawled additional 22K news articles from the CNN and Daily Mail websites. These crawled articles have no overlap with the articles used in Hermann et al. (2015). We then ran the stateof-the-art named entity recognition model (Peters et al., 2018) and the end-to-end coreference resolution model (Lee et al., 2017) provided by AllenNLP (Gardner et al., 2018) to annotate the crawled articles. Overall, we have collected 170K CNN/Daily Mail news articles with their named entities and coreference information annotated.\n1 https://github.com/deepmind/rc-data 3.2 Passage-Query-Answers Generation All passages, queries and answers in ReCoRD were automatically generated from the curated news articles. Figure 3 illustrates the generation process. (1) we split each news article into two parts as described in Section 3.1: the first few paragraphs which summarize the news event, and the rest of the news which provides the details or consequences of the news event. These two parts make a good source for generating passages and queries of our task respectively. (2) we enriched the first part of news article with the bullet points provided by the news editors. The first part of news article, together with the bullet points, is considered as a candidate passage. To ensure that the candidate passages are informative enough, we required the first part of news article to have at least 100 tokens and contain at least four different entities. (3) for each candidate passage, the second part of its corresponding news article was split into sentences by Stanford CoreNLP (Manning et al., 2014). Then we selected the sentences that satisfy the following conditions as potential details or consequences of the news event described by the passage:\n• Sentences should have at least 10 tokens, as longer sentences contain more information and thus are more likely to be inferrable details or consequences.\n• Sentences should not be questions, as we only consider details or consequences of a news event, not questions.\n• Sentences should not have 3-gram overlap with the corresponding passage, so they are less likely to be paraphrase of sentences in the passage.\n• Sentences should have at least one named entity, so that we can replace it with X to generate a cloze-style query.\n• All named entities in sentences should have precedents in the passage according to coreference, so that the sentences are not too disconnected from the passage, and the correct entity can be found in the passage to fill in X.\nFinally, we generated queries by replacing entities in the selected sentences with X. We only replaced one entity in the selected sentence each time, and generated one cloze-style query. Based on coreference, the precedents of the replaced en-\n\nSTORY HIGHLIGHTS\n• Suit claims similarity between two songs\n• Randy California was guitarist for the group Spirit\n• Jimmy Page has called the accusation \"ridiculous\"\n(CNN) --A lawsuit has been filed claiming that the iconic Led Zeppelin song \"Stairway to Heaven\" was far from original.\nThe suit, filed on May 31 in the United States District Court Eastern District of Pennsylvania, was brought by the estate of the late musician Randy California against the surviving members of Led Zeppelin and their record label. The copyright infringement case alleges that the Zeppelin song was taken from the single \"Taurus\" by the 1960s band Spirit, for whom California served as lead guitarist.\n\"Late in 1968, a then new band named Led Zeppelin began touring in the United States, opening for Spirit,\" the suit states. \"It was during this time that Jimmy Page, Led Zeppelin's guitarist, grew familiar with 'Taurus' and the rest of Spirit's catalog. Page stated in interviews that he found Spirit to be 'very good' and that the band's performances struck him 'on an emotional level.' \"\nOne of the causes of action for the suit is listed as \"Falsification of Rock N' Roll History\" and the typeface in the section headings of the filing resembles that used for Led Zeppelin album covers. According to claims in the suit, \"Parts of 'Stairway to Heaven,' instantly recognizable to the music fans across the world, sound almost identical to significant portions of 'Taurus.' \" …….\n\nPassage (Cloze-style) Query\nAccording to claims in the suit, \"Parts of 'Stairway to Heaven,' instantly recognizable to the music fans across the world, sound almost identical to significant portions of 'X.'\" The first few paragraphs and the bullet points of the news article summarize the news event.\n\nReference Answers\nThe rest of the news article provides details or concequences of the new event.\nThe hidden commonsense is used in comprehension of the underlined sentence (If two songs are claimed similar, it is likely that (parts of) these songs sound almost identical.) tity in the passage became reference answers to the query. The passage-query-answers generation process matched our task definition in Section 2, and therefore created queries that require some aspect of reasoning beyond immediate pattern matching. In total, we generated 770k (passage, query, answers) triples.\n\n3.3 Machine Filtering\nAs discussed in Jia and Liang (2017); Rajpurkar et al. (2018); Wang and Bansal (2018); Kaushik and Lipton (2018), existing MRC models mostly learn to predict the answer by simply paraphrasing questions into declarative forms, and then matching them with the sentences in the passages. To overcome this limitation, we filtered out triples whose queries can be easily answered by the stateof-the-art MRC architecture, Stochastic Answer Networks (SAN) (Liu et al., 2018). We choose SAN because it is competitive on existing MRC datasets, and it has components widely used in many MRC architectures such that low bias was anticipated in the filtering (which is confirmed by evaluation in Section 5). We used SAN to perform a five-fold cross validation on all 770k triples. The SAN models correctly answered 68% of these triples. We excluded those triples, and only kept 244k triples that could not be answered by SAN. These triples contain queries which could not be answered by simple paraphrasing, and other types of reasoning such as commonsense reasoning and multi-sentence reasoning are needed.\n\n3.4 Human Filtering\nSince the first three stages of data collection were fully automated, the resulted triples could be noisy and ambiguous to human readers. Therefore, we employed crowdworkers to validate these triples. We used Amazon Mechanical Turk for validation. Crowdworkers were required to: 1) have a 95% HIT acceptance rate, 2) a minimum of 50 HITs, 3) be located in the United States, Canada, or Great Britain, and 4) not be granted the qualification of poor quality (which we will explain later in this section). Workers were asked to spend at least 30 seconds on each assignment, and paid $3.6 per hour on average.\nFigure 4 shows the crowdsourcing web interface. Each HIT corresponds to a triple in our data collection. In each HIT assignment, we first showed the expandable instructions for first-time workers, to help them better understand our task (see the Appendix A.2). Then we presented workers with a passage in which the named entities are highlighted and clickable. After reading the passage, workers were given a supported statement with a placeholder (i.e., a cloze-style query) indicating a missing entity. Based on their understanding of the events that might be inferred from the passage, workers were asked to find the correct entity in the passage that best fits the placeholder. If workers thought the answer is not obvious, they were allowed to guess one, and were required to report that case in the feedback box. Workers were also encouraged to write other feedback. To ensure quality and prevent spamming, we used the reference answers in the triples to compute workers' average performance after every 1000 submissions. While there might be coreference or named entity recognition errors in the reference answers, as reported in Chen et al. (2016) (also confirmed by our analysis in Section 4), they only accounted for a very small portion of all the reference answers. Thus, the reference answers could be used for comparing workers' performance. Specifically, if a worker's performance was significantly lower than the average performance of all workers, we blocked the worker by granting the qualification of poor quality. In practice, workers were able to correctly answer about 50% of all queries. We blocked workers if their average accuracy was lower than 20%, and then republished their HIT assignments. Overall, 2,257 crowdworkers have participated in our task, and 51 of them have been granted the qualification of poor quality. Train / Dev. / Test Splits Among all the 244k triples collected from the third stage, we first obtained one worker answer for each triple. Compared to the reference answers, workers correctly answered queries in 122k triples. We then selected around 100k correctly-answered triples as the training set, restricting the origins of these triples to the news articles used in Hermann et al. (2015). As for the development and test sets, we solicited another worker answer to further ensure their quality. Therefore, each of the rest 22k triples has been validated by two workers. We only kept 20k triples that were correctly answered by both workers. The origins of these triples are either articles used in Hermann et al. (2015) or articles crawled by us (as described in Section 3.1), with a ratio of 3:7. Finally, we randomly split the 20k triples into development and test sets, with 10k triples for each set.\n\n4 Data Analysis\nReCoRD differs from other reading comprehension datasets due to its unique requirement for reasoning more than just paraphrasing. In this section, we provide a qualitative analysis of ReCoRD which highlights its unique features.\nReasoning Types We sampled 100 examples from the development set, and then manually categorized them into types shown in table 2. The results show that significantly different from existing datasets such as SQuAD (Rajpurkar et al., 2016), and NewsQA (Trischler et al., 2017), ReCoRD requires commonsense reasoning to answer 75% of queries. Owing to the machine filtering stage, only 3% queries could be answered by paraphrasing. The small percentage (6%) of ambiguous queries demonstrate the benefit of the human filtering stage. We also noticed that 10% queries can be answered through partial clues. As the example shows, some of partial clues were caused by the incompleteness of named entity recognition in the stage of news article curation.\nTypes of Commonsense Reasoning Formalizing the commonsense knowledge needed for even simple reasoning problems is a huge undertaking.\nBased on the observation of the sampled queries that required commonsense reasoning, we roughly categorized them into the following four coarsegained types:  Conceptual Knowledge: the presumed knowledge of properties of concepts (Miller, 1995; Liu and Singh, 2004; Pas ¸ca and Van Durme, 2008; Zhang et al., 2017).\nCausal Reasoning: the causal bridging inference invoked between two events, which is validated against common sense (Singer et al., 1992; Roemmele et al., 2011).\nNaïve Psychology: the predictable human mental states in reaction to events (Stich and Ravenscroft, 1994).\nOther: Other types of common sense, such as social norms, planning, spatial reasoning, etc. We annotated one or more types to each of these queries, and computed the percentage of them in these queries as shown in Table 3.\n\n5 Evaluation\nWe are interested in the performance of existing MRC architectures on ReCoRD. According to the task definition in Section 2, ReCoRD can be formalized as two types of machine reading comprehension (MRC) datasets: passages with clozestyle queries, or passages with queries whose answers are spans in the passage. Therefore, we can evaluate two types of MRC models on ReCoRD, and compare them with human performance. All the evaluation is carried out based on the train /dev. /test split as illustrated in Table 1.\n\n5.1 Methods\nDocQA 2 (Clark and Gardner, 2018) is a strong baseline model for queries with extractive answers. It consists of components such as bidirectional attention flow (Seo et al., 2016) and self attention which are widely used in MRC models. We also evaluate DocQA with ELMo (Peters et al., 2018) to analyze the impact of largely pretrained encoder on our dataset.  (Vaswani et al., 2017). Through QANet, we can evaluate the reasoning ability of transformer on our dataset. SAN 4 (Liu et al., 2018) is also a top-rank MRC model. It shares many components with DocQA, and employs a stochastic answer module. Since we used SAN to filter out easy queries in our data collection, it is necessary to verify that the queries we collect is hard for not only SAN but also other MRC architectures.\nASReader 5 (Kadlec et al., 2016) is a strong baseline model for cloze-style datasets such as (Her-mann et al., 2015; Hill et al., 2015). Unlike other baseline models which search among all text spans in the passage, ASReader directly predicts answers from the candidate named entities. Language Models 6 (LMs) (Trinh and Le, 2018) trained on large corpora recently achieved the state-of-the-art scores on the Winograd Schema Challenge (Levesque et al., 2011). Following in the same manner, we first concatenate the passage and the query together as a long sequence, and substitute X in the long sequence with each candidate entity; we use LMs to compute the probability of each resultant sequence and the substitution that results in the most probable sequence will be the predicted answer.\nRandom Guess acts as the lower bound of the evaluated models. It considers the queries in our dataset as cloze style, and randomly picks a candidate entity from the passage as the answer.\n\n5.2 Human Performance\nAs described in Section 3.4, we obtained two worker answers for each query in the development and test sets, and confirmed that each query has been correctly answered by two different workers.\nTo get human performance, we obtained an additional worker answer for each query, and compare it with the reference answers.\n\n5.3 Metrics\nWe use two evaluation metrics similar to those used by SQuAD (Rajpurkar et al., 2016). Both ignore punctuations and articles (e.g., a, an, the).\nExact Match (EM) measures the percentage of predictions that match any one of the reference answers exactly.\n(Macro-averaged) F1 measures the average overlap between the prediction and the reference answers. We treat the prediction and the reference answer as bags of tokens, and compute their F1. We take the maximum F1 over all of the reference answers for a given query, and then average over all of the queries.\n\n5.4 Results\nWe show the evaluation results in Table 4. Humans are able to get 91.31 EM and 91.69 F1 on the set, with similar results on the development set. In contrast, the best automatic method -DocQA with ELMo -achieves 45.44 EM and 46.65 F1 on the test set, illustrating a significant gap between human and machine reading comprehension on ReCoRD. All other methods without ELMo get EM/F1 scores significantly lower than DocQA with ELMo, which shows the positive impact of ELMo (see in Section 5.5). We also note that SAN leads to a result comparable with other strong baseline methods. This confirms that since SAN shares general components with many MRC models, using it to do machine filtering does help us filter out queries that are relatively easy to all the methods we evaluate. Finally, to our surprise, the unsupervised method (i.e., LM) which achieved the state-of-the-art scores on the Winograd Schema Challenge only leads to a result similar to the random guess baseline: a potential explanation is the lack of domain knowledge on our dataset. We leave this question for future work.\n\n5.5 Analysis\nHuman Errors About 8% dev./test queries have not been correctly answered in the human evaluation. We analyzed samples from these queries, and found that in most queries human was able to narrow down the set of possible candidate entities, but not able to find a unique answer. In many cases, two candidate entities equally fit X unless human has the specific background knowledge. We show an example in the Appendix A.1.\nFor the method analysis, we mainly analyzed the results of three representative methods: DocQA w/ ELMo, DocQA, and QANet. Impact of ELMo As shown in Figure 5, among all three methods the correct predictions of DocQA w/ ELMo have the largest overlap (92.6%) with the human predictions. As an ablation study, we analyzed queries which were only correctly answered after ELMo was added. We found that in some cases ELMo helped the prediction by incorporating the knowledge of language models. We show an example in the Appendix A.1.\nPredictions of QANet Figure 5 shows that QANet correctly answered some ambiguous queries, which we think was due to the randomness of parameter initialization and did not reflect the true reasoning ability. Since QANet uses the transformer-based encoder and DocQA uses the LSTM-based encoder, we see a significant difference of predictions between QANet and DocQA.\n\nMethod\nOOC Rate DocQA w/ ELMo 6.27% DocQA 6.37% QANet 6.41% Impact of Cloze-style Setting Except ASReader, all the MRC models were evaluated under the extractive setting, which means the information of candidate named entities was not used. Instead, extractive models searched answers from all possible text spans in passages. To show the potential benefit of using the candidate entities in these models, we computed the percentage of model predictions that could not be found in the candidate entities. As shown in Table 5, all three methods have about 6% OOC predictions. Making use of the candidate entities would potentially help them increase the performance by 6%.\nIn Section 4, we manually labeled 100 randomly sampled queries with different types of reasoning. In Figure 6 and 7, we show the performance of three analyzed methods on these queries. Figure 6 shows that three methods performed poorly on queries requiring commonsense reasoning, multi-sentence reasoning and partial clue.\nCompared to DocQA, QANet performed better on multi-sentence reasoning queries probably due to the use of transformer. Also, QANet outperformed DocQA on paraphrased queries probably because we used SAN to filtering queries and SAN has an architecture similar to DocQA. As we expect, ELMo improved the performance of DocQA on paraphrased queries. Among the 75% sampled queries that require commonsense reasoning, we see that ELMo significantly improved the performance of commonsense reasoning with presumed knowledge. For all other types of commonsense reasoning, all three methods have relatively poor performance.\n\n6 Related Datasets\nReCoRD relates to two strands of research in datasets: data for reading comprehension, and that for commonsense reasoning.\n\nReading Comprehension\nThe CNN/Daily Mail Corpus (Hermann et al., 2015), The Children's Book Test (CBT) (Hill et al., 2015), and LAM-BADA (Paperno et al., 2016) are closely related to ReCoRD: (1) The CNN/Daily Mail Corpus constructed queries from the bullet points, most of which required limited reasoning ability (Chen et al., 2016). ( 2) CBT is a collection of 21 consecutive sentences from book excerpts, with one word randomly removed from the last sentence. Since CBT has no machine or human filtering to ensure quality, only a small portion of the CBT examples really probes machines' ability to understand the context. (3) Built in a similar manner to CBT, LAMBADA was filtered to be humanguessable in the broader context only. Differing from ReCoRD, LAMBADA was designed to be a language modeling problem where contexts were not required to be event summaries, and answers were not necessarily in the context.\nSince all candidate answers were extracted from in the passage, ReCoRD can also be formalized as a extractive MRC dataset, similar to SQuAD (Rajpurkar et al., 2016) and NewsQA (Trischler et al., 2017). The difference is that questions in these datasets were curated from crowdworkers. Since it is hard to control the quality of crowdsourced questions, a large portion of questions in these datasets can be answered by word matching or paraphrasing (Jia and Liang, 2017; Rajpurkar et al., 2018; Wang and Bansal, 2018). There are other large-scale datasets (Nguyen et al., 2016; Joshi et al., 2017; Lai et al., 2017; Dunn et al., 2017; Kocisky et al., 2018; Reddy et al., 2018; Choi et al., 2018; Yang et al., 2018) targeting different aspects of reading comprehension. See (Gao et al., 2018) for a recent survey. Commonsense Reasoning ROCStories Corpus (Mostafazadeh et al., 2016), SWAG (Zellers et al., 2018), and The Winograd Schema Challenge (WSC) (Levesque et al., 2011) are related ReCoRD: (1) ROCStories assesses commonsense reasoning in story understanding by choosing the correct story ending from only two candidates. Stories in the corpus were all curated from crowdworkers, which could suffer from human elicitation bias (Gordon and Van Durme, 2013; Misra et al., 2016; Zhang et al., 2017).\n(2) SWAG unifies commonsense reasoning and natural language inference. It selects an ending from multiple choices which is most likely to be anticipated from the situation describe in the premise.\nThe counterfactual endings in SWAG were generated using language models with adversarial filtering. (3) WSC foucses on intra-sentential pronoun disambiguation problems that require commonsense reasoning. There are other datasets (Roemmele et al., 2011; Zhang et al., 2017; Rashkin et al., 2018a,b) targeting different aspects of commonsense reasoning.\n\n7 Conclusion\nWe introduced ReCoRD, a large-scale reading comprehension dataset requiring commonsense reasoning. Unlike existing machine reading comprehension (MRC) datasets, ReCoRD contains a large portion of queries that require commonsense reasoning to be answered. Our baselines, including top performers on existing MRC datasets, are no match for human competence on ReCoRD. We hope that ReCoRD will spur more research in MRC with commonsense reasoning.\n\nA Appendices\nA.1 Case Study Human Error Table 6 shows an example where the ambiguous query caused human error. The passage in this example describes \"ambiverts\", and there are two experts studying it: \"Vanessa Van Edwards\" and \"Adam Grant\". Both of them fit in the query asking who gave advice to ambiverts. There is no further information to help human choose a unique answer for this query.\nPassage: Your colleagues think you're quiet, but your friends think you're a party animal. If that sounds like you, then you may be what psychologists describe as an 'ambivert'. Scientists believe around two-thirds of people are ambiverts; a personality category that has, up until now, been given relatively little attention. 'Most people who are ambiverts have been told the wrong category their whole life,' Vanessa Van Edwards, an Orgeon-based behavioural expert, told DailyMail.com 'You hear extrovert and you hear introvert, and you think 'ugh, that's not me'.' Ambiversion is a label that has been around for some time, but gained popularity in 2013 with a paper in the journal Psychological Science, by Adam Grant the University of Pennsylvania.\n• Most ambiverts have been labelled incorrectly their whole life\n• They slide up and down personality spectrum depending on the situation\n• Ambiverts are good at gaining people's trust and making their point heard\n• They often feel pressure to mirror personality of the person they are with Query: 'Read each situation more carefully,' X advised ambiverts, 'and ask yourself, 'What do I need to do right now to be most happy or successful?\" Reference answers: Adam Grant Table 6 : An example illustrating a ambiguous query.\nImpact of ELMo Table 7 shows an example where DocQA w/ ELMo correctly answered but DocQA failed. The passage in this example describes a woman artist \"Sarah Milne\" who launched a public appeal to find a handsome stranger \"William Scott Chalmers\", and invited him to meet her. The query asks the missing information in the greetings from \"William Scott Chalmers\" when he went to meet \"Sarah Milne\".\nOur common sense about social norms tells us when two people meet each other for the first time, they are very likely to first introduce themselves.\nIn the query of this example, when Mr. Chalmers said \"Hello, I'm . . . \", it is very likely that he was introducing himself. Therefore, the name of Mr Chalmer fit X best.\nIn this example, the prediction of DocQA without ELMo is \"New Zealand\" which is not even close to the reference answer. The benefit of using ELMo in this example is that its language model will help exclude \"New Zealand\" from the likely candidate answers, because \"I'm . . . \" is usually followed by a person name rather than a location name. Such a pattern learnt by ELMo is useful in narrowing down candidiate answers in ReCoRD.\nPassage: A British backpacker who wrote a romantic note to locate a handsome stranger after spotting him on a New Zealand beach has finally met her Romeo for the first time. Sarah Milne, from Glasgow, left a handmade poster for the man, who she saw in Picton on Friday and described as 'shirtless, wearing black shorts with stars tattooed on his torso and running with a curly, bouncy and blonde dog'. In her note, entitled 'Is this you? ', she invited the mystery stranger to meet her on the same beach on Tuesday. But the message soon became a source of huge online interest with the identity of both the author and its intended target generating unexpected publicity.\n• Sarah Milne, a Glasgow artist, launched a public appeal to find the mystery man\n• She wrote a heart-warming message and drew a picture of him with his dog\n• She said she would return to the same spot in Picton, New Zealand, on Tuesday in search for him\n• William Scott Chalmers revealed himself as the man and went to meet her\n\nA.2 HIT Instructions\nWe show the instructions for Amazon Mechanical Turk HITs in Figure 8.\n\nFootnotes:\n2: https://github.com/allenai/ document-qa\n6: https://github.com/tensorflow/models/ tree/master/research/lm_commonsense\n\nReferences:\n\n- Danqi Chen, Jason Bolton, and Christopher D. Man- ning. 2016. A thorough examination of the cnn/daily mail reading comprehension task. In Pro- ceedings of the 54th Annual Meeting of the Associa- tion for Computational Linguistics (Volume 1: Long Papers), pages 2358-2367, Berlin, Germany. Asso- ciation for Computational Linguistics.- Eunsol Choi, He He, Mohit Iyyer, Mark Yatskar, Wen- tau Yih, Yejin Choi, Percy Liang, and Luke Zettle- moyer. 2018. Quac: Question answering in context. arXiv preprint arXiv:1808.07036.\n\n- Christopher Clark and Matt Gardner. 2018. Simple and effective multi-paragraph reading comprehen- sion. In Proceedings of the 56th Annual Meeting of the Association for Computational Linguistics (Vol- ume 1: Long Papers), pages 845-855. Association for Computational Linguistics.\n\n- Matthew Dunn, Levent Sagun, Mike Higgins, V Ugur Guney, Volkan Cirik, and Kyunghyun Cho. 2017. Searchqa: A new q&a dataset augmented with context from a search engine. arXiv preprint arXiv:1704.05179.\n\n- Jianfeng Gao, Michel Galley, and Lihong Li. 2018. Neural approaches to conversational ai. arXiv preprint arXiv:1809.08267.\n\n- Matt Gardner, Joel Grus, Mark Neumann, Oyvind Tafjord, Pradeep Dasigi, Nelson Liu, Matthew Pe- ters, Michael Schmitz, and Luke Zettlemoyer. 2018. Allennlp: A deep semantic natural language pro- cessing platform. arXiv preprint arXiv:1803.07640.\n\n- Jonathan Gordon and Benjamin Van Durme. 2013. Re- porting bias and knowledge acquisition. In Proceed- ings of the 2013 Workshop on Automated Knowledge Base Construction, AKBC '13, pages 25-30, New York, NY, USA. ACM.\n\n- Karl Moritz Hermann, Tomáš Kočiský, Edward Grefenstette, Lasse Espeholt, Will Kay, Mustafa Su- leyman, and Phil Blunsom. 2015. Teaching ma- chines to read and comprehend. In Advances in Neu- ral Information Processing Systems, pages 1693- 1701.\n\n- Felix Hill, Antoine Bordes, Sumit Chopra, and Jason Weston. 2015. The goldilocks principle: Reading children's books with explicit memory representa- tions. arXiv preprint arXiv:1511.02301.\n\n- Robin Jia and Percy Liang. 2017. Adversarial exam- ples for evaluating reading comprehension systems. In Proceedings of the 2017 Conference on Empiri- cal Methods in Natural Language Processing, pages 2021-2031, Copenhagen, Denmark. Association for Computational Linguistics.\n\n- Mandar Joshi, Eunsol Choi, Daniel Weld, and Luke Zettlemoyer. 2017. Triviaqa: A large scale distantly supervised challenge dataset for reading comprehen- sion. In Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics (Vol- ume 1: Long Papers), pages 1601-1611, Vancouver, Canada. Association for Computational Linguistics.\n\n- Rudolf Kadlec, Martin Schmid, Ondřej Bajgar, and Jan Kleindienst. 2016. Text understanding with the at- tention sum reader network. In Proceedings of the 54th Annual Meeting of the Association for Compu- tational Linguistics (Volume 1: Long Papers), pages 908-918. Association for Computational Linguis- tics.\n\n- Divyansh Kaushik and Zachary C. Lipton. 2018. How much reading does reading comprehension require? a critical investigation of popular benchmarks.\n\n- Tomas Kocisky, Jonathan Schwarz, Phil Blunsom, Chris Dyer, Karl Moritz Hermann, Gabor Melis, and Edward Grefenstette. 2018. The narrativeqa reading comprehension challenge. Transactions of the Asso- ciation for Computational Linguistics, 6:317-328.\n\n- Guokun Lai, Qizhe Xie, Hanxiao Liu, Yiming Yang, and Eduard Hovy. 2017. Race: Large-scale reading comprehension dataset from examinations. In Pro- ceedings of the 2017 Conference on Empirical Meth- ods in Natural Language Processing, pages 785- 794, Copenhagen, Denmark. Association for Com- putational Linguistics.\n\n- Kenton Lee, Luheng He, Mike Lewis, and Luke Zettle- moyer. 2017. End-to-end neural coreference reso- lution. In Proceedings of the 2017 Conference on Empirical Methods in Natural Language Process- ing, pages 188-197, Copenhagen, Denmark. Asso- ciation for Computational Linguistics.\n\n- Hector J Levesque, Ernest Davis, and Leora Morgen- stern. 2011. The winograd schema challenge. In Aaai spring symposium: Logical formalizations of commonsense reasoning.\n\n- H. Liu and P. Singh. 2004. Conceptnet &mdash; a practical commonsense reasoning tool-kit. BT Tech- nology Journal, 22(4):211-226.\n\n- Xiaodong Liu, Yelong Shen, Kevin Duh, and Jianfeng Gao. 2018. Stochastic answer networks for ma- chine reading comprehension. In Proceedings of the 56th Annual Meeting of the Association for Compu- tational Linguistics (Volume 1: Long Papers), pages 1694-1704. Association for Computational Linguis- tics.\n\n- Christopher D. Manning, Mihai Surdeanu, John Bauer, Jenny Finkel, Steven J. Bethard, and David Mc- Closky. 2014. The Stanford CoreNLP natural lan- guage processing toolkit. In Association for Compu- tational Linguistics (ACL) System Demonstrations, pages 55-60.\n\n- John McCarthy. 1959. Programs with common sense. In Proceedings of the Teddington Conference on the Mechanization of Thought Processes, London: Her Majesty's Stationery Office.\n\n- George A. Miller. 1995. Wordnet: A lexical database for english. Commun. ACM, 38(11):39-41.\n\n- Ishan Misra, C Lawrence Zitnick, Margaret Mitchell, and Ross Girshick. 2016. Seeing through the human reporting bias: Visual classifiers from noisy human- centric labels. In Proceedings of the IEEE Confer- ence on Computer Vision and Pattern Recognition, pages 2930-2939.\n\n- Nasrin Mostafazadeh, Nathanael Chambers, Xiaodong He, Devi Parikh, Dhruv Batra, Lucy Vanderwende, Pushmeet Kohli, and James Allen. 2016. A cor- pus and cloze evaluation for deeper understanding of commonsense stories. In Proceedings of the 2016 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, pages 839-849, San Diego, California. Association for Computational Linguis- tics.\n\n- Tri Nguyen, Mir Rosenberg, Xia Song, Jianfeng Gao, Saurabh Tiwary, Rangan Majumder, and Li Deng. 2016. Ms marco: A human generated machine reading comprehension dataset. arXiv preprint arXiv:1611.09268.\n\n- Denis Paperno, Germán Kruszewski, Angeliki Lazari- dou, Ngoc Quan Pham, Raffaella Bernardi, San- dro Pezzelle, Marco Baroni, Gemma Boleda, and Raquel Fernandez. 2016. The lambada dataset: Word prediction requiring a broad discourse context. In Proceedings of the 54th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers), pages 1525-1534. Association for Computational Linguistics.\n\n- Marius Pas ¸ca and Benjamin Van Durme. 2008. Weakly-supervised acquisition of open-domain classes and class attributes from web documents and query logs. In Proceedings of ACL-08: HLT, pages 19-27. Association for Computational Linguistics.\n\n- Matthew Peters, Mark Neumann, Mohit Iyyer, Matt Gardner, Christopher Clark, Kenton Lee, and Luke Zettlemoyer. 2018. Deep contextualized word repre- sentations. In Proceedings of the 2018 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 1 (Long Papers), pages 2227- 2237. Association for Computational Linguistics.\n\n- Pranav Rajpurkar, Robin Jia, and Percy Liang. 2018. Know what you don't know: Unanswerable ques- tions for squad. In Proceedings of the 56th Annual Meeting of the Association for Computational Lin- guistics (Volume 2: Short Papers), pages 784-789. Association for Computational Linguistics.\n\n- Pranav Rajpurkar, Jian Zhang, Konstantin Lopyrev, and Percy Liang. 2016. Squad: 100,000+ questions for machine comprehension of text. In Proceedings of the 2016 Conference on Empirical Methods in Natu- ral Language Processing, pages 2383-2392, Austin, Texas. Association for Computational Linguistics.\n\n- Hannah Rashkin, Antoine Bosselut, Maarten Sap, Kevin Knight, and Yejin Choi. 2018a. Modeling naive psychology of characters in simple common- sense stories. In Proceedings of the 56th Annual Meeting of the Association for Computational Lin- guistics (Volume 1: Long Papers), pages 2289- 2299. Association for Computational Linguistics.\n\n- Hannah Rashkin, Maarten Sap, Emily Allaway, Noah A. Smith, and Yejin Choi. 2018b. Event2mind: Commonsense inference on events, intents, and reactions. In Proceedings of the 56th Annual Meeting of the Association for Compu- tational Linguistics (Volume 1: Long Papers), pages 463-473. Association for Computational Linguistics.\n\n- Siva Reddy, Danqi Chen, and Christopher D Manning. 2018. Coqa: A conversational question answering challenge. arXiv preprint arXiv:1808.07042.\n\n- Melissa Roemmele, Cosmin Adrian Bejan, and An- drew S Gordon. 2011. Choice of plausible alterna- tives: An evaluation of commonsense causal reason- ing. In AAAI Spring Symposium: Logical Formal- izations of Commonsense Reasoning, pages 90-95.\n\n- Minjoon Seo, Aniruddha Kembhavi, Ali Farhadi, and Hannaneh Hajishirzi. 2016. Bidirectional attention flow for machine comprehension. arXiv preprint arXiv:1611.01603.\n\n- Murray Singer, Michael Halldorson, Jeffrey C Lear, and Peter Andrusiak. 1992. Validation of causal bridging inferences in discourse understanding. Journal of Memory and Language, 31(4):507 -524.\n\n- Stephen Stich and Ian Ravenscroft. 1994. What is folk psychology? Cognition, 50(1-3):447-468.\n\n- Krysta Svore, Lucy Vanderwende, and Christopher Burges. 2007. Enhancing single-document sum- marization by combining RankNet and third-party sources. In Proceedings of the 2007 Joint Con- ference on Empirical Methods in Natural Lan- guage Processing and Computational Natural Lan- guage Learning (EMNLP-CoNLL), pages 448-457, Prague, Czech Republic. Association for Computa- tional Linguistics.\n\n- Trieu H Trinh and Quoc V Le. 2018. A simple method for commonsense reasoning. arXiv preprint arXiv:1806.02847.\n\n- Adam Trischler, Tong Wang, Xingdi Yuan, Justin Har- ris, Alessandro Sordoni, Philip Bachman, and Ka- heer Suleman. 2017. Newsqa: A machine compre- hension dataset. In Proceedings of the 2nd Work- shop on Representation Learning for NLP, pages 191-200, Vancouver, Canada. Association for Com- putational Linguistics.\n\n- Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N Gomez, Łukasz Kaiser, and Illia Polosukhin. 2017. Attention is all you need. In Advances in Neural Information Pro- cessing Systems, pages 5998-6008.\n\n- Yicheng Wang and Mohit Bansal. 2018. Robust ma- chine comprehension models via adversarial train- ing. In Proceedings of the 2018 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Tech- nologies, Volume 2 (Short Papers), pages 575-581. Association for Computational Linguistics.\n\n- Kristian Woodsend and Mirella Lapata. 2010. Auto- matic generation of story highlights. In Proceed- ings of the 48th Annual Meeting of the Association for Computational Linguistics, pages 565-574, Up- psala, Sweden. Association for Computational Lin- guistics.\n\n- Zhilin Yang, Peng Qi, Saizheng Zhang, Yoshua Ben- gio, William W. Cohen, Ruslan Salakhutdinov, and Christopher D. Manning. 2018. HotpotQA: A dataset for diverse, explainable multi-hop question answering. In Proceedings of the Conference on Empirical Methods in Natural Language Processing (EMNLP).\n\n- Adams Wei Yu, David Dohan, Minh-Thang Luong, Rui Zhao, Kai Chen, Mohammad Norouzi, and Quoc V Le. 2018. Qanet: Combining local convolution with global self-attention for reading comprehen- sion. arXiv preprint arXiv:1804.09541.\n\n- Rowan Zellers, Yonatan Bisk, Roy Schwartz, and Yejin Choi. 2018. Swag: A large-scale adversarial dataset for grounded commonsense inference. In Proceed- ings of the 2018 Conference on Empirical Methods in Natural Language Processing (EMNLP).\n\n- Sheng Zhang, Rachel Rudinger, Kevin Duh, and Ben- jamin Van Durme. 2017. Ordinal common-sense in- ference. Transactions of the Association for Com- putational Linguistics, 5:379-395.\n\n", "annotations": {"Abstract": [{"begin": 90, "end": 515, "idx": 0}], "Head": [{"begin": 518, "end": 532, "n": "1", "idx": 0}, {"begin": 1820, "end": 1847, "idx": 1}, {"begin": 2029, "end": 2046, "idx": 2}, {"begin": 5048, "end": 5065, "n": "2", "idx": 3}, {"begin": 7295, "end": 7312, "n": "3", "idx": 4}, {"begin": 7846, "end": 7871, "n": "3.1", "idx": 5}, {"begin": 11827, "end": 11843, "idx": 6}, {"begin": 13294, "end": 13321, "idx": 7}, {"begin": 13596, "end": 13613, "idx": 8}, {"begin": 14183, "end": 14204, "n": "3.3", "idx": 9}, {"begin": 15302, "end": 15321, "n": "3.4", "idx": 10}, {"begin": 18688, "end": 18703, "n": "4", "idx": 11}, {"begin": 20622, "end": 20634, "n": "5", "idx": 12}, {"begin": 21148, "end": 21159, "n": "5.1", "idx": 13}, {"begin": 22923, "end": 22944, "n": "5.2", "idx": 14}, {"begin": 23264, "end": 23275, "n": "5.3", "idx": 15}, {"begin": 23838, "end": 23849, "n": "5.4", "idx": 16}, {"begin": 24939, "end": 24951, "n": "5.5", "idx": 17}, {"begin": 26269, "end": 26275, "idx": 18}, {"begin": 27880, "end": 27898, "n": "6", "idx": 19}, {"begin": 28023, "end": 28044, "idx": 20}, {"begin": 30792, "end": 30804, "n": "7", "idx": 21}, {"begin": 31251, "end": 31263, "idx": 22}, {"begin": 35072, "end": 35092, "idx": 23}], "ReferenceToBib": [{"begin": 687, "end": 709, "target": "#b7", "idx": 0}, {"begin": 710, "end": 728, "target": "#b8", "idx": 1}, {"begin": 729, "end": 752, "target": "#b29", "idx": 2}, {"begin": 753, "end": 776, "target": "#b39", "idx": 3}, {"begin": 777, "end": 797, "target": "#b24", "idx": 4}, {"begin": 901, "end": 922, "target": "#b9", "idx": 5}, {"begin": 923, "end": 946, "target": "#b28", "idx": 6}, {"begin": 947, "end": 972, "target": "#b12", "idx": 7}, {"begin": 1542, "end": 1566, "target": "#b29", "idx": 8}, {"begin": 1567, "end": 1590, "target": "#b39", "idx": 9}, {"begin": 4518, "end": 4546, "target": "#b6", "idx": 10}, {"begin": 4547, "end": 4566, "target": "#b22", "idx": 11}, {"begin": 4567, "end": 4586, "target": "#b46", "idx": 12}, {"begin": 5236, "end": 5251, "target": "#b20", "idx": 13}, {"begin": 5863, "end": 5886, "target": "#b16", "idx": 14}, {"begin": 5901, "end": 5917, "idx": 15}, {"begin": 8374, "end": 8394, "target": "#b37", "idx": 16}, {"begin": 8395, "end": 8421, "target": "#b42", "idx": 17}, {"begin": 8422, "end": 8443, "target": "#b7", "idx": 18}, {"begin": 8632, "end": 8653, "target": "#b7", "idx": 19}, {"begin": 9220, "end": 9241, "target": "#b7", "idx": 20}, {"begin": 9306, "end": 9327, "target": "#b27", "idx": 21}, {"begin": 9376, "end": 9394, "target": "#b15", "idx": 22}, {"begin": 9416, "end": 9438, "target": "#b5", "idx": 23}, {"begin": 10649, "end": 10671, "target": "#b19", "idx": 24}, {"begin": 14243, "end": 14266, "target": "#b28", "idx": 25}, {"begin": 14268, "end": 14290, "target": "#b41", "idx": 26}, {"begin": 14292, "end": 14317, "target": "#b12", "idx": 27}, {"begin": 14654, "end": 14672, "target": "#b18", "idx": 28}, {"begin": 17066, "end": 17084, "target": "#b0", "idx": 29}, {"begin": 18164, "end": 18170, "idx": 30}, {"begin": 18481, "end": 18502, "target": "#b7", "idx": 31}, {"begin": 19146, "end": 19170, "target": "#b29", "idx": 32}, {"begin": 19183, "end": 19207, "target": "#b39", "idx": 33}, {"begin": 20043, "end": 20057, "target": "#b21", "idx": 34}, {"begin": 20058, "end": 20078, "target": "#b17", "idx": 35}, {"begin": 20079, "end": 20107, "target": "#b26", "idx": 36}, {"begin": 20108, "end": 20127, "target": "#b46", "idx": 37}, {"begin": 20245, "end": 20266, "target": "#b35", "idx": 38}, {"begin": 20267, "end": 20289, "target": "#b33", "idx": 39}, {"begin": 20367, "end": 20396, "target": "#b36", "idx": 40}, {"begin": 21321, "end": 21339, "target": "#b34", "idx": 41}, {"begin": 21429, "end": 21450, "target": "#b27", "idx": 42}, {"begin": 21520, "end": 21542, "target": "#b40", "idx": 43}, {"begin": 21634, "end": 21652, "target": "#b18", "idx": 44}, {"begin": 21954, "end": 21974, "target": "#b11", "idx": 45}, {"begin": 22036, "end": 22059, "idx": 46}, {"begin": 22060, "end": 22078, "target": "#b8", "idx": 47}, {"begin": 22253, "end": 22273, "target": "#b38", "idx": 48}, {"begin": 22378, "end": 22401, "target": "#b16", "idx": 49}, {"begin": 23337, "end": 23361, "target": "#b29", "idx": 50}, {"begin": 28071, "end": 28093, "target": "#b7", "idx": 51}, {"begin": 28126, "end": 28145, "target": "#b8", "idx": 52}, {"begin": 28160, "end": 28182, "target": "#b25", "idx": 53}, {"begin": 28337, "end": 28356, "target": "#b0", "idx": 54}, {"begin": 29081, "end": 29105, "target": "#b29", "idx": 55}, {"begin": 29117, "end": 29141, "target": "#b39", "idx": 56}, {"begin": 29389, "end": 29410, "target": "#b9", "idx": 57}, {"begin": 29411, "end": 29434, "target": "#b28", "idx": 58}, {"begin": 29435, "end": 29457, "target": "#b41", "idx": 59}, {"begin": 29496, "end": 29517, "target": "#b24", "idx": 60}, {"begin": 29518, "end": 29537, "target": "#b10", "idx": 61}, {"begin": 29538, "end": 29555, "target": "#b14", "idx": 62}, {"begin": 29556, "end": 29574, "target": "#b3", "idx": 63}, {"begin": 29575, "end": 29596, "target": "#b13", "idx": 64}, {"begin": 29597, "end": 29616, "target": "#b32", "idx": 65}, {"begin": 29617, "end": 29635, "target": "#b1", "idx": 66}, {"begin": 29636, "end": 29654, "target": "#b43", "idx": 67}, {"begin": 29713, "end": 29731, "target": "#b4", "idx": 68}, {"begin": 29793, "end": 29820, "target": "#b23", "idx": 69}, {"begin": 29827, "end": 29849, "target": "#b45", "idx": 70}, {"begin": 29891, "end": 29914, "target": "#b16", "idx": 71}, {"begin": 30172, "end": 30200, "target": "#b6", "idx": 72}, {"begin": 30201, "end": 30220, "target": "#b22", "idx": 73}, {"begin": 30221, "end": 30240, "target": "#b46", "idx": 74}, {"begin": 30668, "end": 30691, "target": "#b33", "idx": 75}, {"begin": 30692, "end": 30711, "target": "#b46", "idx": 76}, {"begin": 30712, "end": 30736, "idx": 77}], "ReferenceToFootnote": [{"begin": 21166, "end": 21167, "target": "#foot_0", "idx": 0}, {"begin": 22245, "end": 22246, "target": "#foot_1", "idx": 1}], "SectionFootnote": [{"begin": 35164, "end": 35294, "idx": 0}], "ReferenceString": [{"begin": 35311, "end": 35644, "id": "b0", "idx": 0}, {"begin": 35646, "end": 35831, "id": "b1", "idx": 1}, {"begin": 35835, "end": 36114, "id": "b2", "idx": 2}, {"begin": 36118, "end": 36318, "id": "b3", "idx": 3}, {"begin": 36322, "end": 36444, "id": "b4", "idx": 4}, {"begin": 36448, "end": 36692, "id": "b5", "idx": 5}, {"begin": 36696, "end": 36912, "id": "b6", "idx": 6}, {"begin": 36916, "end": 37160, "id": "b7", "idx": 7}, {"begin": 37164, "end": 37353, "id": "b8", "idx": 8}, {"begin": 37357, "end": 37632, "id": "b9", "idx": 9}, {"begin": 37636, "end": 37992, "id": "b10", "idx": 10}, {"begin": 37996, "end": 38305, "id": "b11", "idx": 11}, {"begin": 38309, "end": 38455, "id": "b12", "idx": 12}, {"begin": 38459, "end": 38707, "id": "b13", "idx": 13}, {"begin": 38711, "end": 39026, "id": "b14", "idx": 14}, {"begin": 39030, "end": 39312, "id": "b15", "idx": 15}, {"begin": 39316, "end": 39485, "id": "b16", "idx": 16}, {"begin": 39489, "end": 39618, "id": "b17", "idx": 17}, {"begin": 39622, "end": 39927, "id": "b18", "idx": 18}, {"begin": 39931, "end": 40192, "id": "b19", "idx": 19}, {"begin": 40196, "end": 40372, "id": "b20", "idx": 20}, {"begin": 40376, "end": 40467, "id": "b21", "idx": 21}, {"begin": 40471, "end": 40742, "id": "b22", "idx": 22}, {"begin": 40746, "end": 41193, "id": "b23", "idx": 23}, {"begin": 41197, "end": 41399, "id": "b24", "idx": 24}, {"begin": 41403, "end": 41819, "id": "b25", "idx": 25}, {"begin": 41823, "end": 42063, "id": "b26", "idx": 26}, {"begin": 42067, "end": 42458, "id": "b27", "idx": 27}, {"begin": 42462, "end": 42752, "id": "b28", "idx": 28}, {"begin": 42756, "end": 43057, "id": "b29", "idx": 29}, {"begin": 43061, "end": 43396, "id": "b30", "idx": 30}, {"begin": 43400, "end": 43726, "id": "b31", "idx": 31}, {"begin": 43730, "end": 43872, "id": "b32", "idx": 32}, {"begin": 43876, "end": 44118, "id": "b33", "idx": 33}, {"begin": 44122, "end": 44287, "id": "b34", "idx": 34}, {"begin": 44291, "end": 44485, "id": "b35", "idx": 35}, {"begin": 44489, "end": 44582, "id": "b36", "idx": 36}, {"begin": 44586, "end": 44980, "id": "b37", "idx": 37}, {"begin": 44984, "end": 45094, "id": "b38", "idx": 38}, {"begin": 45098, "end": 45413, "id": "b39", "idx": 39}, {"begin": 45417, "end": 45647, "id": "b40", "idx": 40}, {"begin": 45651, "end": 45985, "id": "b41", "idx": 41}, {"begin": 45989, "end": 46249, "id": "b42", "idx": 42}, {"begin": 46253, "end": 46550, "id": "b43", "idx": 43}, {"begin": 46554, "end": 46781, "id": "b44", "idx": 44}, {"begin": 46785, "end": 47026, "id": "b45", "idx": 45}, {"begin": 47030, "end": 47212, "id": "b46", "idx": 46}], "ReferenceToTable": [{"begin": 20618, "end": 20619, "target": "#tab_4", "idx": 0}, {"begin": 21144, "end": 21145, "target": "#tab_0", "idx": 1}, {"begin": 23890, "end": 23891, "target": "#tab_5", "idx": 2}, {"begin": 26792, "end": 26793, "target": "#tab_6", "idx": 3}, {"begin": 31297, "end": 31298, "idx": 4}, {"begin": 32875, "end": 32876, "idx": 5}, {"begin": 32943, "end": 32944, "target": "#tab_8", "idx": 6}], "Footnote": [{"begin": 35175, "end": 35217, "id": "foot_0", "n": "2", "idx": 0}, {"begin": 35218, "end": 35294, "id": "foot_1", "n": "6", "idx": 1}], "ReferenceToFormula": [{"begin": 7424, "end": 7425, "target": "#formula_1", "idx": 0}, {"begin": 28360, "end": 28361, "target": "#formula_1", "idx": 1}], "Paragraph": [{"begin": 100, "end": 515, "idx": 0}, {"begin": 533, "end": 1591, "idx": 1}, {"begin": 1592, "end": 1818, "idx": 2}, {"begin": 1848, "end": 2027, "idx": 3}, {"begin": 2047, "end": 2963, "idx": 4}, {"begin": 2964, "end": 3528, "idx": 5}, {"begin": 3529, "end": 3643, "idx": 6}, {"begin": 3644, "end": 4337, "idx": 7}, {"begin": 4338, "end": 4734, "idx": 8}, {"begin": 4735, "end": 5046, "idx": 9}, {"begin": 5066, "end": 6534, "idx": 10}, {"begin": 6566, "end": 6569, "idx": 11}, {"begin": 6570, "end": 7035, "idx": 12}, {"begin": 7070, "end": 7293, "idx": 13}, {"begin": 7313, "end": 7844, "idx": 14}, {"begin": 7872, "end": 8547, "idx": 15}, {"begin": 8548, "end": 9598, "idx": 16}, {"begin": 9599, "end": 10822, "idx": 17}, {"begin": 10823, "end": 10978, "idx": 18}, {"begin": 10979, "end": 11091, "idx": 19}, {"begin": 11092, "end": 11236, "idx": 20}, {"begin": 11237, "end": 11353, "idx": 21}, {"begin": 11354, "end": 11581, "idx": 22}, {"begin": 11582, "end": 11825, "idx": 23}, {"begin": 11844, "end": 11886, "idx": 24}, {"begin": 11887, "end": 11940, "idx": 25}, {"begin": 11941, "end": 11992, "idx": 26}, {"begin": 11993, "end": 12112, "idx": 27}, {"begin": 12113, "end": 12512, "idx": 28}, {"begin": 12513, "end": 12902, "idx": 29}, {"begin": 12903, "end": 13292, "idx": 30}, {"begin": 13322, "end": 13594, "idx": 31}, {"begin": 13614, "end": 13693, "idx": 32}, {"begin": 13694, "end": 14181, "idx": 33}, {"begin": 14205, "end": 15300, "idx": 34}, {"begin": 15322, "end": 15928, "idx": 35}, {"begin": 15929, "end": 18686, "idx": 36}, {"begin": 18704, "end": 18932, "idx": 37}, {"begin": 18933, "end": 19679, "idx": 38}, {"begin": 19680, "end": 19813, "idx": 39}, {"begin": 19814, "end": 20128, "idx": 40}, {"begin": 20129, "end": 20290, "idx": 41}, {"begin": 20291, "end": 20397, "idx": 42}, {"begin": 20398, "end": 20620, "idx": 43}, {"begin": 20635, "end": 21146, "idx": 44}, {"begin": 21160, "end": 21942, "idx": 45}, {"begin": 21943, "end": 22733, "idx": 46}, {"begin": 22734, "end": 22921, "idx": 47}, {"begin": 22945, "end": 23137, "idx": 48}, {"begin": 23138, "end": 23262, "idx": 49}, {"begin": 23276, "end": 23420, "idx": 50}, {"begin": 23421, "end": 23529, "idx": 51}, {"begin": 23530, "end": 23836, "idx": 52}, {"begin": 23850, "end": 24937, "idx": 53}, {"begin": 24952, "end": 25372, "idx": 54}, {"begin": 25373, "end": 25902, "idx": 55}, {"begin": 25903, "end": 26267, "idx": 56}, {"begin": 26276, "end": 26940, "idx": 57}, {"begin": 26941, "end": 27263, "idx": 58}, {"begin": 27264, "end": 27878, "idx": 59}, {"begin": 27899, "end": 28021, "idx": 60}, {"begin": 28045, "end": 28940, "idx": 61}, {"begin": 28941, "end": 30241, "idx": 62}, {"begin": 30242, "end": 30438, "idx": 63}, {"begin": 30439, "end": 30790, "idx": 64}, {"begin": 30805, "end": 31249, "idx": 65}, {"begin": 31264, "end": 31643, "idx": 66}, {"begin": 31644, "end": 32397, "idx": 67}, {"begin": 32398, "end": 32462, "idx": 68}, {"begin": 32463, "end": 32535, "idx": 69}, {"begin": 32536, "end": 32611, "idx": 70}, {"begin": 32612, "end": 32921, "idx": 71}, {"begin": 32922, "end": 33319, "idx": 72}, {"begin": 33320, "end": 33468, "idx": 73}, {"begin": 33469, "end": 33639, "idx": 74}, {"begin": 33640, "end": 34070, "idx": 75}, {"begin": 34071, "end": 34741, "idx": 76}, {"begin": 34742, "end": 34823, "idx": 77}, {"begin": 34824, "end": 34898, "idx": 78}, {"begin": 34899, "end": 34996, "idx": 79}, {"begin": 34997, "end": 35070, "idx": 80}, {"begin": 35093, "end": 35162, "idx": 81}], "SectionHeader": [{"begin": 0, "end": 515, "idx": 0}], "SectionReference": [{"begin": 35296, "end": 47214, "idx": 0}], "Sentence": [{"begin": 100, "end": 208, "idx": 0}, {"begin": 209, "end": 336, "idx": 1}, {"begin": 337, "end": 465, "idx": 2}, {"begin": 466, "end": 515, "idx": 3}, {"begin": 533, "end": 867, "idx": 4}, {"begin": 868, "end": 1147, "idx": 5}, {"begin": 1148, "end": 1379, "idx": 6}, {"begin": 1380, "end": 1591, "idx": 7}, {"begin": 1592, "end": 1818, "idx": 8}, {"begin": 1848, "end": 2027, "idx": 9}, {"begin": 2047, "end": 2173, "idx": 10}, {"begin": 2174, "end": 2403, "idx": 11}, {"begin": 2404, "end": 2573, "idx": 12}, {"begin": 2574, "end": 2697, "idx": 13}, {"begin": 2698, "end": 2827, "idx": 14}, {"begin": 2828, "end": 2963, "idx": 15}, {"begin": 2964, "end": 3149, "idx": 16}, {"begin": 3150, "end": 3257, "idx": 17}, {"begin": 3258, "end": 3334, "idx": 18}, {"begin": 3335, "end": 3403, "idx": 19}, {"begin": 3404, "end": 3456, "idx": 20}, {"begin": 3457, "end": 3528, "idx": 21}, {"begin": 3529, "end": 3556, "idx": 22}, {"begin": 3557, "end": 3643, "idx": 23}, {"begin": 3644, "end": 3829, "idx": 24}, {"begin": 3830, "end": 3905, "idx": 25}, {"begin": 3906, "end": 4138, "idx": 26}, {"begin": 4139, "end": 4337, "idx": 27}, {"begin": 4338, "end": 4648, "idx": 28}, {"begin": 4649, "end": 4734, "idx": 29}, {"begin": 4735, "end": 4908, "idx": 30}, {"begin": 4909, "end": 5046, "idx": 31}, {"begin": 5066, "end": 5233, "idx": 32}, {"begin": 5234, "end": 5553, "idx": 33}, {"begin": 5554, "end": 5661, "idx": 34}, {"begin": 5662, "end": 5736, "idx": 35}, {"begin": 5737, "end": 5887, "idx": 36}, {"begin": 5888, "end": 6217, "idx": 37}, {"begin": 6218, "end": 6534, "idx": 38}, {"begin": 6566, "end": 6569, "idx": 39}, {"begin": 6570, "end": 7035, "idx": 40}, {"begin": 7070, "end": 7293, "idx": 41}, {"begin": 7313, "end": 7522, "idx": 42}, {"begin": 7523, "end": 7844, "idx": 43}, {"begin": 7872, "end": 8261, "idx": 44}, {"begin": 8262, "end": 8547, "idx": 45}, {"begin": 8548, "end": 8710, "idx": 46}, {"begin": 8711, "end": 8885, "idx": 47}, {"begin": 8886, "end": 9065, "idx": 48}, {"begin": 9066, "end": 9154, "idx": 49}, {"begin": 9155, "end": 9242, "idx": 50}, {"begin": 9243, "end": 9472, "idx": 51}, {"begin": 9473, "end": 9598, "idx": 52}, {"begin": 9599, "end": 9636, "idx": 53}, {"begin": 9637, "end": 9778, "idx": 54}, {"begin": 9779, "end": 9823, "idx": 55}, {"begin": 9824, "end": 10042, "idx": 56}, {"begin": 10043, "end": 10139, "idx": 57}, {"begin": 10140, "end": 10239, "idx": 58}, {"begin": 10240, "end": 10342, "idx": 59}, {"begin": 10343, "end": 10521, "idx": 60}, {"begin": 10522, "end": 10672, "idx": 61}, {"begin": 10673, "end": 10822, "idx": 62}, {"begin": 10823, "end": 10978, "idx": 63}, {"begin": 10979, "end": 11091, "idx": 64}, {"begin": 11092, "end": 11236, "idx": 65}, {"begin": 11237, "end": 11353, "idx": 66}, {"begin": 11354, "end": 11581, "idx": 67}, {"begin": 11582, "end": 11667, "idx": 68}, {"begin": 11668, "end": 11768, "idx": 69}, {"begin": 11769, "end": 11825, "idx": 70}, {"begin": 11844, "end": 11886, "idx": 71}, {"begin": 11887, "end": 11940, "idx": 72}, {"begin": 11941, "end": 11992, "idx": 73}, {"begin": 11993, "end": 12112, "idx": 74}, {"begin": 12113, "end": 12342, "idx": 75}, {"begin": 12343, "end": 12512, "idx": 76}, {"begin": 12513, "end": 12636, "idx": 77}, {"begin": 12637, "end": 12766, "idx": 78}, {"begin": 12767, "end": 12902, "idx": 79}, {"begin": 12903, "end": 13102, "idx": 80}, {"begin": 13103, "end": 13292, "idx": 81}, {"begin": 13322, "end": 13501, "idx": 82}, {"begin": 13502, "end": 13594, "idx": 83}, {"begin": 13614, "end": 13693, "idx": 84}, {"begin": 13694, "end": 13869, "idx": 85}, {"begin": 13870, "end": 13928, "idx": 86}, {"begin": 13929, "end": 14118, "idx": 87}, {"begin": 14119, "end": 14181, "idx": 88}, {"begin": 14205, "end": 14489, "idx": 89}, {"begin": 14490, "end": 14673, "idx": 90}, {"begin": 14674, "end": 14900, "idx": 91}, {"begin": 14901, "end": 14973, "idx": 92}, {"begin": 14974, "end": 15029, "idx": 93}, {"begin": 15030, "end": 15118, "idx": 94}, {"begin": 15119, "end": 15300, "idx": 95}, {"begin": 15322, "end": 15459, "idx": 96}, {"begin": 15460, "end": 15522, "idx": 97}, {"begin": 15523, "end": 15569, "idx": 98}, {"begin": 15570, "end": 15825, "idx": 99}, {"begin": 15826, "end": 15928, "idx": 100}, {"begin": 15929, "end": 15976, "idx": 101}, {"begin": 15977, "end": 16033, "idx": 102}, {"begin": 16034, "end": 16289, "idx": 103}, {"begin": 16290, "end": 16433, "idx": 104}, {"begin": 16434, "end": 16610, "idx": 105}, {"begin": 16611, "end": 16747, "idx": 106}, {"begin": 16748, "end": 16801, "idx": 107}, {"begin": 16802, "end": 16956, "idx": 108}, {"begin": 16957, "end": 17206, "idx": 109}, {"begin": 17207, "end": 17284, "idx": 110}, {"begin": 17285, "end": 17462, "idx": 111}, {"begin": 17463, "end": 17539, "idx": 112}, {"begin": 17540, "end": 17648, "idx": 113}, {"begin": 17649, "end": 17775, "idx": 114}, {"begin": 17776, "end": 17788, "idx": 115}, {"begin": 17789, "end": 17914, "idx": 116}, {"begin": 17915, "end": 18001, "idx": 117}, {"begin": 18002, "end": 18171, "idx": 118}, {"begin": 18172, "end": 18277, "idx": 119}, {"begin": 18278, "end": 18352, "idx": 120}, {"begin": 18353, "end": 18423, "idx": 121}, {"begin": 18424, "end": 18580, "idx": 122}, {"begin": 18581, "end": 18686, "idx": 123}, {"begin": 18704, "end": 18833, "idx": 124}, {"begin": 18834, "end": 18932, "idx": 125}, {"begin": 18933, "end": 19272, "idx": 126}, {"begin": 19273, "end": 19361, "idx": 127}, {"begin": 19362, "end": 19462, "idx": 128}, {"begin": 19463, "end": 19534, "idx": 129}, {"begin": 19535, "end": 19679, "idx": 130}, {"begin": 19680, "end": 19813, "idx": 131}, {"begin": 19814, "end": 20128, "idx": 132}, {"begin": 20129, "end": 20290, "idx": 133}, {"begin": 20291, "end": 20397, "idx": 134}, {"begin": 20398, "end": 20489, "idx": 135}, {"begin": 20490, "end": 20620, "idx": 136}, {"begin": 20635, "end": 20712, "idx": 137}, {"begin": 20713, "end": 20945, "idx": 138}, {"begin": 20946, "end": 21048, "idx": 139}, {"begin": 21049, "end": 21107, "idx": 140}, {"begin": 21108, "end": 21146, "idx": 141}, {"begin": 21160, "end": 21257, "idx": 142}, {"begin": 21258, "end": 21395, "idx": 143}, {"begin": 21396, "end": 21518, "idx": 144}, {"begin": 21519, "end": 21543, "idx": 145}, {"begin": 21544, "end": 21627, "idx": 146}, {"begin": 21628, "end": 21682, "idx": 147}, {"begin": 21683, "end": 21760, "idx": 148}, {"begin": 21761, "end": 21942, "idx": 149}, {"begin": 21943, "end": 22079, "idx": 150}, {"begin": 22080, "end": 22228, "idx": 151}, {"begin": 22229, "end": 22402, "idx": 152}, {"begin": 22403, "end": 22733, "idx": 153}, {"begin": 22734, "end": 22795, "idx": 154}, {"begin": 22796, "end": 22921, "idx": 155}, {"begin": 22945, "end": 23137, "idx": 156}, {"begin": 23138, "end": 23262, "idx": 157}, {"begin": 23276, "end": 23362, "idx": 158}, {"begin": 23363, "end": 23420, "idx": 159}, {"begin": 23421, "end": 23529, "idx": 160}, {"begin": 23530, "end": 23628, "idx": 161}, {"begin": 23629, "end": 23718, "idx": 162}, {"begin": 23719, "end": 23836, "idx": 163}, {"begin": 23850, "end": 23921, "idx": 164}, {"begin": 23922, "end": 23994, "idx": 165}, {"begin": 23995, "end": 24189, "idx": 166}, {"begin": 24190, "end": 24341, "idx": 167}, {"begin": 24342, "end": 24428, "idx": 168}, {"begin": 24429, "end": 24627, "idx": 169}, {"begin": 24628, "end": 24897, "idx": 170}, {"begin": 24898, "end": 24937, "idx": 171}, {"begin": 24952, "end": 25049, "idx": 172}, {"begin": 25050, "end": 25228, "idx": 173}, {"begin": 25229, "end": 25332, "idx": 174}, {"begin": 25333, "end": 25372, "idx": 175}, {"begin": 25373, "end": 25494, "idx": 176}, {"begin": 25495, "end": 25657, "idx": 177}, {"begin": 25658, "end": 25756, "idx": 178}, {"begin": 25757, "end": 25862, "idx": 179}, {"begin": 25863, "end": 25902, "idx": 180}, {"begin": 25903, "end": 26109, "idx": 181}, {"begin": 26110, "end": 26267, "idx": 182}, {"begin": 26276, "end": 26509, "idx": 183}, {"begin": 26510, "end": 26595, "idx": 184}, {"begin": 26596, "end": 26773, "idx": 185}, {"begin": 26774, "end": 26843, "idx": 186}, {"begin": 26844, "end": 26940, "idx": 187}, {"begin": 26941, "end": 27038, "idx": 188}, {"begin": 27039, "end": 27125, "idx": 189}, {"begin": 27126, "end": 27263, "idx": 190}, {"begin": 27264, "end": 27381, "idx": 191}, {"begin": 27382, "end": 27531, "idx": 192}, {"begin": 27532, "end": 27608, "idx": 193}, {"begin": 27609, "end": 27780, "idx": 194}, {"begin": 27781, "end": 27878, "idx": 195}, {"begin": 27899, "end": 28021, "idx": 196}, {"begin": 28045, "end": 28357, "idx": 197}, {"begin": 28358, "end": 28485, "idx": 198}, {"begin": 28486, "end": 28648, "idx": 199}, {"begin": 28649, "end": 28757, "idx": 200}, {"begin": 28758, "end": 28940, "idx": 201}, {"begin": 28941, "end": 29142, "idx": 202}, {"begin": 29143, "end": 29225, "idx": 203}, {"begin": 29226, "end": 29458, "idx": 204}, {"begin": 29459, "end": 29708, "idx": 205}, {"begin": 29709, "end": 29752, "idx": 206}, {"begin": 29753, "end": 30066, "idx": 207}, {"begin": 30067, "end": 30241, "idx": 208}, {"begin": 30242, "end": 30312, "idx": 209}, {"begin": 30313, "end": 30438, "idx": 210}, {"begin": 30439, "end": 30538, "idx": 211}, {"begin": 30539, "end": 30642, "idx": 212}, {"begin": 30643, "end": 30790, "idx": 213}, {"begin": 30805, "end": 30903, "idx": 214}, {"begin": 30904, "end": 31059, "idx": 215}, {"begin": 31060, "end": 31170, "idx": 216}, {"begin": 31171, "end": 31249, "idx": 217}, {"begin": 31264, "end": 31361, "idx": 218}, {"begin": 31362, "end": 31491, "idx": 219}, {"begin": 31492, "end": 31558, "idx": 220}, {"begin": 31559, "end": 31643, "idx": 221}, {"begin": 31644, "end": 31734, "idx": 222}, {"begin": 31735, "end": 31821, "idx": 223}, {"begin": 31822, "end": 31970, "idx": 224}, {"begin": 31971, "end": 32130, "idx": 225}, {"begin": 32131, "end": 32397, "idx": 226}, {"begin": 32398, "end": 32462, "idx": 227}, {"begin": 32463, "end": 32535, "idx": 228}, {"begin": 32536, "end": 32611, "idx": 229}, {"begin": 32612, "end": 32921, "idx": 230}, {"begin": 32922, "end": 33018, "idx": 231}, {"begin": 33019, "end": 33197, "idx": 232}, {"begin": 33198, "end": 33319, "idx": 233}, {"begin": 33320, "end": 33468, "idx": 234}, {"begin": 33469, "end": 33539, "idx": 235}, {"begin": 33540, "end": 33593, "idx": 236}, {"begin": 33594, "end": 33639, "idx": 237}, {"begin": 33640, "end": 33759, "idx": 238}, {"begin": 33760, "end": 33914, "idx": 239}, {"begin": 33915, "end": 33982, "idx": 240}, {"begin": 33983, "end": 34070, "idx": 241}, {"begin": 34071, "end": 34244, "idx": 242}, {"begin": 34245, "end": 34472, "idx": 243}, {"begin": 34473, "end": 34508, "idx": 244}, {"begin": 34509, "end": 34586, "idx": 245}, {"begin": 34587, "end": 34741, "idx": 246}, {"begin": 34742, "end": 34823, "idx": 247}, {"begin": 34824, "end": 34898, "idx": 248}, {"begin": 34899, "end": 34996, "idx": 249}, {"begin": 34997, "end": 35070, "idx": 250}, {"begin": 35093, "end": 35162, "idx": 251}], "ReferenceToFigure": [{"begin": 3122, "end": 3123, "idx": 0}, {"begin": 3651, "end": 3652, "idx": 1}, {"begin": 5321, "end": 5322, "idx": 2}, {"begin": 6724, "end": 6725, "idx": 3}, {"begin": 7575, "end": 7577, "target": "#fig_0", "idx": 4}, {"begin": 9786, "end": 9787, "target": "#fig_2", "idx": 5}, {"begin": 15936, "end": 15937, "target": "#fig_3", "idx": 6}, {"begin": 25529, "end": 25530, "target": "#fig_4", "idx": 7}, {"begin": 25931, "end": 25932, "target": "#fig_4", "idx": 8}, {"begin": 27049, "end": 27050, "target": "#fig_5", "idx": 9}, {"begin": 27133, "end": 27134, "target": "#fig_5", "idx": 10}, {"begin": 35160, "end": 35161, "target": "#fig_7", "idx": 11}], "Div": [{"begin": 100, "end": 515, "idx": 0}, {"begin": 518, "end": 1818, "idx": 1}, {"begin": 1820, "end": 2027, "idx": 2}, {"begin": 2029, "end": 5046, "idx": 3}, {"begin": 5048, "end": 7293, "idx": 4}, {"begin": 7295, "end": 7844, "idx": 5}, {"begin": 7846, "end": 11825, "idx": 6}, {"begin": 11827, "end": 13292, "idx": 7}, {"begin": 13294, "end": 13594, "idx": 8}, {"begin": 13596, "end": 14181, "idx": 9}, {"begin": 14183, "end": 15300, "idx": 10}, {"begin": 15302, "end": 18686, "idx": 11}, {"begin": 18688, "end": 20620, "idx": 12}, {"begin": 20622, "end": 21146, "idx": 13}, {"begin": 21148, "end": 22921, "idx": 14}, {"begin": 22923, "end": 23262, "idx": 15}, {"begin": 23264, "end": 23836, "idx": 16}, {"begin": 23838, "end": 24937, "idx": 17}, {"begin": 24939, "end": 26267, "idx": 18}, {"begin": 26269, "end": 27878, "idx": 19}, {"begin": 27880, "end": 28021, "idx": 20}, {"begin": 28023, "end": 30790, "idx": 21}, {"begin": 30792, "end": 31249, "idx": 22}, {"begin": 31251, "end": 35070, "idx": 23}, {"begin": 35072, "end": 35162, "idx": 24}], "SectionMain": [{"begin": 515, "end": 35162, "idx": 0}]}}