{"text": "Automated Hate Speech Detection and the Problem of Offensive Language *\n\nAbstract:\nA key challenge for automatic hate-speech detection on social media is the separation of hate speech from other instances of offensive language. Lexical detection methods tend to have low precision because they classify all messages containing particular terms as hate speech and previous work using supervised learning has failed to distinguish between the two categories. We used a crowd-sourced hate speech lexicon to collect tweets containing hate speech keywords. We use crowd-sourcing to label a sample of these tweets into three categories: those containing hate speech, only offensive language, and those with neither. We train a multi-class classifier to distinguish between these different categories. Close analysis of the predictions and the errors shows when we can reliably separate hate speech from other offensive language and when this differentiation is more difficult. We find that racist and homophobic tweets are more likely to be classified as hate speech but that sexist tweets are generally classified as offensive. Tweets without explicit hate keywords are also more difficult to classify.\n\n\nIntroduction\nWhat constitutes hate speech and when does it differ from offensive language? No formal definition exists but there is a consensus that it is speech that targets disadvantaged social groups in a manner that is potentially harmful to them (Jacobs and Potter 2000; Walker 1994). In the United States, hate speech is protected under the free speech provisions of the First Amendment, but it has been extensively debated in the legal sphere and with regards to speech codes on college campuses. In many countries, including the United Kingdom, Canada, and France, there are laws prohibiting hate speech, which tends to be defined as speech that targets minority groups in a way that could promote violence or social disorder. People convicted of using hate speech can often face large fines and even imprisonment. These laws extend to the internet and social media, leading many sites to create their own provisions against hate speech. Both Facebook and Twitter have responded to criticism for not doing enough to prevent hate speech on their sites by instituting policies to prohibit the use of their platforms for attacks on people based on characteristics like race, ethnicity, gender, and sexual orientation, or threats of violence towards others. 1  Drawing upon these definitions, we define hate speech as language that is used to expresses hatred towards a targeted group or is intended to be derogatory, to humiliate, or to insult the members of the group. In extreme cases this may also be language that threatens or incites violence, but limiting our definition only to such cases would exclude a large proportion of hate speech. Importantly, our definition does not include all instances of offensive language because people often use terms that are highly offensive to certain groups but in a qualitatively different manner. For example some African Americans often use the term n*gga 2 in everyday language online (Warner and Hirschberg 2012), people use terms like h*e and b*tch when quoting rap lyrics, and teenagers use homophobic slurs like f*g as they play video games. Such language is prevalent on social media (Wang et al. 2014), making this boundary condition crucial for any usable hate speech detection system .\nPrevious work on hate speech detection has identified this problem but many studies still tend to conflate hate speech and offensive language. In this paper we label tweets into three categories: hate speech, offensive language, or neither. We train a model to differentiate between these categories and then analyze the results in order to better understand how we can distinguish between them. Our results show that fine-grained labels can help in the task of hate speech detection and highlights some of the key challenges to accurate classification. We conclude that future work must better account for context and the heterogeneity in hate speech usage.\n\nRelated Work\nBag-of-words approaches tend to have high recall but lead to high rates of false positives since the presence of offensive words can lead to the misclassification of tweets as hate speech (Kwok and Wang 2013; Burnap and Williams 1 Facebook's policy can be found here: www.facebook. com/communitystandards#hate-speech. Twitter's policy can be found here: support.twitter.com/articles/ 20175050.\n2 Where present, the \"*\" has been inserted by us and was not part of the original text. All tweets quoted have been modified slightly to protect user's identities while retaining their original meaning.\n\n2015)\n. Focusing on anti-black racism, Kwok and Wang find that 86% of the time the reason a tweet was categorized as racist was because it contained offensive words. Given the relatively high prevalence of offensive language and \"curse words\" on social media this makes hate speech detection particularly challenging (Wang et al. 2014). The difference between hate speech and other offensive language is often based upon subtle linguistic distinctions, for example tweets containing the word n*gger are more likely to be labeled as hate speech than n*gga (Kwok and Wang 2013). Many can be ambiguous, for example the word gay can be used both pejoratively and in other contexts unrelated to hate speech (Wang et al. 2014).\nSyntactic features have been leveraged to better identify the targets and intensity of hate speech, for example sentences where a relevant noun and verb occur (e.g. kill and Jews) (Gitari et al. 2015), the POS trigram \"DT jewish NN\" (Warner and Hirschberg 2012), and the syntactic structure I <intensity > <user intent > <hate target >, e.g. \"I f*cking hate white people\" (Silva et al. 2016).\nOther supervised approaches to hate speech classification have unfortunately conflated hate speech with offensive language, making it difficult to ascertain the extent to which they are really identifying hate speech (Burnap and Williams 2015; Waseem and Hovy 2016). Neural language models show promise in the task but existing work has used training data has a similarly broad definition of hate speech (Djuric et al. 2015). Non-linguistic features like the gender or ethnicity of the author can help improve hate speech classification but this information is often unavailable or unreliable on social media (Waseem and Hovy 2016).\n\nData\nWe begin with a hate speech lexicon containing words and phrases identified by internet users as hate speech, compiled by Hatebase.org. Using the Twitter API we searched for tweets containing terms from the lexicon, resulting in a sample of tweets from 33,458 Twitter users. We extracted the time-line for each user, resulting in a set of 85.4 million tweets. From this corpus we then took a random sample of 25k tweets containing terms from the lexicon and had them manually coded by CrowdFlower (CF) workers. Workers were asked to label each tweet as one of three categories: hate speech, offensive but not hate speech, or neither offensive nor hate speech. They were provided with our definition along with a paragraph explaining it in further detail. Users were asked to think not just about the words appearing in a given tweet but about the context in which they were used. They were instructed that the presence of a particular word, however offensive, did not necessarily indicate a tweet is hate speech. Each tweet was coded by three or more people. The intercoder-agreement score provided by CF is 92%. We use the majority decision for each tweet to assign a label. Some tweets were not assigned labels as there was no majority class. This results in a sample of 24,802 labeled tweets.\nOnly 5% of tweets were coded as hate speech by the majority of coders and only 1.3% were coded unanimously, demonstrating the imprecision of the Hatebase lexicon. This is much lower than a comparable study using Twitter, where 11.6% of tweets were flagged as hate speech (Burnap and Williams 2015), likely because we use a stricter criteria for hate speech. The majority of the tweets were considered to be offensive language (76% at 2/3, 53% at 3/3) and the remainder were considered to be non-offensive (16.6% at 2/3, 11.8% at 3/3). We then constructed features from these tweets and used them to train a classifier.\n\nFeatures\nWe lowercased each tweet and stemmed it using the Porter stemmer, 3 then create bigram, unigram, and trigram features, each weighted by its TF-IDF. To capture information about the syntactic structure we use NLTK (Bird, Loper, and Klein 2009) to construct Penn Part-of-Speech (POS) tag unigrams, bigrams, and trigrams. To capture the quality of each tweet we use modified Flesch-Kincaid Grade Level and Flesch Reading Ease scores, where the number of sentences is fixed at one. We also use a sentiment lexicon designed for social media to assign sentiment scores to each tweet (Hutto and Gilbert 2014). We also include binary and count indicators for hashtags, mentions, retweets, and URLs, as well as features for the number of characters, words, and syllables in each tweet.\n\nModel\nWe first use a logistic regression with L1 regularization to reduce the dimensionality of the data. We then test a variety of models that have been used in prior work: logistic regression, naïve Bayes, decision trees, random forests, and linear SVMs. We tested each model using 5-fold cross validation, holding out 10% of the sample for evaluation to help prevent over-fitting. After using a grid-search to iterate over the models and parameters we find that the Logistic Regression and Linear SVM tended to perform significantly better than other models. We decided to use a logistic regression with L2 regularization for the final model as it more readily allows us to examine the predicted probabilities of class membership and has performed well in previous papers (Burnap and Williams 2015; Waseem and Hovy 2016). We trained the final model using the entire dataset and used it to predict the label for each tweet. We use a one-versus-rest framework where a separate classifier is trained for each class and the class label with the highest predicted probability across all classifiers is assigned to each tweet. All modeling was performing using scikit-learn (Pedregosa and others 2011).\n\nResults\nThe best performing model has an overall precision 0.91, recall of 0.90, and F1 score of 0.90. Looking at Figure 1, however, we see that almost 40% of hate speech is misclassified: the precision and recall scores for the hate class are 0.44 and 0.61 respectively. Most of the misclassification occurs in the upper triangle of this matrix, suggesting that the Figure 1 approximately 5% of offensive and 2% of innocuous tweets have been erroneously classified as hate speech. To explore why these tweets have been misclassified we now look more closely at the tweets and their predicted classes.\nTweets with the highest predicted probabilities of being hate speech tend to contain multiple racial or homophobic slurs, e.g. @JuanYeez shut yo beaner ass up sp*c and hop your f*ggot ass back across the border little n*gga and RT @eBeZa: Stupid f*cking n*gger LeBron. You flipping jungle bunny monkey f*ggot. Other tweets tend to be correctly identified as hate when they contained strongly racist or homophobic terms like n*gger and f*ggot. Interestingly, we also find cases where people use hate speech to respond to other hate speakers, such as this tweet where someone uses a homophobic slur to criticize someone else's racism: @MrMoonfrog @RacistNegro86 f*ck you, stupid ass coward b*tch f*ggot racist piece of sh*t.\nTurning to true hate speech classified as offensive it appears that tweets with the highest predicted probability of being offensive are genuinely less hateful and were perhaps mislabeled, for example When you realize how curiosity is a b*tch #CuriosityKilledMe may have been erroneously coded as hate speech if people thought that curiosity was a person, and Why no boycott of racist \"redskins\"? #Redskins #ChangeTheName contains a slur but is actually against racism. It is likely that coders skimmed these tweets too quickly, picking out words or phrases that appeared to be hateful without considering the context. Turning to bor-derline cases, where the probability of being offensive is marginally higher than hate speech, it appears that the majority are hate speech, both directed towards other Twitter users, @MDreyfus @NatFascist88 Sh*t your ass your moms p*ssy u Jew b*stard. Ur times coming. Heil Hitler! and general hateful statements like My advice of the day: If your a tranny...go f*ck your self!. These tweets fit our definition of hate speech but were likely misclassified because they do not contain any of the terms most strongly associated with hate speech. Finally, the hateful tweets incorrectly labeled as neither tend not to contain hate or curse words, for example If some one isn't an Anglo-Saxon Protestant, they have no right to be alive in the US. None at all, they are foreign filth contains a negative term, filth but no slur against a particular group. We also see that rarer types of hate speech, for example this anti-Chinese statement Every slant in #LA should be deported. Those scum have no right to be here. Chinatown should be bulldozed, are incorrectly classified. While the classifier performs well at prevalent forms of hate speech, particularly anti-black racism and homophobia, but is less reliable at detecting types of hate speech that occur infrequently, a problem noted by Nobata et al. (2016).\nA key flaw in much previous work is that offensive language is mislabeled as hate speech due to an overly broad definition. Our multi-class framework allows us to minimize these errors; only 5% of our true offensive language was labeled as hate. The tweets correctly labeled as offensive tend to contain curse words and often sexist language, e.g. Why you worried bout that other h*e? Cuz that other h*e aint worried bout another h*e and I knew Kendrick Lamar was onto something when he said \"I call a b*tch a b*tch, a h*e a h*e, a woman a woman\". Many of these tweets contain sexist terms like b*tch, p*ssy, and h*e. Human coders appear to consider racists or homophobic terms to be hateful but consider words that are sexist and derogatory towards women to be only offensive, consistent prior findings (Waseem and Hovy 2016).\nLooking at the tweets misclassified as hate speech we see that many contain multiple slurs, e.g. @SmogBaby: These h*es be lyin to all of us n*ggas and My n*gga mister meaner just hope back in the b*tch. While these tweets contain terms that can be considered racist and sexist it is apparent than many Twitter users use this type of language in their everyday communications. When they do contain racist language they tend to contain the term n*gga rather than n*gger, in line with the findings of Kwok and Wang (2013). We also found a few recurring phrases such as these h*es ain't loyal that were actually lyrics from rap songs that users were quoting. Classification of such tweets as hate speech leads us to overestimate the prevalence of the phenomenon. While our model still misclassifies some offensive language as hate speech we are able to avoid the vast majority of these errors by differentiating between the two.\nFinally, turning to the neither class, we see that tweets with the highest predicted probability of belonging to this class all appear to be innocuous and were included in the sample because they contained terms included in the Hatebase lexicon such as charlie and bird that are generally not used in a hateful manner. Tweets with overall positive sen-timent and higher readability scores are more likely to belong to this class. The tweets in this category that have been misclassified as hate or offensive tend to mention race, sexuality, and other social categories that are targeted by hate speakers. Most appear to be misclassifications appear to be caused by on the presence of potentially offensive language, for example He's a damn good actor. As a gay man it's awesome to see an openly queer actor given the lead role for a major film contains the potentially the offensive terms gay and queer but uses them in a positive sense. This problem has been encountered in previous research (Warner and Hirschberg 2012) and illustrates the importance of taking context into account. We also found a small number of cases where the coders appear to have missed hate speech that was correctly identified by our model, e.g. @mayormcgunn @SenFeinstein White people need those weapons to defend themselves from the subhuman trash your sort unleashes on us. This finding is consistent with previous work that has found amateur coders to often be unreliable at identifying abusive content (Nobata et al. 2016; Waseem 2016).\n\nConclusions\nIf we conflate hate speech and offensive language then we erroneously consider many people to be hate speakers (errors in the lower triangle of Figure 1) and fail differentiate between commonplace offensive language and serious hate speech (errors in the upper triangle of Figure 1). Given the legal and moral implications of hate speech it is important that we are able to accurately distinguish between the two. Lexical methods are effective ways to identify potentially offensive terms but are inaccurate at identifying hate speech; only a small percentage of tweets flagged by the Hatebase lexicon were considered hate speech by human coders. 4 While automated classification methods can achieve relatively high accuracy at differentiating between these different classes, close analysis of the results shows that the presence or absence of particular offensive or hateful terms can both help and hinder accurate classification.\nConsistent with previous work, we find that certain terms are particularly useful for distinguishing between hate speech and offensive language. While f*g, b*tch, and n*gga are used in both hate speech and offensive language, the terms f*ggot and n*gger are generally associated with hate speech. Many of the tweets considered most hateful contain multiple racial and homophobic slurs. While this allows us to easily identify some of the more egregious instances of hate speech it means that we are more likely to misclassify hate speech if it doesn't contain any curse words or offensive terms. To more accurately classify such cases we should find sources of training data that are hateful without necessarily using particular keywords or offensive language.\nOur results also illustrate how hate speech can be used in 4 If a lexicon must be used we propose that a smaller lexicon with higher precision is preferable to a larger lexicon with higher recall. We have made a more restricted version of the Hatebase lexicon available here: https://github.com/t-davidson/ hate-speech-and-offensive-language.\ndifferent ways: it can be directly send to a person or group of people targeted, it can be espoused to nobody in particular, and it can be used in conversation between people. Future work should distinguish between these different uses and look more closely at the social contexts and conversations in which hate speech occurs. We must also study more closely the people who use hate speech, focusing both on their individual characteristics and motivations and on the social structures they are embedded in.\nHate speech is a difficult phenomenon to define and is not monolithic. Our classifications of hate speech tend to reflect our own subjective biases. People identify racist and homophobic slurs as hateful but tend to see sexist language as merely offensive. While our results show that people perform well at identifying some of the more egregious instances of hate speech, particularly anti-black racism and homophobia, it is important that we are cognizant of the social biases that enter into our algorithms and future work should aim to identify and correct these biases.\n\nFootnotes:\n3: We verified that the stemmer did not remove important information by reducing key terms to the same stem, e.g. f*gs and f*ggots stem to f*g and f*ggot.\n\nReferences:\n\n- Bird, S.; Loper, E.; and Klein, E. 2009. Natural Language Pro- cessing with Python. O'Reilly Media Inc.- Burnap, P., and Williams, M. L. 2015. Cyber hate speech on twit- ter: An application of machine classification and statistical model- ing for policy and decision making. Policy & Internet 7(2):223- 242. Djuric, N.; Zhou, J.; Morris, R.; Grbovic, M.; Radosavljevic, V.; and Bhamidipati, N. 2015. Hate speech detection with comment embeddings. In WWW, 29-30.\n\n- Gitari, N. D.; Zuping, Z.; Damien, H.; and Long, J. 2015. A lexicon-based approach for hate speech detection. International Journal of Multimedia and Ubiquitous Engineering 10:215-230.\n\n- Hutto, C. J., and Gilbert, E. 2014. VADER: A parsimonious rule- based model for sentiment analysis of social media text. In ICWSM.\n\n- Jacobs, J. B., and Potter, K. 2000. Hate crimes: Criminal Law and Identity Politics. Oxford University Press.\n\n- Kwok, I., and Wang, Y. 2013. Locate the hate: Detecting tweets against blacks. In AAAI.\n\n- Nobata, C.; Tetreault, J.; Thomas, A.; Mehdad, Y.; and Chang, Y. 2016. Abusive language detection in online user content. In WWW, 145-153.\n\n- Pedregosa, F., et al. 2011. Scikit-learn: Machine learning in Python. Journal of Machine Learning Research 12:2825-2830.\n\n- Silva, L. A.; Mondal, M.; Correa, D.; Benevenuto, F.; and Weber, I. 2016. Analyzing the targets of hate in online social media. In ICWSM, 687-690.\n\n- Walker, S. 1994. Hate Speech: The History of an American Con- troversy. U of Nebraska Press.\n\n- Wang, W.; Chen, L.; Thirunarayan, K.; and Sheth, A. P. 2014. Cursing in english on twitter. In CSCW, 415-425.\n\n- Warner, W., and Hirschberg, J. 2012. Detecting hate speech on the world wide web. In LSM, 19-26.\n\n- Waseem, Z., and Hovy, D. 2016. Hateful symbols or hateful peo- ple? predictive features for hate speech detection on twitter. In SRW@HLT-NAACL, 88-93.\n\n- Waseem, Z. 2016. Are you a racist or am i seeing things? annotator influence on hate speech detection on twitter. In Proceedings of the First Workshop on NLP and CSS, 138-142.\n\n", "annotations": {"Abstract": [{"begin": 73, "end": 1197, "idx": 0}], "Head": [{"begin": 1200, "end": 1212, "idx": 0}, {"begin": 4106, "end": 4118, "idx": 1}, {"begin": 4717, "end": 4722, "idx": 2}, {"begin": 6466, "end": 6470, "idx": 3}, {"begin": 8387, "end": 8395, "idx": 4}, {"begin": 9174, "end": 9179, "idx": 5}, {"begin": 10375, "end": 10382, "idx": 6}, {"begin": 16917, "end": 16928, "idx": 7}], "ReferenceToBib": [{"begin": 1451, "end": 1475, "target": "#b4", "idx": 0}, {"begin": 1476, "end": 1487, "target": "#b9", "idx": 1}, {"begin": 3137, "end": 3165, "target": "#b11", "idx": 2}, {"begin": 3341, "end": 3359, "target": "#b10", "idx": 3}, {"begin": 4307, "end": 4326, "target": "#b5", "idx": 4}, {"begin": 5034, "end": 5052, "target": "#b10", "idx": 5}, {"begin": 5272, "end": 5292, "target": "#b5", "idx": 6}, {"begin": 5419, "end": 5437, "target": "#b10", "idx": 7}, {"begin": 5619, "end": 5639, "target": "#b2", "idx": 8}, {"begin": 5672, "end": 5700, "target": "#b11", "idx": 9}, {"begin": 5811, "end": 5830, "target": "#b8", "idx": 10}, {"begin": 6049, "end": 6075, "target": "#b1", "idx": 11}, {"begin": 6076, "end": 6097, "target": "#b12", "idx": 12}, {"begin": 6236, "end": 6256, "target": "#b1", "idx": 13}, {"begin": 6441, "end": 6463, "target": "#b12", "idx": 14}, {"begin": 8038, "end": 8064, "target": "#b1", "idx": 15}, {"begin": 8609, "end": 8638, "target": "#b0", "idx": 16}, {"begin": 8973, "end": 8997, "target": "#b3", "idx": 17}, {"begin": 9949, "end": 9975, "target": "#b1", "idx": 18}, {"begin": 9976, "end": 9997, "target": "#b12", "idx": 19}, {"begin": 10345, "end": 10372, "idx": 20}, {"begin": 13622, "end": 13642, "target": "#b6", "idx": 21}, {"begin": 14448, "end": 14470, "target": "#b12", "idx": 22}, {"begin": 14970, "end": 14990, "target": "#b5", "idx": 23}, {"begin": 16390, "end": 16418, "target": "#b11", "idx": 24}, {"begin": 16881, "end": 16901, "target": "#b6", "idx": 25}, {"begin": 16902, "end": 16914, "target": "#b13", "idx": 26}], "ReferenceToFootnote": [{"begin": 8462, "end": 8463, "target": "#foot_0", "idx": 0}], "SectionFootnote": [{"begin": 20051, "end": 20216, "idx": 0}], "ReferenceString": [{"begin": 20233, "end": 20336, "id": "b0", "idx": 0}, {"begin": 20338, "end": 20694, "id": "b1", "idx": 1}, {"begin": 20698, "end": 20882, "id": "b2", "idx": 2}, {"begin": 20886, "end": 21016, "id": "b3", "idx": 3}, {"begin": 21020, "end": 21129, "id": "b4", "idx": 4}, {"begin": 21133, "end": 21220, "id": "b5", "idx": 5}, {"begin": 21224, "end": 21362, "id": "b6", "idx": 6}, {"begin": 21366, "end": 21486, "id": "b7", "idx": 7}, {"begin": 21490, "end": 21636, "id": "b8", "idx": 8}, {"begin": 21640, "end": 21732, "id": "b9", "idx": 9}, {"begin": 21736, "end": 21845, "id": "b10", "idx": 10}, {"begin": 21849, "end": 21945, "id": "b11", "idx": 11}, {"begin": 21949, "end": 22099, "id": "b12", "idx": 12}, {"begin": 22103, "end": 22278, "id": "b13", "idx": 13}], "Footnote": [{"begin": 20062, "end": 20216, "id": "foot_0", "n": "3", "idx": 0}], "Paragraph": [{"begin": 83, "end": 1197, "idx": 0}, {"begin": 1213, "end": 3445, "idx": 1}, {"begin": 3446, "end": 4104, "idx": 2}, {"begin": 4119, "end": 4512, "idx": 3}, {"begin": 4513, "end": 4715, "idx": 4}, {"begin": 4723, "end": 5438, "idx": 5}, {"begin": 5439, "end": 5831, "idx": 6}, {"begin": 5832, "end": 6464, "idx": 7}, {"begin": 6471, "end": 7766, "idx": 8}, {"begin": 7767, "end": 8385, "idx": 9}, {"begin": 8396, "end": 9172, "idx": 10}, {"begin": 9180, "end": 10373, "idx": 11}, {"begin": 10383, "end": 10976, "idx": 12}, {"begin": 10977, "end": 11699, "idx": 13}, {"begin": 11700, "end": 13643, "idx": 14}, {"begin": 13644, "end": 14471, "idx": 15}, {"begin": 14472, "end": 15396, "idx": 16}, {"begin": 15397, "end": 16915, "idx": 17}, {"begin": 16929, "end": 17861, "idx": 18}, {"begin": 17862, "end": 18622, "idx": 19}, {"begin": 18623, "end": 18965, "idx": 20}, {"begin": 18966, "end": 19474, "idx": 21}, {"begin": 19475, "end": 20049, "idx": 22}], "SectionHeader": [{"begin": 0, "end": 1197, "idx": 0}], "SectionReference": [{"begin": 20218, "end": 22280, "idx": 0}], "Sentence": [{"begin": 83, "end": 227, "idx": 0}, {"begin": 228, "end": 456, "idx": 1}, {"begin": 457, "end": 551, "idx": 2}, {"begin": 552, "end": 709, "idx": 3}, {"begin": 710, "end": 794, "idx": 4}, {"begin": 795, "end": 970, "idx": 5}, {"begin": 971, "end": 1122, "idx": 6}, {"begin": 1123, "end": 1197, "idx": 7}, {"begin": 1213, "end": 1290, "idx": 8}, {"begin": 1291, "end": 1489, "idx": 9}, {"begin": 1490, "end": 1703, "idx": 10}, {"begin": 1704, "end": 1934, "idx": 11}, {"begin": 1935, "end": 2022, "idx": 12}, {"begin": 2023, "end": 2145, "idx": 13}, {"begin": 2146, "end": 2674, "idx": 14}, {"begin": 2675, "end": 2849, "idx": 15}, {"begin": 2850, "end": 3046, "idx": 16}, {"begin": 3047, "end": 3297, "idx": 17}, {"begin": 3298, "end": 3445, "idx": 18}, {"begin": 3446, "end": 3588, "idx": 19}, {"begin": 3589, "end": 3686, "idx": 20}, {"begin": 3687, "end": 3841, "idx": 21}, {"begin": 3842, "end": 3999, "idx": 22}, {"begin": 4000, "end": 4104, "idx": 23}, {"begin": 4119, "end": 4400, "idx": 24}, {"begin": 4401, "end": 4436, "idx": 25}, {"begin": 4437, "end": 4502, "idx": 26}, {"begin": 4503, "end": 4512, "idx": 27}, {"begin": 4513, "end": 4600, "idx": 28}, {"begin": 4601, "end": 4715, "idx": 29}, {"begin": 4723, "end": 4882, "idx": 30}, {"begin": 4883, "end": 5053, "idx": 31}, {"begin": 5054, "end": 5293, "idx": 32}, {"begin": 5294, "end": 5438, "idx": 33}, {"begin": 5439, "end": 5603, "idx": 34}, {"begin": 5604, "end": 5780, "idx": 35}, {"begin": 5781, "end": 5831, "idx": 36}, {"begin": 5832, "end": 6098, "idx": 37}, {"begin": 6099, "end": 6257, "idx": 38}, {"begin": 6258, "end": 6464, "idx": 39}, {"begin": 6471, "end": 6606, "idx": 40}, {"begin": 6607, "end": 6745, "idx": 41}, {"begin": 6746, "end": 6830, "idx": 42}, {"begin": 6831, "end": 6981, "idx": 43}, {"begin": 6982, "end": 7130, "idx": 44}, {"begin": 7131, "end": 7225, "idx": 45}, {"begin": 7226, "end": 7350, "idx": 46}, {"begin": 7351, "end": 7483, "idx": 47}, {"begin": 7484, "end": 7529, "idx": 48}, {"begin": 7530, "end": 7583, "idx": 49}, {"begin": 7584, "end": 7646, "idx": 50}, {"begin": 7647, "end": 7715, "idx": 51}, {"begin": 7716, "end": 7766, "idx": 52}, {"begin": 7767, "end": 7929, "idx": 53}, {"begin": 7930, "end": 8124, "idx": 54}, {"begin": 8125, "end": 8301, "idx": 55}, {"begin": 8302, "end": 8385, "idx": 56}, {"begin": 8396, "end": 8543, "idx": 57}, {"begin": 8544, "end": 8714, "idx": 58}, {"begin": 8715, "end": 8873, "idx": 59}, {"begin": 8874, "end": 8998, "idx": 60}, {"begin": 8999, "end": 9172, "idx": 61}, {"begin": 9180, "end": 9279, "idx": 62}, {"begin": 9280, "end": 9430, "idx": 63}, {"begin": 9431, "end": 9557, "idx": 64}, {"begin": 9558, "end": 9735, "idx": 65}, {"begin": 9736, "end": 9998, "idx": 66}, {"begin": 9999, "end": 10099, "idx": 67}, {"begin": 10100, "end": 10297, "idx": 68}, {"begin": 10298, "end": 10373, "idx": 69}, {"begin": 10383, "end": 10477, "idx": 70}, {"begin": 10478, "end": 10646, "idx": 71}, {"begin": 10647, "end": 10856, "idx": 72}, {"begin": 10857, "end": 10976, "idx": 73}, {"begin": 10977, "end": 11103, "idx": 74}, {"begin": 11104, "end": 11245, "idx": 75}, {"begin": 11246, "end": 11286, "idx": 76}, {"begin": 11287, "end": 11419, "idx": 77}, {"begin": 11420, "end": 11699, "idx": 78}, {"begin": 11700, "end": 12096, "idx": 79}, {"begin": 12097, "end": 12169, "idx": 80}, {"begin": 12170, "end": 12318, "idx": 81}, {"begin": 12319, "end": 12586, "idx": 82}, {"begin": 12587, "end": 12603, "idx": 83}, {"begin": 12604, "end": 12713, "idx": 84}, {"begin": 12714, "end": 12878, "idx": 85}, {"begin": 12879, "end": 13077, "idx": 86}, {"begin": 13078, "end": 13185, "idx": 87}, {"begin": 13186, "end": 13309, "idx": 88}, {"begin": 13310, "end": 13346, "idx": 89}, {"begin": 13347, "end": 13405, "idx": 90}, {"begin": 13406, "end": 13643, "idx": 91}, {"begin": 13644, "end": 13767, "idx": 92}, {"begin": 13768, "end": 13889, "idx": 93}, {"begin": 13890, "end": 13991, "idx": 94}, {"begin": 13992, "end": 14028, "idx": 95}, {"begin": 14029, "end": 14191, "idx": 96}, {"begin": 14192, "end": 14261, "idx": 97}, {"begin": 14262, "end": 14471, "idx": 98}, {"begin": 14472, "end": 14568, "idx": 99}, {"begin": 14569, "end": 14674, "idx": 100}, {"begin": 14675, "end": 14847, "idx": 101}, {"begin": 14848, "end": 14991, "idx": 102}, {"begin": 14992, "end": 15126, "idx": 103}, {"begin": 15127, "end": 15230, "idx": 104}, {"begin": 15231, "end": 15396, "idx": 105}, {"begin": 15397, "end": 15715, "idx": 106}, {"begin": 15716, "end": 15826, "idx": 107}, {"begin": 15827, "end": 16001, "idx": 108}, {"begin": 16002, "end": 16148, "idx": 109}, {"begin": 16149, "end": 16334, "idx": 110}, {"begin": 16335, "end": 16481, "idx": 111}, {"begin": 16482, "end": 16619, "idx": 112}, {"begin": 16620, "end": 16750, "idx": 113}, {"begin": 16751, "end": 16915, "idx": 114}, {"begin": 16929, "end": 17212, "idx": 115}, {"begin": 17213, "end": 17342, "idx": 116}, {"begin": 17343, "end": 17577, "idx": 117}, {"begin": 17578, "end": 17861, "idx": 118}, {"begin": 17862, "end": 18006, "idx": 119}, {"begin": 18007, "end": 18158, "idx": 120}, {"begin": 18159, "end": 18247, "idx": 121}, {"begin": 18248, "end": 18457, "idx": 122}, {"begin": 18458, "end": 18622, "idx": 123}, {"begin": 18623, "end": 18819, "idx": 124}, {"begin": 18820, "end": 18929, "idx": 125}, {"begin": 18930, "end": 18965, "idx": 126}, {"begin": 18966, "end": 19141, "idx": 127}, {"begin": 19142, "end": 19293, "idx": 128}, {"begin": 19294, "end": 19474, "idx": 129}, {"begin": 19475, "end": 19545, "idx": 130}, {"begin": 19546, "end": 19623, "idx": 131}, {"begin": 19624, "end": 19731, "idx": 132}, {"begin": 19732, "end": 20049, "idx": 133}], "ReferenceToFigure": [{"begin": 10496, "end": 10497, "idx": 0}, {"begin": 10749, "end": 10750, "idx": 1}, {"begin": 17080, "end": 17081, "idx": 2}, {"begin": 17209, "end": 17210, "idx": 3}], "Div": [{"begin": 83, "end": 1197, "idx": 0}, {"begin": 1200, "end": 4104, "idx": 1}, {"begin": 4106, "end": 4715, "idx": 2}, {"begin": 4717, "end": 6464, "idx": 3}, {"begin": 6466, "end": 8385, "idx": 4}, {"begin": 8387, "end": 9172, "idx": 5}, {"begin": 9174, "end": 10373, "idx": 6}, {"begin": 10375, "end": 16915, "idx": 7}, {"begin": 16917, "end": 20049, "idx": 8}], "SectionMain": [{"begin": 1197, "end": 20049, "idx": 0}]}}