{"text": "Racial Bias in Hate Speech and Abusive Language Detection Datasets\n\nAbstract:\nTechnologies for abusive language detection are being developed and applied with little consideration of their potential biases. We examine racial bias in five different sets of Twitter data annotated for hate speech and abusive language. We train classifiers on these datasets and compare the predictions of these classifiers on tweets written in African-American English with those written in Standard American English. The results show evidence of systematic racial bias in all datasets, as classifiers trained on them tend to predict that tweets written in African-American English are abusive at substantially higher rates. If these abusive language detection systems are used in the field they will therefore have a disproportionate negative impact on African-American social media users. Consequently, these systems may discriminate against the groups who are often the targets of the abuse we are trying to detect.\n\n\n1 Introduction\nRecent work has shown evidence of substantial bias in machine learning systems, which is typically a result of bias in the training data. This includes both supervised (Blodgett and O'Connor, 2017; Tatman, 2017; Kiritchenko and Mohammad, 2018; De-Arteaga et al., 2019) and unsupervised natural language processing systems (Bolukbasi et al., 2016; Caliskan et al., 2017; Garg et al., 2018). Machine learning models are currently being deployed in the field to detect hate speech and abusive language on social media platforms including Facebook, Instagram, and Youtube. The aim of these models is to identify abusive language that directly targets certain individuals or groups, particularly people belonging to protected categories (Waseem et al., 2017). Bias may reduce the accuracy of these models, and at worst, will mean that the models actively discriminate against the same groups they are designed to protect.\nOur study focuses on racial bias in hate speech and abusive language detection datasets (Waseem, 2016; Waseem and Hovy, 2016; Davidson et al., 2017; Golbeck et al., 2017; Founta et al., 2018), all of which use data collected from Twitter. We train classifiers using each of the datasets and use a corpus of tweets with demographic information to compare how each classifier performs on tweets written in African-American English (AAE) versus Standard American English (SAE) (Blodgett et al., 2016). We use bootstrap sampling (Efron and Tibshirani, 1986) to estimate the proportion of tweets in each group that each classifier assigns to each class. We find evidence of systematic racial biases across all of the classifiers, with AAE tweets predicted as belonging to negative classes like hate speech or harassment significantly more frequently than SAE tweets. In most cases the bias decreases in magnitude when we condition on particular keywords which may indicate membership in negative classes, yet it still persists. We expect that these biases will result in racial discrimination if classifiers trained on any of these datasets are deployed in the field.\n\n2 Related works\nScholars and practitioners have recently been devoting more attention to bias in machine learning models, particularly as these models are becoming involved in more and more consequential decisions (Athey, 2017). Bias often derives from the data used to train these mod-els. For example, Buolamwini and Gebru (2018) show how facial recognition technologies perform worse for darker-skinned people, particularly darker-skinned women, due to the disproportionate presence of white, male faces in the training data. Natural language processing systems also inherit biases from the data they were trained on. For example, in unsupervised learning, word embeddings often contain biases (Bolukbasi et al., 2016; Caliskan et al., 2017; Garg et al., 2018) which persist even after attempts to remove them (Gonen and Goldberg, 2019). There are many examples of bias in supervised learning contexts: YouTube's captioning models make more errors when transcribing women (Tatman, 2017), AAE is more likely to be misclassified as non-English by widely used language classifiers (Blodgett and O'Connor, 2017), numerous gender and racial biases exist in sentiment classification systems (Kiritchenko and Mohammad, 2018), and errors in both co-reference resolution systems and occupational classification models reflect gendered occupational patterns (Zhao et al., 2018; De-Arteaga et al., 2019).\nWhile hate speech and abusive language detection has become an important area for natural language processing research (Schmidt and Wiegand, 2017; Waseem et al., 2017; Fortuna and Nunes, 2018), there has been little work addressing the potential for these systems to be biased. The danger posed by bias in such systems is, however, particularly acute, since it could result in negative impacts on the same populations the systems are designed to protect. For example, if we mistakenly consider speech by a targeted minority group as abusive we might unfairly penalize the victim, but if we fail to identify abuse against them we will be unable to take action against the perpetrator. Although no model can perfectly avoid such problems, we should be particularly concerned about the potential for such models to be systematically biased against certain social groups, particularly protected classes.\nA number of studies have shown that false positive cases of hate speech are associated with the presence of terms related to race, gender, and sexuality (Kwok and Wang, 2013; Burnap and Williams, 2015; Davidson et al., 2017). While not directly measuring bias, prior work has explored how annotation schemes (Davidson et al., 2017) and the identity of the annotators (Waseem, 2016) might be manipulated to help to avoid bias.  Dixon et al. (2018) directly measured biases in the Google Perspective API classifier, 1 trained on data from Wikipedia talk comments, finding that it tended to give high toxicity scores to innocuous statements like \"I am a gay man\". They called this \"false positive bias\", caused by the model overgeneralizing from the training data, in this case from examples where \"gay\" was used pejoratively. They find that a number of such \"identity terms\" are disproportionately represented in the examples labeled as toxic.  Park et al. (2018) build upon this study, using templates to study gender differences in performance across two hate speech and abusive language detection datasets. They find that classifiers trained on these data tend to perform worse when female identity terms used, indicating gender bias in performance. We build upon this work by auditing a series of abusive language and hate speech detection datasets for racial biases. We evaluate how classification models trained on these datasets perform in the field, comparing their predictions for tweets written in language used by whites or African-Americans.\n\n3 Research design\n\n\n3.1 Hate speech and abusive language datasets\nWe focus on Twitter, the most widely used data source in abusive language research. We use all available datasets where tweets are labeled as various types of abuse and are written in English. We now briefly describe each of these datasets in chronological order.  Waseem and Hovy (2016) collected 130k tweets containing one of seventeen different terms or phrases they considered to be hateful. They then annotated a sample of these tweets themselves, using guidelines inspired by critical race theory. These annotators were then reviewed by \"a 25 year old woman studying gender studies and a nonactivist feminist\" to check for bias. This dataset consists of 16,849 tweets labeled as either racism, sexism, or neither. Most of the tweets categorized as sexist relate to debates over an Australian TV show and most of those considered as racist are anti-Muslim.\nTo account for potential bias in the previous dataset, Waseem (2016) relabeled 2876 tweets in the dataset, along with a new sample from the tweets originally collected. The tweets were annotated by \"feminist and anti-racism activists\", based upon the assumption that they are domain-experts. A fourth category, racism and sexism was also added to account for the presence of tweets which exhibit both types of abuse. The dataset contains 6,909 tweets.  Davidson et al. (2017) collected tweets containing terms from the Hatebase, 2 a crowdsourced hate speech lexicon, then had a sample coded by crowdworkers located in the United States. To avoid false positives that occurred in prior work which considered all uses of particular terms as hate speech, crowdworkers were instructed not to make their decisions based upon any words or phrases in particular, no matter how offensive, but on the overall tweet and the inferred context. The dataset consists of 24,783 tweets annotated as hate speech, offensive language, or neither.  Golbeck et al. (2017) selected tweets using ten keywords and phrases related to anti-black racism, Islamophobia, homophobia, anti-semitism, and sexism. The authors developed a coding scheme to distinguish between potentially offensive content and serious harassment, such as threats or hate speech. After an initial round of coding, where tweets were assigned to a number of different categories, they simplified their analysis to include a binary harassment or non-harassment label for each tweet. The dataset consists of 20,360 tweets, each hand-labeled by the authors. 3 ounta et al. ( 2018) constructed a dataset intended to better approximate a real-world setting where abuse is relatively rare. They began with a random sample of tweets then augmented it by adding tweets containing one or more terms from the Hatebase lexicon and that had negative sentiment. They criticized prior work for defining labels in an ad hoc manner. To develop a more comprehensive annotation scheme they initially labeled a sample of tweets, allowing each tweet to belong to multiple classes. After analyzing the overlap between different classes they settled on a coding scheme with four distinct classes: abusive, hateful, spam, and normal. We use a dataset they published containing 91,951 tweets coded into these categories by crowdworkers.\n\n3.2 Training classifiers\nFor each dataset we train a classifier to predict the class of unseen tweets. We use regularized logistic regression with bag-of-words features, a commonly used approach in the field. While we expect that we could improve predictive performance by using more sophisticated classifiers, we expect that any bias is likely a function of the training data itself rather than the classifier. Moreover, although features like word embeddings can work well for this task (Djuric et al., 2015) we wanted to avoid inducing any bias in our models by using pre-trained embeddings (Park et al., 2018). We pre-process each tweet by removing excess white-space and replacing URLs and mentions with placeholders. We then tokenize them, stem each token, and construct n-grams with a maximum length of three. Next we transform each dataset into a TF-IDF matrix, with a maximum of 10,000 features. We use 80% of each dataset to train models and hold out the remainder for validation. Each model is trained using stratified 5fold cross-validation. We conduct a grid-search over different regularization strength parameters to identify the best performing model. Finally, for each dataset we identify the model with the best average F1 score and retrain it using all of the training data. The performance of these models on the 20% held-out validation data is reported in Table 1. Overall we see varying performance across the classifiers, with some performing much were added to the dataset released by the authors. Some of the tweets in this dataset are duplicates: if all versions of a duplicated tweet were coded in the same way by the majority of coders we retained one copy and deleted the rest; if the labels disagreed we removed all copies.\nbetter out-of-sample than others. In particular, we see that hate speech and harassment are particularly difficult to detect. Since we are primarily interested in within classifier, between corpora performance, any variation between classifiers should not impact our results.\n\n3.3 Race dataset\nWe use a dataset of tweets labeled by race from Blodgett et al. (2016) to measure racial biases in these classifiers. They collected geolocated tweets in the U.S. and matched them with demographic data from the Census on the population of non-Hispanic whites, non-Hispanic blacks, Hispanics, and Asians in the block group where the tweets originated. They then identified words associated with particular demographics and trained a probabilistic mixed-membership language model. This model learns demographicallyaligned language models for each of the four demographic categories and is used to calculate the posterior proportion of language from each category in each tweet. Their validation analyses indicate that tweets with a high posterior proportion of non-Hispanic black language exhibit lexical, phonological, and syntactic variation consistent with prior research on AAE. Their publiclyavailable dataset contains 59.2 million tweets.\nWe define a user as likely non-Hispanic black if the average posterior proportion across all of their tweets for the non-Hispanic black language model is ≥ 0.80 (and ≤ 0.10 Hispanic and Asian combined) and as non-Hispanic white using the same formula but for the white language model. 5 This allows us to restrict our analysis to tweets written by users who predominantly use one of the language models. Due to space constraints we discard users who predominantly use either the Hispanic or the Asian language model. This results in a set of 1.1m tweets written by people who generally use non-Hispanic black language and 14.5m tweets written by users who tend to use non-Hispanic white language. Following Blodgett and O'Connor (2017), we call these datasets black-aligned and white-aligned tweets, reflecting 5 We use this threshold following Blodgett and O'Connor (2017) and after consulting with the lead author. While these cut-offs should provide high confidence that the users tend to use AAE or SAE, and hence serve as a proxy for race, it is important to note that not all African-Americans use AAE and that not all AAE users are African-American, although use of the AAE dialect suggests a social proximity to or affinity for African-American communities (Blodgett et al., 2016) the fact that they contain language associated with either demographic category but which may not all be produced by members of these categories. We now describe how we use these data in our experiments.\n\n3.4 Experiments\nWe examine whether the probability that a tweet is predicted to belong to a particular class varies in relation to the racial alignment of the language it uses. The null hypothesis of no racial bias is that the probability a tweet will belong to a negative class is independent of the racial group the tweet's author is a member of. Formally, for class c i , where c i = 1 denotes membership in the class and c i = 0 the opposite, we aim to test H N :P (c i = 1|black) = P (c i = 1|white). If P (c i = 1|black) > P (c i = 1|white\n) and the difference is statistically significant then we can reject the null hypothesis H N in favor of the alternative hypothesis H A that black-aligned tweets are classified into c i at a higher rate than white-aligned tweets. Conversely, if P (c i = 1|black) < P (c i = 1|white) we can conclude that the classifier is more likely to classify white-aligned tweets as c i . We should expect that white-aligned tweets are more likely to use racist language or hate speech than blackaligned tweets, given that African-Americans are often targeted with racism and hate speech by whites. However for some classes like sexism we have no reason to expect there to be racial differences in either direction.\nTo test this hypothesis we use bootstrap sampling (Efron and Tibshirani, 1986) to estimate the proportion of tweets in each dataset that each classifier predicts to belong to each class. We draw n random samples with replacement of k tweets from each of the two race corpora, where n = k = 1000. For each sample we use each classifier to predict the class membership of each tweet, then store the proportion of tweets that were assigned to each class, p i . For each classifier-class pair, we thus obtain a pair of vectors, one for each corpus, each containing n sampled proportions. The bootstrap estimates for the proportion of tweets belonging to class i for each group, p i black and p i white , are calculated by taking the mean of the elements in each vector: dicate that black-aligned tweets are classified as belonging to class i at a higher rate than whitealigned tweets.\nWe also conduct a second experiment, where we assess whether there is racial bias conditional upon a tweet containing a keyword likely to be associated with a negative class. While differences in language will undoubtedly remain, this should help to account for the possibility that results in Experiment 1 are driven by differences in the true distribution of the different classes of interest, or of words associated with these classes, in the two corpora. For classifier c and category i, we evaluate H N : P (c i = 1|black, t) = P (c i = 1|white, t) for a given term t. We conduct this experiment for two different terms, each of which occurs frequently enough in the data to enable our bootstrapping approach. We select the term \"n*gga\", since it is a particularly prevalent source of false positives for hate speech detection (Kwok and Wang, 2013; Davidson et al., 2017; Waseem et al., 2018). 6 In this case, we expect that tweets containing the word should be classified as more negative when used by whites, thusH A 1 : P (c i = 1|black, t) < P (c i = 1|white, t).\nThe other alternative, H A 2 : P (c i = 1|black, t) > P (c i = 1|white, t) would indicate that blackaligned tweets containing the term are penalized at a higher rate than comparable white-aligned tweets. We also assess the results for the word \"b*tch\" since it is a widely used sexist term, which is often also used casually, but we have no theoretical reason to expect there to be racial differences in its usage. The term \"n*gga\" was used in around 2.25% of black-aligned and 0.15% of white-aligned tweets. The term \"b*tch\" was used in 1.7% of black-aligned and 0.5% of whitealigned tweets. The substantial differences in the distributions for these two terms alone are consistent with our intuition that some of the results in Experiment 1 may be driven by differences in the frequencies of words associated with negative classes in the training datasets. Since we are using a subsample of the available data, we use smaller bootstrap samples, drawing k = 100 tweets each time.\n\n4 Results\nThe results of Experiment 1 are shown in Table 2. We observe substantial racial disparities in the performance of all classifiers. In all but one of the comparisons, there are statistically significant (p < 0.001) differences and in all but one of these we see that tweets in the black-aligned corpus are assigned negative labels more frequently than those by whites. The only case where blackaligned tweets are classified into a negative class less frequently than white-aligned tweets is the racism class in the Waseem and Hovy (2016) classifier. Note, however, the extremely low rate at which tweets are predicted to belong to this class for both groups. On the other hand, this classifier is 1.7 times more likely to classify tweets in the black-aligned corpus as sexist. For Waseem (2016) we see that there is no significant difference in the estimated rates at which tweets are clas-sified as racist across groups, although the rates remain low. Tweets in the black-aligned corpus are classified as containing sexism almost twice as frequently and 1.1 times as frequently classified as containing racism and sexism compared to those in the white-aligned corpus. Moving onto Davidson et al. (2017), we find large disparities, with around 5% of tweets in the black-aligned corpus classified as hate speech compared to 2% of those in the white-aligned set. Similarly, 17% of black-aligned tweets are predicted to contain offensive language compared to 6.5% of whitealigned tweets. The classifier trained on the Golbeck et al. ( 2017) dataset predicts black-aligned tweets to be harassment 1.4 times as frequently as white-aligned tweets. The Founta et al. (2018) classifier labels around 11% of tweets in the blackaligned corpus as hate speech and almost 18% as abusive, compared to 6% and 8% of white-aligned tweets respectively. It also classifies black-aligned tweets as spam 1.8 times as frequently.\nThe results of Experiment 2 are consistent with the previous results, although there are some notable differences. In most cases the racial disparities persist, although they are generally smaller in magnitude and in some cases the direction even changes. Table 3 shows that for tweets containing the word \"n*gga\", classifiers trained on Waseem and Hovy (2016) and Waseem (2016) are both predict black-aligned tweets to be instances of sexism approximately 1.5 times as often as white-aligned tweets. The classifier trained on the Davidson et al. (2017) data is significantly less likely to classify black-aligned tweets as hate speech, although it is more likely to classify them as offensive.  Golbeck et al. (2017) classifies black-aligned tweets as harassment at a higher rate for both groups than in the previous experiment, although the disparity is narrower. For the Founta et al. (2018) classifier we see that black-aligned tweets are slightly less frequently considered to be hate speech but are much more frequently classified as abusive.\nThe results for the second variation of Experiment 2 where we conditioned on the word \"b*tch\" are shown in Table 4. We see similar results for Waseem and Hovy (2016) and Waseem (2016). In both cases the classifiers trained upon their data are still more likely to flag black-aligned tweets as sexism. The Waseem and Hovy (2016) classifier is particularly sensitive to the word \"b*tch\" with 96% of black-aligned and 94% of white-aligned tweets predicted to belong to this class. For Davidson et al. (2017) almost all of these tweets are classified as offensive, however those in the blackaligned corpus are 1.15 times as frequently classified as hate speech. We see a very similar result for Golbeck et al. (2017) compared to the previous experiment, with black-aligned tweets flagged as harassment at 1.1 times the rate of those in the white-aligned corpus. Finally, for the Founta et al. (2018) classifier we see a substantial racial disparity, with black-aligned tweets classified as hate speech at 2.7 times the rate of white aligned ones, a higher rate than in Experiment 1.\n\n5 Discussion\nOur results demonstrate consistent, systematic and substantial racial biases in classifiers trained on all five datasets. In almost every case, black-aligned tweets are classified as sexism, hate speech, harassment, and abuse at higher rates than whitealigned tweets. To some extent, the results in the first experiment may be driven by underlying differences in the rates at which speakers of different dialects use particular words and phrases associated with these negative classes in the training data. For example, the word \"n*gga\" appears fifteen times as frequently in the black-aligned corpus compared to the white-aligned corpus. 7 owever, the second experiment shows that these disparities tend to persist even when comparing tweets containing keywords likely to be associated with negative classes. While some of the remaining disparities are likely due to differences in the distributions of other keywords we did not condition on, we expect that other more innocuous aspects of black-aligned language may be associated with negative labels in the training data, leading classifiers to disproportionately predict that tweets by African-Americans belong to negative classes. We now discuss the results as they pertain to each of the datasets used.\nClassifiers trained on data from Waseem and Hovy (2016) and Waseem (2016) only predicted a small fraction of the tweets to be racism. We suspect that this is due to the composition of their dataset, since the majority of the racist training examples consist of anti-Muslim rather than anti-   black language. Across both datasets the words \"n*gger\" and \"n*gga\" appear in 4 and 10 tweets respectively. Looking at the sexism class on the other hand, we see that both models were consistently classifying tweets in the black-aligned corpus as sexism at a substantially higher rate than those in the white-aligned corpus. Given this result, and the gender biases identified in these data by Park et al. (2018), it not apparent that the purportedly expert annotators were any less biased than amateur annotators (Waseem, 2016).\nThe classifier trained on Davidson et al. (2017) shows the largest disparities in Experiment 1, with tweets in the black-aligned corpus classified as hate speech and offensive language at substantially higher rates than white-aligned tweets. We expect that this result occurred for two reasons. First, the dataset contains a large number of cases where AAE is used (Waseem et al., 2018). Second, many of the AAE tweets also use words like \"n*gga\" and \"b*tch\", and are thus frequently associated with the hate speech and offensive classes, resulting in \"false positive bias\" (Dixon et al., 2018). On the other hand, the distinction between hate speech and offensive language appears to hold up to scrutiny: while a large proportion of tweets in Experiment 2 containing the word \"n*gga\" are classified as hate speech, the rate is substantially higher for white-aligned tweets. Without this category we expect that many of the tweets classified as offensive would instead be mistakenly classified as hate speech.\nTurning to the Golbeck et al. (2017) classifer we found that tweets in the black-aligned dataset were significantly more likely to be classified as harassment in all experiments, although the disparity decreased substantially after conditioning on certain keywords. It seems likely that their simple binary labelling scheme may not be sufficient to capture the variation in language used, resulting in high rates of false positives.\nFinally, Founta et al. (2018) is the largest and perhaps the most comprehensive of the available datasets. In Experiment 1 we see that this clas-sifier has the second highest rates of racial disparities, classifying black-aligned tweets as hate speech, abusive, and spam at substantially higher rates than white-aligned tweets. In Experiment 2 the classifier is slightly less likely to classify black-aligned tweets containing the word \"n*gga\" as hate speech but is 2.7 times more likely to predict that black-aligned tweets using \"b*tch\" belong to this category.\n\n6 Conclusion\nOur study is the first to measure racial bias in hate speech and abusive language detection datasets. We find evidence of substantial racial bias in all of the datasets tested. This bias tends to persist even when comparing tweets containing certain relevant keywords. While these datasets are still valuable for academic research, we caution against using them in the field to detect and particularly to take enforcement action against different types of abusive language. If they are used in this way we expect that they will systematically penalize African-Americans more than whites, resulting in racial discrimination. We have not evaluated these datasets for bias related to other ethnic and racial groups, nor other protected categories like gender and sexuality, but expect that such bias is also likely to exist. We recommend that efforts to measure and mitigate bias should start by focusing on how bias enters into datasets as they are collected and labeled. In particular, future work should focus on the following three areas.\nFirst, we expect that some biases emerge at the point of data collection. Some studies sampled tweets using small, ad hoc sets of keywords created by the authors (Waseem and Hovy, 2016; Waseem, 2016; Golbeck et al., 2017), an approach demonstrated to produce poor results (King et al., 2017). Others start with large crowdsourced dictionaries of keywords, which tend to include many irrelevant terms, resulting in high rates of false positives (Davidson et al., 2017; Founta et al., 2018). In both cases, by using keywords to identify relevant tweets we are likely to get non-representative samples of training data that may over-or under-represent certain communities. In particular, we need to consider whether the linguistic markers we use to identify potentially abusive language may be associated with language used by members of protected categories. For example, although Davidson et al. (2017) started with thousands of terms from the Hatebase lexicon, AAE is over-represented in the dataset (Waseem et al., 2018) because some keywords associated with this speech community were used more frequently on Twitter than other keywords in the lexicon and were consequentially over-sampled.\nSecond, we expect that the people who annotate data have their own biases. Since individual biases in reflect societal prejudices, they aggregate into systematic biases in training data. The datasets considered here relied upon a range of different annotators, from the authors (Golbeck et al., 2017; Waseem and Hovy, 2016) and crowdworkers (Davidson et al., 2017; Founta et al., 2018) to activists (Waseem, 2016). Even the classifier trained on expert-labeled data (Waseem, 2016) flags black-aligned tweets as sexist at almost twice the rate of white-aligned tweets. While we agree that there is value in working with domain-experts to annotate data, these results suggest that activists may be prone to similar biases as academics and crowdworkers. Further work is therefore necessary to better understand how to integrate expertise into the process and how training can be used to help to mitigate bias. We also need to consider how sociocultural context influences annotators' decisions. For example, 48% of the workers employed by Founta et al. (2018) were located in Venezuela but the authors did not consider whether this affected their results (or if the annotators understood English sufficiently for the task). Third, we observed substantial variation in the rates of class membership across classifiers and datasets. In Experiment 1 the rate at which tweets were assigned to negative classes varied from 1% to 18%. Some of the low proportions may indicate a preponderance of false negatives due to a lack of training data, suggesting that these models may not be able to sufficiently generalize beyond the data they were trained on. The high proportions may signal too many false positives, which may a result of the over-sampling of abusive language in labeled datasets.  Founta et al. (2018) claim that, on average, between 0.1% and 3% of tweets are abusive, depending upon the category of abuse. Identifying such content is therefore a highly imbalanced classification problem. When labeling datasets and evaluating our models we must pay more attention to the baseline rates of usage of different types of abusive language and how they may vary across populations (Silva et al., 2016).\nFinally, we need to more carefully consider how contextual factors interact with linguistic subtleties and our definitions of abuse. The \"n-word\" is a particularly useful illustration of this issue. It exhibits polysemy, as it can be extremely racist or quotidian, depending on the speaker, the context, and the spelling. While the history of the word and its usages is too complex to be summarized here (Neal, 2013), when used with the \"er\" suffix it is generally considered to be a racist ephiphet, associated with white supremacy. Prior work has confirmed that the use of this variant online is generally considered to be hateful (Kwok and Wang, 2013), although not always the case, for example when a victim of abuse shares an insult they have received. However the variant with the \"-a\" suffix is typically used innocuously by African-Americans (Kwok and Wang, 2013), indeed our results indicate that it is used far more frequently in black-aligned tweets (although it is still used by many white people). 8 Despite this distinction, some studies have considered this variant to be hateful (Silva et al., 2016; Alorainy et al., 2018). This approach results in high rates of false positive cases of hate speech, thus Davidson et al. (2017) included a class for offensive language which does not appear to be hateful and let annotators decide which class tweets belonged to based upon their interpretation of the context, many of whom labeled tweets containing the term as offensive.  Waseem et al. (2018) criticized this decision, claiming that it is problematic to ever consider the word to be offensive due to its widespread use among AAE speakers. This critique appears to be reasonable in the sense that we should not penalize African-Americans for using the word, but it avoids grappling with how to act when the word is used by other speakers and in other contexts. What should be done if it is used by a white social media user in reference to a black user? How should the context of their interaction and the nature of their relationship affect our decision?\nA \"one-size-fits-all\", context-independent approach to defining and detecting abusive language is clearly inappropriate. Different communities have different speech norms, such that a model suitable for one community may discriminate against another. However there is no con-sensus in the field on how and if we can develop detection systems sensitive to different social and cultural contexts. In addition to our recommendations for improving training data, we emphasize the necessity of considering how context matters and how detection systems will have uneven effects across different communities.\n\n7 Limitations\nFirst, while the Blodgett et al. ( 2016) dataset is the best available source of tweets labeled as AAE, we do not have ground truth labels for the racial identities of the authors. By filtering on users who predominantly used one type of language we may also miss users who may frequently codeswitch between AAE and SAE. Second, although we roughly approximate this in Experiment 2, we cannot rule out the possibility that the results, rather than evidence of bias, are a function of different distributions of negative classes in the corpora studied. It is possible that words associated with negative categories in our abusive language datasets are also used to predict race by Blodgett et al. (2016), potentially contributing to the observed disparities. To more thoroughly investigate this issue we therefore require ground truth labels for abuse and race. Third, the results may vary for different classifiers or feature sets. It is possible that more sophisticated modeling approaches could enable us to alleviate bias, although they could also exacerbate it. Fourth, we did not interpret the results of the classifiers to determine why they made particular predictions. Further work is needed to identify what features of AAE the classifiers are learning to associate with negative classes. Finally, this study has only focused on one dimension of racial bias. Further work is necessary to assess the degree to investigate the extent to which data and models are biased against people belonging to other protected categories.\n\nFootnotes:\n1: https://www.perspectiveapi.com\n2: https://hatebase.org/\n3: The paper describes 35k tweets but there were many duplicates in this dataset which were removed from the dataset the authors made available.\n4: 4  They describe 80k tweets in the paper but more tweets\n6: We also planned to conduct the same analysis using the \"-er\" suffix, however the sample was too small, with the word being used in 555 tweets in the white-aligned corpus (0.004%) and 61 in the black-aligned corpus (0.005%).\n7: It is also possible that these disparities are amplified by the Blodgett et al. (2016) model, which constructs the posterior proportions of different language models in part by exploiting underlying differences in word frequencies associated with the different demographic categories.\n8: This spelling also exhibits derhotacization, a phonological feature of AAE (Blodgett et al., 2016).\n\nReferences:\n\n- Wafa Alorainy, Pete Burnap, Han Liu, Amir Javed, and Matthew L. Williams. 2018. Suspended Ac- counts: A Source of Tweets with Disgust and Anger Emotions for Augmenting Hate Speech Data Sam- ple. In 2018 International Conference on Machine Learning and Cybernetics (ICMLC), pages 581- 586, Chengdu. IEEE.- Susan Athey. 2017. Beyond prediction: Using big data for policy problems. Science, 355(6324):483-485.\n\n- Su Lin Blodgett, Lisa Green, and Brendan O'Connor. 2016. Demographic Dialectal Variation in Social Media: A Case Study of African-American English. In Proceedings of the 2016 Conference on Empiri- cal Methods in Natural Language Processing, pages 1119-1130, Austin, Texas. Association for Compu- tational Linguistics.\n\n- Su Lin Blodgett and Brendan O'Connor. 2017. Racial disparity in natural language processing: A case study of social media african-american english. In Fairness, Accountability, and Transparency in Ma- chine Learning (FAT/ML) workshop.\n\n- Tolga Bolukbasi, Kai-Wei Chang, James Y Zou, Venkatesh Saligrama, and Adam T Kalai. 2016. Man is to Computer Programmer as Woman is to Homemaker? Debiasing Word Embeddings. In 30th Conference on Neural Information Processing Sys- tems, page 9, Barcelona, Spain.\n\n- Joy Buolamwini and Timnit Gebru. 2018. Gender Shades: Intersectional Accuracy Disparities in Com- mercial Gender Classication. In Proceedings of Ma- chine Learning Research, volume 81, pages 1-15.\n\n- Pete Burnap and Matthew L. Williams. 2015. Cyber hate speech on twitter: An application of machine classification and statistical modeling for policy and decision making. Policy & Internet, 7(2):223-242.\n\n- Aylin Caliskan, Joanna J. Bryson, and Arvind Narayanan. 2017. Semantics derived automatically from language corpora contain human-like biases. Science, 356(6334):183-186.\n\n- Thomas Davidson, Dana Warmsley, Michael Macy, and Ingmar Weber. 2017. Automated Hate Speech Detection and the Problem of Offensive Language. In Proceedings of the 11th International Conference on Web and Social Media (ICWSM), pages 512-515, Montreal, Quebec, Canada.\n\n- Maria De-Arteaga, Alexey Romanov, Hanna Wal- lach, Jennifer Chayes, Christian Borgs, Alexandra Chouldechova, Sahin Geyik, Krishnaram Kentha- padi, and Adam Tauman Kalai. 2019. Bias in Bios: A Case Study of Semantic Representation Bias in a High-Stakes Setting. In Proceedings of the Confer- ence on Fairness, Accountability, and Transparency -FAT* '19, pages 120-128, Atlanta, GA, USA. ACM Press.\n\n- Lucas Dixon, John Li, Jeffrey Sorensen, Nithum Thain, and Lucy Vasserman. 2018. Measuring and Mitigat- ing Unintended Bias in Text Classification. In Pro- ceedings of the 2018 AAAI/ACM Conference on AI, Ethics, and Society -AIES '18, pages 67-73, New Orleans, LA, USA. ACM Press.\n\n- Nemanja Djuric, Jing Zhou, Robin Morris, Mihajlo Gr- bovic, Vladan Radosavljevic, and Narayan Bhamidi- pati. 2015. Hate Speech Detection with Comment Embeddings. In WWW 2015 Companion, pages 29- 30. ACM Press.\n\n- Bradley Efron and Robert Tibshirani. 1986. Bootstrap methods for standard errors, confidence intervals, and other measures of statistical accuracy. Statis- tical Science, 1(1):54-75.\n\n- Paula Fortuna and Srgio Nunes. 2018. A Survey on Automatic Detection of Hate Speech in Text. ACM Computing Surveys, 51(4):1-30.\n\n- Antigoni-Maria Founta, Constantinos Djouvas, De- spoina Chatzakou, Ilias Leontiadis, Jeremy Black- burn, Gianluca Stringhini, Athena Vakali, Michael Sirivianos, and Nicolas Kourtellis. 2018. Large Scale Crowdsourcing and Characterization of Twit- ter Abusive Behavior. In Proceedings of the Twelth International AAAI Conference on Web and Social Media, pages 491-500, Palo Alto, California, USA.\n\n- Nikhil Garg, Londa Schiebinger, Dan Jurafsky, and James Zou. 2018. Word embeddings quantify 100 years of gender and ethnic stereotypes. Pro- ceedings of the National Academy of Sciences, 115(16):E3635-E3644.\n\n- Jennifer Golbeck, Rajesh Kumar Gnanasekaran, Raja Rajan Gunasekaran, Kelly M. Hoffman, Jenny Hottle, Vichita Jienjitlert, Shivika Khare, Ryan Lau, Marianna J. Martindale, Shalmali Naik, Heather L. Nixon, Zahra Ashktorab, Piyush Ramachandran, Kristine M. Rogers, Lisa Rogers, Meghna Sardana Sarin, Gaurav Shahane, Jayanee Thanki, Priyanka Vengataraman, Zijian Wan, Derek Michael Wu, Rashad O. Banjo, Alexandra Berlinger, Siddharth Bhagwan, Cody Buntain, Paul Cheakalos, Alicia A. Geller, and Quint Gergory. 2017. A Large Labeled Corpus for Online Harassment Research. In Pro- ceedings of the 2017 ACM on Web Science Confer- ence -WebSci '17, pages 229-233, Troy, New York, USA. ACM Press.\n\n- Hila Gonen and Yoav Goldberg. 2019. Lipstick on a Pig: Debiasing Methods Cover up Systematic Gen- der Biases in Word Embeddings But do not Remove Them. In NAACL. ArXiv: 1903.03862.\n\n- Gary King, Patrick Lam, and Margaret E. Roberts. 2017. Computer-Assisted Keyword and Document Set Discovery from Unstructured Text. American Journal of Political Science, 61(4):971-988.\n\n- Svetlana Kiritchenko and Saif M. Mohammad. 2018. Examining gender and race bias in two hundred sen- timent analysis systems. In Proceedings of the 7th\n\n- Joint Conference on Lexical and Computational Se- mantics (*SEM), pages 42-53, New Orleans, LA, USA. Association for Computational Linguistics.\n\n- Irene Kwok and Yuzhou Wang. 2013. Locate the Hate: Detecting Tweets against Blacks. In Association for the Advancement of Artificial Intelligence.\n\n- Mark Anthony Neal. 2013. NIGGA: The 21st-Century Theoretical Superhero: NIGGA. Cultural Anthro- pology, 28(3):556-563.\n\n- Ji Ho Park, Jamin Shin, and Pascale Fung. 2018. Re- ducing Gender Bias in Abusive Language Detec- tion. In Proceedings of the 2018 Conference on Empirical Methods in Natural Language Process- ing, pages 2799-2804, Brussels, Belgium. ArXiv: 1808.07231.\n\n- Anna Schmidt and Michael Wiegand. 2017. A Sur- vey on Hate Speech Detection using Natural Lan- guage Processing. In Proceedings of the Fifth Inter- national Workshop on Natural Language Processing for Social Media, pages 1-10, Valencia, Spain.\n\n- Leandro Silva, Mainack Mondal, Denzil Correa, Fabr- cio Benevenuto, and Ingmar Weber. 2016. Analyz- ing the Targets of in Online Social Media. In Association for the Advancement of Artificial Intel- ligence.\n\n- Rachael Tatman. 2017. Gender and Dialect Bias in YouTube's Automatic Captions. In Proceedings of the First ACL Workshop on Ethics in Natural Lan- guage Processing, pages 53-59, Valencia, Spain. Association for Computational Linguistics.\n\n- Zeerak Waseem. 2016. Are you a racist or am I see- ing things? Annotator influence on hate speech de- tection on Twitter. In Proceedings of the 1st Work- shop on Natural Language Processing and Compu- tational Social Science, pages 138-142.\n\n- Zeerak Waseem, Thomas Davidson, Dana Warmsley, and Ingmar Weber. 2017. Understanding Abuse: A Typology of Abusive Language Detection Subtasks. In Proceedings of the 1st Workshop on Abusive Lan- guage Online (ACL 2017), pages 78-84, Vancouver, Canada.\n\n- Zeerak Waseem and Dirk Hovy. 2016. Hateful sym- bols or hateful people? predictive features for hate speech detection on twitter. In Proceedings of NAACL-HLT, pages 88-93.\n\n- Zeerak Waseem, James Thorne, and Joachim Bingel. 2018. Bridging the Gaps: Multi Task Learning for Domain Transfer of Hate Speech Detection. In Jen- nifer Goldbeck, editor, Online Harassment, Human- Computer Interaction Series, page 270. Springer, New York, NY.\n\n- Jieyu Zhao, Tianlu Wang, Mark Yatskar, Vicente Or- donez, and Kai-Wei Chang. 2018. Gender Bias in Coreference Resolution: Evaluation and Debiasing Methods. In Proceedings of the 2018 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers), pages 15- 20, New Orleans, Louisiana. Association for Com- putational Linguistics.\n\n", "annotations": {"Abstract": [{"begin": 68, "end": 1000, "idx": 0}], "Head": [{"begin": 1003, "end": 1017, "n": "1", "idx": 0}, {"begin": 3099, "end": 3114, "n": "2", "idx": 1}, {"begin": 6949, "end": 6966, "n": "3", "idx": 2}, {"begin": 6969, "end": 7014, "n": "3.1", "idx": 3}, {"begin": 10237, "end": 10261, "n": "3.2", "idx": 4}, {"begin": 12268, "end": 12284, "n": "3.3", "idx": 5}, {"begin": 14722, "end": 14737, "n": "3.4", "idx": 6}, {"begin": 18907, "end": 18916, "n": "4", "idx": 7}, {"begin": 22953, "end": 22965, "n": "5", "idx": 8}, {"begin": 27056, "end": 27068, "n": "6", "idx": 9}, {"begin": 34177, "end": 34190, "n": "7", "idx": 10}], "ReferenceToBib": [{"begin": 1186, "end": 1215, "target": "#b3", "idx": 0}, {"begin": 1216, "end": 1229, "target": "#b26", "idx": 1}, {"begin": 1230, "end": 1261, "target": "#b19", "idx": 2}, {"begin": 1262, "end": 1286, "target": "#b9", "idx": 3}, {"begin": 1340, "end": 1364, "target": "#b4", "idx": 4}, {"begin": 1365, "end": 1387, "target": "#b7", "idx": 5}, {"begin": 1388, "end": 1406, "target": "#b15", "idx": 6}, {"begin": 1750, "end": 1771, "target": "#b28", "idx": 7}, {"begin": 2023, "end": 2037, "target": "#b27", "idx": 8}, {"begin": 2038, "end": 2060, "target": "#b29", "idx": 9}, {"begin": 2061, "end": 2083, "target": "#b8", "idx": 10}, {"begin": 2084, "end": 2105, "target": "#b16", "idx": 11}, {"begin": 2106, "end": 2126, "target": "#b14", "idx": 12}, {"begin": 2409, "end": 2432, "target": "#b2", "idx": 13}, {"begin": 2460, "end": 2488, "target": "#b12", "idx": 14}, {"begin": 3313, "end": 3326, "target": "#b1", "idx": 15}, {"begin": 3403, "end": 3430, "target": "#b5", "idx": 16}, {"begin": 3796, "end": 3820, "target": "#b4", "idx": 17}, {"begin": 3821, "end": 3843, "target": "#b7", "idx": 18}, {"begin": 3844, "end": 3862, "target": "#b15", "idx": 19}, {"begin": 3912, "end": 3938, "target": "#b17", "idx": 20}, {"begin": 4074, "end": 4088, "target": "#b26", "idx": 21}, {"begin": 4287, "end": 4319, "target": "#b19", "idx": 22}, {"begin": 4450, "end": 4469, "target": "#b31", "idx": 23}, {"begin": 4470, "end": 4494, "target": "#b9", "idx": 24}, {"begin": 4615, "end": 4642, "target": "#b24", "idx": 25}, {"begin": 4643, "end": 4663, "target": "#b28", "idx": 26}, {"begin": 4664, "end": 4688, "target": "#b13", "idx": 27}, {"begin": 5549, "end": 5570, "target": "#b21", "idx": 28}, {"begin": 5571, "end": 5597, "target": "#b6", "idx": 29}, {"begin": 5598, "end": 5620, "target": "#b8", "idx": 30}, {"begin": 5704, "end": 5727, "target": "#b8", "idx": 31}, {"begin": 5763, "end": 5777, "target": "#b27", "idx": 32}, {"begin": 5823, "end": 5842, "target": "#b10", "idx": 33}, {"begin": 6339, "end": 6357, "target": "#b23", "idx": 34}, {"begin": 7280, "end": 7302, "target": "#b29", "idx": 35}, {"begin": 7932, "end": 7945, "target": "#b27", "idx": 36}, {"begin": 8330, "end": 8352, "target": "#b8", "idx": 37}, {"begin": 8906, "end": 8927, "target": "#b16", "idx": 38}, {"begin": 10726, "end": 10747, "target": "#b11", "idx": 39}, {"begin": 10831, "end": 10850, "target": "#b23", "idx": 40}, {"begin": 12333, "end": 12355, "target": "#b2", "idx": 41}, {"begin": 14493, "end": 14516, "target": "#b2", "idx": 42}, {"begin": 16021, "end": 16049, "target": "#b12", "idx": 43}, {"begin": 17684, "end": 17705, "target": "#b21", "idx": 44}, {"begin": 17706, "end": 17728, "target": "#b8", "idx": 45}, {"begin": 17729, "end": 17749, "target": "#b30", "idx": 46}, {"begin": 19704, "end": 19710, "idx": 47}, {"begin": 20097, "end": 20119, "target": "#b8", "idx": 48}, {"begin": 20562, "end": 20582, "target": "#b14", "idx": 49}, {"begin": 21162, "end": 21184, "target": "#b29", "idx": 50}, {"begin": 21189, "end": 21202, "target": "#b27", "idx": 51}, {"begin": 21355, "end": 21377, "target": "#b8", "idx": 52}, {"begin": 21520, "end": 21541, "target": "#b16", "idx": 53}, {"begin": 21698, "end": 21718, "target": "#b14", "idx": 54}, {"begin": 22016, "end": 22038, "target": "#b29", "idx": 55}, {"begin": 22043, "end": 22056, "target": "#b27", "idx": 56}, {"begin": 22178, "end": 22200, "target": "#b29", "idx": 57}, {"begin": 22355, "end": 22377, "target": "#b8", "idx": 58}, {"begin": 22564, "end": 22585, "target": "#b16", "idx": 59}, {"begin": 22748, "end": 22768, "target": "#b14", "idx": 60}, {"begin": 24258, "end": 24280, "target": "#b29", "idx": 61}, {"begin": 24285, "end": 24298, "target": "#b27", "idx": 62}, {"begin": 24912, "end": 24930, "target": "#b23", "idx": 63}, {"begin": 25032, "end": 25046, "target": "#b27", "idx": 64}, {"begin": 25074, "end": 25096, "target": "#b8", "idx": 65}, {"begin": 25413, "end": 25434, "target": "#b30", "idx": 66}, {"begin": 25622, "end": 25642, "target": "#b10", "idx": 67}, {"begin": 26073, "end": 26094, "target": "#b16", "idx": 68}, {"begin": 26500, "end": 26520, "target": "#b14", "idx": 69}, {"begin": 28271, "end": 28294, "target": "#b29", "idx": 70}, {"begin": 28295, "end": 28308, "target": "#b27", "idx": 71}, {"begin": 28309, "end": 28330, "target": "#b16", "idx": 72}, {"begin": 28381, "end": 28400, "target": "#b18", "idx": 73}, {"begin": 28553, "end": 28576, "target": "#b8", "idx": 74}, {"begin": 28577, "end": 28597, "target": "#b14", "idx": 75}, {"begin": 28988, "end": 29010, "target": "#b8", "idx": 76}, {"begin": 29109, "end": 29130, "target": "#b30", "idx": 77}, {"begin": 29580, "end": 29602, "target": "#b16", "idx": 78}, {"begin": 29603, "end": 29625, "target": "#b29", "idx": 79}, {"begin": 29643, "end": 29666, "target": "#b8", "idx": 80}, {"begin": 29667, "end": 29687, "target": "#b14", "idx": 81}, {"begin": 29701, "end": 29715, "target": "#b27", "idx": 82}, {"begin": 29768, "end": 29782, "target": "#b27", "idx": 83}, {"begin": 30338, "end": 30358, "target": "#b14", "idx": 84}, {"begin": 31086, "end": 31106, "target": "#b14", "idx": 85}, {"begin": 31481, "end": 31501, "target": "#b25", "idx": 86}, {"begin": 32136, "end": 32157, "target": "#b21", "idx": 87}, {"begin": 32353, "end": 32374, "target": "#b21", "idx": 88}, {"begin": 32598, "end": 32618, "target": "#b25", "idx": 89}, {"begin": 32619, "end": 32641, "target": "#b0", "idx": 90}, {"begin": 32724, "end": 32746, "target": "#b8", "idx": 91}, {"begin": 32991, "end": 33011, "target": "#b30", "idx": 92}, {"begin": 34871, "end": 34893, "target": "#b2", "idx": 93}, {"begin": 36593, "end": 36616, "target": "#b2", "idx": 94}], "ReferenceToFootnote": [{"begin": 5910, "end": 5911, "target": "#foot_0", "idx": 0}, {"begin": 8406, "end": 8407, "target": "#foot_1", "idx": 1}, {"begin": 9478, "end": 9479, "target": "#foot_2", "idx": 2}, {"begin": 17751, "end": 17752, "target": "#foot_4", "idx": 3}, {"begin": 23605, "end": 23606, "target": "#foot_5", "idx": 4}, {"begin": 32514, "end": 32515, "target": "#foot_6", "idx": 5}], "SectionFootnote": [{"begin": 35725, "end": 36617, "idx": 0}], "ReferenceString": [{"begin": 36634, "end": 36937, "id": "b0", "idx": 0}, {"begin": 36939, "end": 37040, "id": "b1", "idx": 1}, {"begin": 37044, "end": 37361, "id": "b2", "idx": 2}, {"begin": 37365, "end": 37599, "id": "b3", "idx": 3}, {"begin": 37603, "end": 37864, "id": "b4", "idx": 4}, {"begin": 37868, "end": 38064, "id": "b5", "idx": 5}, {"begin": 38068, "end": 38271, "id": "b6", "idx": 6}, {"begin": 38275, "end": 38445, "id": "b7", "idx": 7}, {"begin": 38449, "end": 38715, "id": "b8", "idx": 8}, {"begin": 38719, "end": 39115, "id": "b9", "idx": 9}, {"begin": 39119, "end": 39398, "id": "b10", "idx": 10}, {"begin": 39402, "end": 39611, "id": "b11", "idx": 11}, {"begin": 39615, "end": 39797, "id": "b12", "idx": 12}, {"begin": 39801, "end": 39928, "id": "b13", "idx": 13}, {"begin": 39932, "end": 40327, "id": "b14", "idx": 14}, {"begin": 40331, "end": 40538, "id": "b15", "idx": 15}, {"begin": 40542, "end": 41229, "id": "b16", "idx": 16}, {"begin": 41233, "end": 41413, "id": "b17", "idx": 17}, {"begin": 41417, "end": 41602, "id": "b18", "idx": 18}, {"begin": 41606, "end": 41756, "id": "b19", "idx": 19}, {"begin": 41760, "end": 41903, "id": "b20", "idx": 20}, {"begin": 41907, "end": 42053, "id": "b21", "idx": 21}, {"begin": 42057, "end": 42175, "id": "b22", "idx": 22}, {"begin": 42179, "end": 42430, "id": "b23", "idx": 23}, {"begin": 42434, "end": 42677, "id": "b24", "idx": 24}, {"begin": 42681, "end": 42888, "id": "b25", "idx": 25}, {"begin": 42892, "end": 43128, "id": "b26", "idx": 26}, {"begin": 43132, "end": 43372, "id": "b27", "idx": 27}, {"begin": 43376, "end": 43626, "id": "b28", "idx": 28}, {"begin": 43630, "end": 43801, "id": "b29", "idx": 29}, {"begin": 43805, "end": 44065, "id": "b30", "idx": 30}, {"begin": 44069, "end": 44479, "id": "b31", "idx": 31}], "ReferenceToTable": [{"begin": 11620, "end": 11621, "target": "#tab_0", "idx": 0}, {"begin": 21086, "end": 21087, "target": "#tab_3", "idx": 1}, {"begin": 21986, "end": 21987, "target": "#tab_4", "idx": 2}], "Footnote": [{"begin": 35736, "end": 35769, "id": "foot_0", "n": "1", "idx": 0}, {"begin": 35770, "end": 35794, "id": "foot_1", "n": "2", "idx": 1}, {"begin": 35795, "end": 35939, "id": "foot_2", "n": "3", "idx": 2}, {"begin": 35940, "end": 35999, "id": "foot_3", "n": "4", "idx": 3}, {"begin": 36000, "end": 36226, "id": "foot_4", "n": "6", "idx": 4}, {"begin": 36227, "end": 36514, "id": "foot_5", "n": "7", "idx": 5}, {"begin": 36515, "end": 36617, "id": "foot_6", "n": "8", "idx": 6}], "ReferenceToFormula": [{"begin": 9495, "end": 9499, "idx": 0}, {"begin": 20448, "end": 20452, "idx": 1}, {"begin": 34226, "end": 34230, "idx": 2}], "Paragraph": [{"begin": 78, "end": 1000, "idx": 0}, {"begin": 1018, "end": 1934, "idx": 1}, {"begin": 1935, "end": 3097, "idx": 2}, {"begin": 3115, "end": 4495, "idx": 3}, {"begin": 4496, "end": 5395, "idx": 4}, {"begin": 5396, "end": 6947, "idx": 5}, {"begin": 7015, "end": 7876, "idx": 6}, {"begin": 7877, "end": 10235, "idx": 7}, {"begin": 10262, "end": 11990, "idx": 8}, {"begin": 11991, "end": 12266, "idx": 9}, {"begin": 12285, "end": 13227, "idx": 10}, {"begin": 13228, "end": 14720, "idx": 11}, {"begin": 14738, "end": 15189, "idx": 12}, {"begin": 15268, "end": 15970, "idx": 13}, {"begin": 15971, "end": 16851, "idx": 14}, {"begin": 16852, "end": 17872, "idx": 15}, {"begin": 17925, "end": 18905, "idx": 16}, {"begin": 18917, "end": 20823, "idx": 17}, {"begin": 20824, "end": 21872, "idx": 18}, {"begin": 21873, "end": 22951, "idx": 19}, {"begin": 22966, "end": 24224, "idx": 20}, {"begin": 24225, "end": 25047, "idx": 21}, {"begin": 25048, "end": 26057, "idx": 22}, {"begin": 26058, "end": 26490, "idx": 23}, {"begin": 26491, "end": 27054, "idx": 24}, {"begin": 27069, "end": 28108, "idx": 25}, {"begin": 28109, "end": 29301, "idx": 26}, {"begin": 29302, "end": 31502, "idx": 27}, {"begin": 31503, "end": 33573, "idx": 28}, {"begin": 33574, "end": 34175, "idx": 29}, {"begin": 34191, "end": 35723, "idx": 30}], "SectionHeader": [{"begin": 0, "end": 1000, "idx": 0}], "SectionReference": [{"begin": 36619, "end": 44481, "idx": 0}], "Sentence": [{"begin": 78, "end": 206, "idx": 0}, {"begin": 207, "end": 316, "idx": 1}, {"begin": 317, "end": 499, "idx": 2}, {"begin": 500, "end": 706, "idx": 3}, {"begin": 707, "end": 872, "idx": 4}, {"begin": 873, "end": 1000, "idx": 5}, {"begin": 1018, "end": 1155, "idx": 6}, {"begin": 1156, "end": 1407, "idx": 7}, {"begin": 1408, "end": 1586, "idx": 8}, {"begin": 1587, "end": 1772, "idx": 9}, {"begin": 1773, "end": 1934, "idx": 10}, {"begin": 1935, "end": 2173, "idx": 11}, {"begin": 2174, "end": 2433, "idx": 12}, {"begin": 2434, "end": 2583, "idx": 13}, {"begin": 2584, "end": 2796, "idx": 14}, {"begin": 2797, "end": 2957, "idx": 15}, {"begin": 2958, "end": 3097, "idx": 16}, {"begin": 3115, "end": 3327, "idx": 17}, {"begin": 3328, "end": 3389, "idx": 18}, {"begin": 3390, "end": 3627, "idx": 19}, {"begin": 3628, "end": 3719, "idx": 20}, {"begin": 3720, "end": 3939, "idx": 21}, {"begin": 3940, "end": 4495, "idx": 22}, {"begin": 4496, "end": 4773, "idx": 23}, {"begin": 4774, "end": 4950, "idx": 24}, {"begin": 4951, "end": 5179, "idx": 25}, {"begin": 5180, "end": 5395, "idx": 26}, {"begin": 5396, "end": 5621, "idx": 27}, {"begin": 5622, "end": 5821, "idx": 28}, {"begin": 5822, "end": 6056, "idx": 29}, {"begin": 6057, "end": 6219, "idx": 30}, {"begin": 6220, "end": 6337, "idx": 31}, {"begin": 6338, "end": 6503, "idx": 32}, {"begin": 6504, "end": 6646, "idx": 33}, {"begin": 6647, "end": 6765, "idx": 34}, {"begin": 6766, "end": 6947, "idx": 35}, {"begin": 7015, "end": 7098, "idx": 36}, {"begin": 7099, "end": 7207, "idx": 37}, {"begin": 7208, "end": 7278, "idx": 38}, {"begin": 7279, "end": 7410, "idx": 39}, {"begin": 7411, "end": 7518, "idx": 40}, {"begin": 7519, "end": 7649, "idx": 41}, {"begin": 7650, "end": 7734, "idx": 42}, {"begin": 7735, "end": 7876, "idx": 43}, {"begin": 7877, "end": 8045, "idx": 44}, {"begin": 8046, "end": 8168, "idx": 45}, {"begin": 8169, "end": 8293, "idx": 46}, {"begin": 8294, "end": 8328, "idx": 47}, {"begin": 8329, "end": 8513, "idx": 48}, {"begin": 8514, "end": 8808, "idx": 49}, {"begin": 8809, "end": 8904, "idx": 50}, {"begin": 8905, "end": 9057, "idx": 51}, {"begin": 9058, "end": 9204, "idx": 52}, {"begin": 9205, "end": 9404, "idx": 53}, {"begin": 9405, "end": 9479, "idx": 54}, {"begin": 9480, "end": 9606, "idx": 55}, {"begin": 9607, "end": 9771, "idx": 56}, {"begin": 9772, "end": 9839, "idx": 57}, {"begin": 9840, "end": 9983, "idx": 58}, {"begin": 9984, "end": 10133, "idx": 59}, {"begin": 10134, "end": 10235, "idx": 60}, {"begin": 10262, "end": 10339, "idx": 61}, {"begin": 10340, "end": 10445, "idx": 62}, {"begin": 10446, "end": 10648, "idx": 63}, {"begin": 10649, "end": 10851, "idx": 64}, {"begin": 10852, "end": 10959, "idx": 65}, {"begin": 10960, "end": 11053, "idx": 66}, {"begin": 11054, "end": 11141, "idx": 67}, {"begin": 11142, "end": 11227, "idx": 68}, {"begin": 11228, "end": 11290, "idx": 69}, {"begin": 11291, "end": 11404, "idx": 70}, {"begin": 11405, "end": 11530, "idx": 71}, {"begin": 11531, "end": 11622, "idx": 72}, {"begin": 11623, "end": 11758, "idx": 73}, {"begin": 11759, "end": 11990, "idx": 74}, {"begin": 11991, "end": 12024, "idx": 75}, {"begin": 12025, "end": 12116, "idx": 76}, {"begin": 12117, "end": 12266, "idx": 77}, {"begin": 12285, "end": 12402, "idx": 78}, {"begin": 12403, "end": 12635, "idx": 79}, {"begin": 12636, "end": 12763, "idx": 80}, {"begin": 12764, "end": 12960, "idx": 81}, {"begin": 12961, "end": 13165, "idx": 82}, {"begin": 13166, "end": 13227, "idx": 83}, {"begin": 13228, "end": 13514, "idx": 84}, {"begin": 13515, "end": 13631, "idx": 85}, {"begin": 13632, "end": 13744, "idx": 86}, {"begin": 13745, "end": 13924, "idx": 87}, {"begin": 13925, "end": 14144, "idx": 88}, {"begin": 14145, "end": 14662, "idx": 89}, {"begin": 14663, "end": 14720, "idx": 90}, {"begin": 14738, "end": 14898, "idx": 91}, {"begin": 14899, "end": 15070, "idx": 92}, {"begin": 15071, "end": 15189, "idx": 93}, {"begin": 15268, "end": 15497, "idx": 94}, {"begin": 15498, "end": 15643, "idx": 95}, {"begin": 15644, "end": 15853, "idx": 96}, {"begin": 15854, "end": 15970, "idx": 97}, {"begin": 15971, "end": 16157, "idx": 98}, {"begin": 16158, "end": 16266, "idx": 99}, {"begin": 16267, "end": 16428, "idx": 100}, {"begin": 16429, "end": 16554, "idx": 101}, {"begin": 16555, "end": 16851, "idx": 102}, {"begin": 16852, "end": 17026, "idx": 103}, {"begin": 17027, "end": 17310, "idx": 104}, {"begin": 17311, "end": 17425, "idx": 105}, {"begin": 17426, "end": 17566, "idx": 106}, {"begin": 17567, "end": 17752, "idx": 107}, {"begin": 17753, "end": 17872, "idx": 108}, {"begin": 17925, "end": 18128, "idx": 109}, {"begin": 18129, "end": 18339, "idx": 110}, {"begin": 18340, "end": 18433, "idx": 111}, {"begin": 18434, "end": 18517, "idx": 112}, {"begin": 18518, "end": 18783, "idx": 113}, {"begin": 18784, "end": 18905, "idx": 114}, {"begin": 18917, "end": 18966, "idx": 115}, {"begin": 18967, "end": 19047, "idx": 116}, {"begin": 19048, "end": 19284, "idx": 117}, {"begin": 19285, "end": 19465, "idx": 118}, {"begin": 19466, "end": 19574, "idx": 119}, {"begin": 19575, "end": 19692, "idx": 120}, {"begin": 19693, "end": 19868, "idx": 121}, {"begin": 19869, "end": 20084, "idx": 122}, {"begin": 20085, "end": 20276, "idx": 123}, {"begin": 20277, "end": 20400, "idx": 124}, {"begin": 20401, "end": 20557, "idx": 125}, {"begin": 20558, "end": 20750, "idx": 126}, {"begin": 20751, "end": 20823, "idx": 127}, {"begin": 20824, "end": 20938, "idx": 128}, {"begin": 20939, "end": 21079, "idx": 129}, {"begin": 21080, "end": 21324, "idx": 130}, {"begin": 21325, "end": 21518, "idx": 131}, {"begin": 21519, "end": 21689, "idx": 132}, {"begin": 21690, "end": 21872, "idx": 133}, {"begin": 21873, "end": 21988, "idx": 134}, {"begin": 21989, "end": 22057, "idx": 135}, {"begin": 22058, "end": 22173, "idx": 136}, {"begin": 22174, "end": 22350, "idx": 137}, {"begin": 22351, "end": 22530, "idx": 138}, {"begin": 22531, "end": 22730, "idx": 139}, {"begin": 22731, "end": 22951, "idx": 140}, {"begin": 22966, "end": 23087, "idx": 141}, {"begin": 23088, "end": 23233, "idx": 142}, {"begin": 23234, "end": 23472, "idx": 143}, {"begin": 23473, "end": 23606, "idx": 144}, {"begin": 23607, "end": 23775, "idx": 145}, {"begin": 23776, "end": 24151, "idx": 146}, {"begin": 24152, "end": 24224, "idx": 147}, {"begin": 24225, "end": 24358, "idx": 148}, {"begin": 24359, "end": 24533, "idx": 149}, {"begin": 24534, "end": 24625, "idx": 150}, {"begin": 24626, "end": 24842, "idx": 151}, {"begin": 24843, "end": 25047, "idx": 152}, {"begin": 25048, "end": 25289, "idx": 153}, {"begin": 25290, "end": 25342, "idx": 154}, {"begin": 25343, "end": 25435, "idx": 155}, {"begin": 25436, "end": 25643, "idx": 156}, {"begin": 25644, "end": 25922, "idx": 157}, {"begin": 25923, "end": 26057, "idx": 158}, {"begin": 26058, "end": 26323, "idx": 159}, {"begin": 26324, "end": 26490, "idx": 160}, {"begin": 26491, "end": 26597, "idx": 161}, {"begin": 26598, "end": 26818, "idx": 162}, {"begin": 26819, "end": 27054, "idx": 163}, {"begin": 27069, "end": 27170, "idx": 164}, {"begin": 27171, "end": 27245, "idx": 165}, {"begin": 27246, "end": 27337, "idx": 166}, {"begin": 27338, "end": 27542, "idx": 167}, {"begin": 27543, "end": 27692, "idx": 168}, {"begin": 27693, "end": 27890, "idx": 169}, {"begin": 27891, "end": 28038, "idx": 170}, {"begin": 28039, "end": 28108, "idx": 171}, {"begin": 28109, "end": 28182, "idx": 172}, {"begin": 28183, "end": 28401, "idx": 173}, {"begin": 28402, "end": 28598, "idx": 174}, {"begin": 28599, "end": 28778, "idx": 175}, {"begin": 28779, "end": 28965, "idx": 176}, {"begin": 28966, "end": 29301, "idx": 177}, {"begin": 29302, "end": 29376, "idx": 178}, {"begin": 29377, "end": 29488, "idx": 179}, {"begin": 29489, "end": 29716, "idx": 180}, {"begin": 29717, "end": 29869, "idx": 181}, {"begin": 29870, "end": 30052, "idx": 182}, {"begin": 30053, "end": 30208, "idx": 183}, {"begin": 30209, "end": 30293, "idx": 184}, {"begin": 30294, "end": 30522, "idx": 185}, {"begin": 30523, "end": 30629, "idx": 186}, {"begin": 30630, "end": 30727, "idx": 187}, {"begin": 30728, "end": 30945, "idx": 188}, {"begin": 30946, "end": 31084, "idx": 189}, {"begin": 31085, "end": 31211, "idx": 190}, {"begin": 31212, "end": 31293, "idx": 191}, {"begin": 31294, "end": 31502, "idx": 192}, {"begin": 31503, "end": 31635, "idx": 193}, {"begin": 31636, "end": 31701, "idx": 194}, {"begin": 31702, "end": 31824, "idx": 195}, {"begin": 31825, "end": 32036, "idx": 196}, {"begin": 32037, "end": 32260, "idx": 197}, {"begin": 32261, "end": 32515, "idx": 198}, {"begin": 32516, "end": 32642, "idx": 199}, {"begin": 32643, "end": 32989, "idx": 200}, {"begin": 32990, "end": 33157, "idx": 201}, {"begin": 33158, "end": 33378, "idx": 202}, {"begin": 33379, "end": 33471, "idx": 203}, {"begin": 33472, "end": 33573, "idx": 204}, {"begin": 33574, "end": 33694, "idx": 205}, {"begin": 33695, "end": 33824, "idx": 206}, {"begin": 33825, "end": 33968, "idx": 207}, {"begin": 33969, "end": 34175, "idx": 208}, {"begin": 34191, "end": 34371, "idx": 209}, {"begin": 34372, "end": 34511, "idx": 210}, {"begin": 34512, "end": 34742, "idx": 211}, {"begin": 34743, "end": 34948, "idx": 212}, {"begin": 34949, "end": 35051, "idx": 213}, {"begin": 35052, "end": 35122, "idx": 214}, {"begin": 35123, "end": 35256, "idx": 215}, {"begin": 35257, "end": 35367, "idx": 216}, {"begin": 35368, "end": 35488, "idx": 217}, {"begin": 35489, "end": 35558, "idx": 218}, {"begin": 35559, "end": 35723, "idx": 219}], "Div": [{"begin": 78, "end": 1000, "idx": 0}, {"begin": 1003, "end": 3097, "idx": 1}, {"begin": 3099, "end": 6947, "idx": 2}, {"begin": 6949, "end": 6967, "idx": 3}, {"begin": 6969, "end": 10235, "idx": 4}, {"begin": 10237, "end": 12266, "idx": 5}, {"begin": 12268, "end": 14720, "idx": 6}, {"begin": 14722, "end": 18905, "idx": 7}, {"begin": 18907, "end": 22951, "idx": 8}, {"begin": 22953, "end": 27054, "idx": 9}, {"begin": 27056, "end": 34175, "idx": 10}, {"begin": 34177, "end": 35723, "idx": 11}], "SectionMain": [{"begin": 1000, "end": 35723, "idx": 0}]}}