{"text": "SemEval-2017 Task 1: Semantic Textual Similarity Multilingual and Cross-lingual Focused Evaluation\n\nAbstract:\nSemantic Textual Similarity (STS) measures the meaning similarity of sentences. Applications include machine translation (MT), summarization, generation, question answering (QA), short answer grading, semantic search, dialog and conversational systems. The STS shared task is a venue for assessing the current state-of-the-art. The 2017 task focuses on multilingual and cross-lingual pairs with one sub-track exploring MT quality estimation (MTQE) data. The task obtained strong participation from 31 teams, with 17 participating in all language tracks. We summarize performance and review a selection of well performing methods. Analysis highlights common errors, providing insight into the limitations of existing models. To support ongoing work on semantic representations, the STS Benchmark is introduced as a new shared training and evaluation set carefully selected from the corpus of English STS shared task data (2012)(2013)(2014)(2015)(2016)(2017).\n\n\n1 Introduction\nSemantic Textual Similarity (STS) assesses the degree to which two sentences are semantically equivalent to each other. The STS task is motivated by the observation that accurately modeling the meaning similarity of sentences is a foundational language understanding problem relevant to numerous applications including: machine translation (MT), summarization, generation, question answering (QA), short answer grading, semantic search, dialog and conversational systems. STS enables the evaluation of techniques from a diverse set of domains against a shared interpretable performance criteria. Semantic inference tasks related to STS include textual entailment (Bentivogli et al., 2016; Bowman et al., 2015; Dagan et al., 2010), semantic relatedness (Bentivogli et al., 2016) and paraphrase detection (Xu et al., 2015; Ganitkevitch et al., 2013; Dolan et al., 2004). STS differs from both textual entailment and paraphrase detection in that it captures gradations of meaning overlap rather than making binary classifications of particular relationships. While semantic relatedness expresses a graded semantic relationship as well, it is non-specific about the nature of the relationship with contradictory material still being a candidate for a high score (e.g., \"night\" and \"day\" are highly related but not particularly similar).\nTo encourage and support research in this area, the STS shared task has been held annually since 2012, providing a venue for evaluation of state-ofthe-art algorithms and models (Agirre et al., 2012 (Agirre et al., , 2013 (Agirre et al., , 2014 (Agirre et al., , 2015 (Agirre et al., , 2016)). During this time, diverse similarity methods and data sets 1 have been explored. Early methods focused on lexical semantics, surface form matching and basic syntactic similarity (Bär et al., 2012; Šarić et al., 2012a; Jimenez et al., 2012a). During subsequent evaluations, strong new similarity signals emerged, such as Sultan et al. (2015) 's alignment based method. More recently, deep learning became competitive with top performing feature engineered systems (He et al., 2016). The best performance tends to be obtained by ensembling feature engineered and deep learning models (Rychalska et al., 2016).\nSignificant research effort has focused on STS over English sentence pairs. 2 English STS is a 1 i.a., news headlines, video and image descriptions, glosses from lexical resources including WordNet (Miller, 1995; Fellbaum, 1998), FrameNet (Baker et al., 1998), OntoNotes (Hovy et al., 2006), web discussion fora, plagiarism, MT post-editing and Q&A data sets. Data sets are summarized on: http://ixa2.si.ehu.es/stswiki. 2 The 2012 and 2013 STS tasks were English only. The 2014 and 2015 task included a Spanish track and 2016 had a arXiv:1708.00055v1 [cs.CL] 31 Jul 2017 well-studied problem, with state-of-the-art systems often achieving 70 to 80% correlation with human judgment. To promote progress in other languages, the 2017 task emphasizes performance on Arabic and Spanish as well as cross-lingual pairings of English with material in Arabic, Spanish and Turkish. The primary evaluation criteria combines performance on all of the different language conditions except English-Turkish, which was run as a surprise language track. Even with this departure from prior years, the task attracted 31 teams producing 84 submissions.\nSTS shared task data sets have been used extensively for research on sentence level similarity and semantic representations (i.a., Arora et al. (2017); Conneau et al. (2017); Mu et al. (2017); Pagliardini et al. (2017); Wieting and Gimpel (2017); He and Lin (2016); Hill et al. (2016); Kenter et al. (2016); Lau and Baldwin (2016); Wieting et al. (2016a,b); He et al. (2015); Pham et al. (2015)). To encourage the use of a common evaluation set for assessing new methods, we present the STS Benchmark, a publicly available selection of data from English STS shared tasks (2012-2017).\n\n2 Task Overview\nSTS is the assessment of pairs of sentences according to their degree of semantic similarity. The task involves producing real-valued similarity scores for sentence pairs. Performance is measured by the Pearson correlation of machine scores with human judgments. The ordinal scale in Table 1 guides human annotation, ranging from 0 for no meaning overlap to 5 for meaning equivalence. Intermediate values reflect interpretable levels of partial overlap in meaning. The annotation scale is designed to be accessible by reasonable human judges without any formal expertise in linguistics. Using reasonable human interpretations of natural language semantics was popularized by the related textual entailment task (Dagan et al., 2010). The resulting annotations reflect both pragmatic and world knowledge and are more interpretable and useful within downstream systems.\n\n3 Evaluation Data\nThe Stanford Natural Language Inference (SNLI) corpus (Bowman et al., 2015) is the primary evaluation data source with the exception that one of the pilot track on cross-lingual Spanish-English STS. The English tracks attracted the most participation and have the largest use of the evaluation data in ongoing research.\n\n5\nThe two sentences are completely equivalent, as they mean the same thing. The bird is bathing in the sink. Birdie is washing itself in the water basin.\n\n4\nThe two sentences are mostly equivalent, but some unimportant details differ. Two boys on a couch are playing video games. Two boys are playing a video game.\n\n3\nThe two sentences are roughly equivalent, but some important information differs/missing. John said he is considered a witness but not a suspect. \"He is not a suspect anymore.\" John said.\n\n2\nThe two sentences are not equivalent, but share some details. They flew out of the nest in groups. They flew into the nest together.\n\n1\nThe two sentences are not equivalent, but are on the same topic. The woman is playing the violin. The young lady enjoys listening to the guitar.\n\n0\nThe two sentences are completely dissimilar. The black dog is running through the snow. A race car driver is driving his car through the mud.  Agirre et al. (2013).\ncross-lingual tracks explores data from the WMT 2014 quality estimation task (Bojar et al., 2014). 3 Sentences pairs in SNLI derive from Flickr30k image captions (Young et al., 2014) and are labeled with the entailment relations: entailment, neutral, and contradiction. Drawing from SNLI allows STS models to be evaluated on the type of data used to assess textual entailment methods. However, since entailment strongly cues for semantic relatedness (Marelli et al., 2014), we construct our own sentence pairings to deter gold entailment labels from informing evaluation set STS scores.\nTrack 4b investigates the relationship between STS and MT quality estimation by providing STS labels for WMT quality estimation data. The data includes Spanish translations of English sentences from a variety of methods including RBMT, SMT, hybrid-MT and human translation. Translations are annotated with the time required for human correction by post-editing and Human-targeted Translation Error Rate (HTER) (Snover et al., 2006). 4 Participants are not allowed to use the gold quality estimation annotations to inform STS scores. Table 2 : STS 2017 evaluation data.\n\n3.1 Tracks\nTable 2 summarizes the evaluation data by track.\nThe six tracks span four languages: Arabic, English, Spanish and Turkish. Track 4 has subtracks with 4a drawing from SNLI and 4b pulling from WMT's quality estimation task. Track 6 is a surprise language track with no annotated training data and the identity of the language pair first announced when the evaluation data was released.\n\n3.2 Data Preparation\nThis section describes the preparation of the evaluation data. For SNLI data, this includes the selection of sentence pairs, annotation of pairs with STS labels and the translation of the original English sentences. WMT quality estimation data is directly annotated with STS labels.\n\n3.3 Arabic, Spanish and Turkish Translation\nSentences from SNLI are human translated into Arabic, Spanish and Turkish. Sentences are translated independently from their pairs. Arabic translation is provided by CMU-Qatar by native Arabic speakers with strong English skills. Translators are given an English sentence and its Arabic machine translation 5 where they perform post-editing to correct errors. Spanish translation is completed by a University of Sheffield graduate student who is a native Spanish speaker and fluent in English. Turkish translations are obtained from SDL. 6\n\n3.4 Embedding Space Pair Selection\nWe construct our own pairings of the SNLI sentences to deter gold entailment labels being used to inform STS scores. The word embedding similarity selection heuristic from STS 2016 (Agirre et al., 2016) is used to find interesting pairs. Sentence embeddings are computed as the sum of in-dividual word embeddings, v(s) = w∈s v(w). 7 Sentences with likely meaning overlap are identified using cosine similarity, Eq. (1).sim v (s 1 , s 2 ) = v(s 1 )v(s 2 ) v(s 1 ) 2 v(s 2 ) 2 (1)\n\n4 Annotation\nAnnotation of pairs with STS labels is performed using Crowdsourcing, with the exception of Track 4b that uses a single expert annotator.\n\n4.1 Crowdsourced Annotations\nCrowdsourced annotation is performed on Amazon Mechanical Turk. 8 Annotators examine the STS pairings of English SNLI sentences. STS labels are then transferred to the translated pairs for crosslingual and non-English tracks. The annotation instructions and template are identical to Agirre et al. (2016). Labels are collected in batches of 20 pairs with annotators paid $1 USD per batch. Five annotations are collected per pair. The MTurk master 9 qualification is required to perform the task. Gold scores average the five individual annotations.\n\n4.2 Expert Annotation\nSpanish-English WMT quality estimation pairs for Track 4b are annotated for STS by a University of Sheffield graduate student who is a native speaker of Spanish and fluent in English. This track differs significantly in label distribution and the complexity of the annotation task. Sentences in a pair are translations of each other and tend to be more semantically similar. Interpreting the potentially subtle meaning differences introduced by MT errors is challenging. To accurately assess STS performance on MT quality estimation data, no attempt is made to balance the data by similarity scores.\n\n5 Training Data\nThe following summarizes the training data: Table 3 English;   English, Spanish and Spanish-English training data pulls from prior STS evaluations. Arabic and Arabic-English training data is produced by translating a subset of the English training data and transferring the similarity scores. For the MT quality estimation data in track 4b, Spanish sentences are translations of their English counterparts, differing substantially from existing Spanish-English STS data. We release one thousand new Spanish-English STS pairs sourced from the 2013 WMT translation task and produced by a phrase-based Moses SMT system (Bojar et al., 2013). The data is expert annotated and has a similar label distribution to the track 4b test data with 17% of the pairs scoring an STS score of less than 3, 23% scoring 3, 7% achieving a score of 4 and 53% scoring 5.\n\n5.1 Training vs. Evaluation Data Analysis\nEvaluation data from SNLI tend to have sentences that are slightly shorter than those from prior years of the STS shared task, while the track 4b MT qual-   Similarity scores for our pairings of the SNLI sentences are slightly lower than recent shared task years and much lower than early years. The change is attributed to differences in data selection and filtering. The average 2017 similarity score is 2.2 overall and 2.3 on the track 7 English data. Prior English data has the following average similarity scores: 2016 2.4; 2015 2.4; 2014 2.8; 2013 3.0; 2012 3.5. Translation quality estimation data from track 4b has an average similarity score of 4.0.\n\n6 System Evaluation\nThis section reports participant evaluation results for the SemEval-2017 STS shared task.\n\n6.1 Participation\nThe task saw strong participation with 31 teams producing 84 submissions. 17 teams provided 44 systems that participated in all tracks. Table 9 summarizes participation by track. Traces of the focus on English are seen in 12 teams participating just in track 5, English. Two teams participated exclusively in tracks 4a and 4b, Spanish-English. One team took part solely in track 1, Arabic.\n\n6.2 Evaluation Metric\nSystems are evaluated on each track by their Pearson correlation with gold labels. The overall rank-   ing averages the correlations across tracks 1-5 with tracks 4a and 4b individually contributing.\n\n6.3 CodaLab\nAs directed by the SemEval workshop organizers, the CodaLab research platform hosts the task. 11\n\n6.4 Baseline\nThe baseline is the cosine of binary sentence vectors with each dimension representing whether an individual word appears in a sentence. 12 For crosslingual pairs, non-English sentences are translated into English using state-of-the-art machine translation. 13 The baseline achieves an average correlation of 53.7 with human judgment on tracks 1-5 and would rank 23 rd overall out the 44 system submissions that participated in all tracks.\n\n6.5 Rankings\nParticipant performance is provided in Table 10. ECNU is best overall (avg r: 0.7316) and achieves the highest participant evaluation score on: track 2, Arabic-English (r: 0.7493); track 3, Spanish (r: 0.8559); and track 6, Turkish-English (r: 0.7706).\nBIT attains the best performance on track 1, Arabic (r: 0.7543). CompiLIG places first on track 4a, SNLI Spanish-English (r: 0.8302). SEF@UHH exhibits the best correlation on the difficult track 4b WMT quality estimation pairs (r: 0.3407). RTV has the best system for the track 5 English data (r: 0.8547), followed closely by DT Team (r: 0.8536).\nEspecially challenging tracks with SNLI data are: track 1, Arabic; track 2, Arabic-English; and track 6, English-Turkish. Spanish-English performance is much higher on track 4a's SNLI data than Results tend to decrease on cross-lingual tracks. The baseline drops > 10% relative on Arabic-English and Spanish-English (SNLI) vs. monolingual Arabic and Spanish. Many participant systems show smaller decreases. ECNU's top ranking entry performs slightly better on Arabic-English than Arabic, with a slight drop from Spanish to Spanish-English (SNLI).\n\n6.6 Methods\nParticipating teams explore techniques ranging from state-of-the-art deep learning models to elaborate feature engineered systems. Prediction signals include surface similarity scores such as edit distance and matching n-grams, scores derived from word alignments across pairs, assessment by MT evaluation metrics, estimates of conceptual similarity as well as the similarity between word and sentence level embeddings. For cross-lingual and non-English tracks, MT was widely used to convert the two sentences being compared into the same language. 15 Select methods are highlighted below. 14 e.g., Reimers et al. (2016) report success using STS labels with alternative metrics such as normalized Cumulative Gain (nCG), normalized Discounted Cumulative Gain (nDCG) and F1 to more accurately predict performance on the downstream tasks: text reuse detection, binary classification of document relatedness and document relatedness within a corpus.\n15 Within the highlighted submissions, the following use a monolingual English system fed by MT: ECNU, BIT, HCTI and MITRE. HCTI submitted a separate run using ar, es and en trained models that underperformed using their en model with MT for ar and es. CompiLIG's model is cross-lingual but includes a word alignment feature that depends on MT. SEF@UHH built ar, es, en and tr models and use MT for the cross-lingual pairs. LIM-LIG and DT Team only participate in monolingual tracks.  (Ferrero et al., 2017) 79.10 14.94 DT TEAM (Maharjan et al., 2017) 85.36 DT TEAM (Maharjan et al., 2017) 83.60 DT TEAM (Maharjan et al., 2017) 83.29 FCICU (Hassan et al., 2017) 82.17 ITNLPAiKF (Liu et al., 2017) 82.31 ITNLPAiKF (Liu et al., 2017) 82.31 ITNLPAiKF (Liu et al., 2017) 81.59 L2F/INESC-ID (Fialho et al., 2017) ( Śpiewak et al., 2017) 78.50 OPI-JSA ( Śpiewak et al., 2017) 73.42 OPI-JSA ( Śpiewak et al., 2017) 67.96 PurdueNLP (Lee et al., 2017) 79.28 PurdueNLP (Lee et al., 2017) 55.35 PurdueNLP (Lee et al., 2017) 53.11 QLUT (Meng et al., 2017) * 64.33 QLUT (Meng et al., 2017) 61.55 QLUT (Meng et al., 2017) 10 : STS 2017 rankings ordered by average correlation across tracks 1-5. Performance is reported by convention as Pearson's r × 100. For tracks 1-6, the top ranking result is marked with a • symbol and results in bold have no statistically significant difference with the best result on a track, p > 0.05 Williams' t-test (Diedenhofen and Musch, 2015).\nECNU (Tian et al., 2017) The best overall system is from ENCU and ensembles well performing a feature engineered models with deep learning methods. Three feature engineered models use Random Forest (RF), Gradient Boosting (GB) and XGBoost (XGB) regression methods with features based on: n-gram overlap; edit distance; longest common prefix/suffix/substring; tree kernels (Moschitti, 2006); word alignments (Sultan et al., 2015); summarization and MT evaluation metrics (BLEU, GTM-3, NIST, WER, ME-TEOR, ROUGE); and kernel similarity of bagsof-words, bags-of-dependencies and pooled wordembeddings. ECNU's deep learning models are differentiated by their approach to sentence embeddings using either: averaged word embeddings, projected word embeddings, a deep averaging network (DAN) (Iyyer et al., 2015) or LSTM (Hochreiter and Schmidhuber, 1997). Each network feeds the element-wise multiplication, subtraction and concatenation of paired sentence embeddings to additional layers to predict similarity scores. The ensemble averages scores from the four deep learning and three feature engineered models. 16 IT (Wu et al., 2017) Second place overall is achieved by BIT primarily using sentence information content (IC) informed by WordNet and BNC word frequencies. One submission uses sentence IC exclusively. Another ensembles IC with Sultan et al. ( 2015)'s alignment method, while a third ensembles IC with cosine similarity of summed word embeddings with an IDF weighting scheme. Sentence IC in isolation outperforms all systems except those from ECNU. Combining sentence IC with word embedding similarity performs best.\nHCTI (Shao, 2017) Third place overall is obtained by HCTI with a model similar to a convolutional Deep Structured Semantic Model (CDSSM) (Chen et al., 2015; Huang et al., 2013). Sentence embeddings are generated with twin convolutional neural networks (CNNs). The embeddings are then compared using cosine similarity and elementwise difference with the resulting values fed to additional layers to predict similarity labels. The architecture is abstractly similar to ECNU's deep learning models. UMDeep (Barrow and Peskov, 2017) took a similar approach using LSTMs rather than CNNs for the sentence embeddings.\nMITRE (Henderson et al., 2017) Fourth place overall is MITRE that, like ECNU, takes an ambitious feature engineering approach complemented by deep learning. Ensembled components include: alignment similarity; TakeLab STS ( Šarić et al., 2012b); string similarity measures such as matching n-grams, summarization and MT metrics (BLEU, WER, PER, ROUGE); a RNN and recurrent convolutional neural networks (RCNN) over word alignments; and a BiLSTM that is state-ofthe-art for textual entailment (Chen et al., 2016).\nFCICU (Hassan et al., 2017) Fifth place overall is FCICU that computes a sense-base alignment using BabelNet (Navigli and Ponzetto, 2010). Babel-Net synsets are multilingual allowing non-English and cross-lingual pairs to be processed similarly to English pairs. Alignment similarity scores are used with two runs: one that combines the scores within a string kernel and another that uses them with a weighted variant of Sultan et al. ( 2015)'s method. Both runs average the Babelnet based scores with soft-cardinality (Jimenez et al., 2012b).\nCompiLIG (Ferrero et al., 2017) The best Spanish-English performance on SNLI sentences was achieved by CompiLIG using the following cross-lingual features: conceptual similarity using DBNary (Serasset, 2015), MultiVec word embeddings (Berard et al., 2016) LIM-LIG (Nagoudi et al., 2017) Using only weighted word embeddings, LIM-LIG took second place on Arabic. 17 Arabic word embeddings are summed into sentence embeddings using uniform, POS and IDF weighting schemes. Sentence similarity is computed by cosine similarity. POS and IDF outperform uniform weighting. Combining the IDF and POS weights by multiplication is reported by LIM-LIG to achieve r 0.7667, higher than all submitted Arabic (track 1) systems.\nDT Team (Maharjan et al., 2017) Second place on English (track 5) 18 is DT Team using feature engineering combined with the following deep learning models: DSSM (Huang et al., 2013), CDSSM (Shen et al., 2014) SEF@UHH (Duma and Menzel, 2017) First place on the challenging Spanish-English MT pairs (Track 4b) is SEF@UHH. Paragraph vector models (Le and Mikolov, 2014) are trained for Arabic, English, Spanish and Turkish. MT converts crosslingual pairs into a single language and similarity scores are computed using cosine or the negation of Bray-Curtis dissimilarity. The best performing submission on track 4b uses cosine similarity of Spanish paragraph vectors with MT converting paired English sentences into Spanish. 19\n\n7 Analysis\nFigure 1 plots model similarity scores against human STS labels for the top 5 systems from tracks 5 (English), 1 (Arabic) and 4b (Spanish-English MT). While many systems return scores on the same scale as the gold labels, 0-5, others return scores from approximately 0 and 1. Lines on the graphs illustrate perfect performance for both a 0-5 and a 0-1 scale. Mapping the 0 to 1 scores to range from 0-5, 21 approximately 80% of the scores from top performing English systems are within 1.0 pt of the gold label. Errors for Arabic are more broadly distributed, particularly for model scores between 1 and 4. The Spanish-English MT plots the weak relationship between the predicted and gold scores.\nTable 12 provides examples of difficult sentence pairs for participant systems and illustrates common sources of error for even well-ranking systems 19 For the cross-lingual tracks with language pair L1-L2, Duma and Menzel (2017) report additional experiments that vary the language choice for the paragraph vector model, using either L1 or L2. Experimental results are also provided that average the scores from the L1 and L2 models as well as that use vector correlation to compute similarity. including: (i) word sense disambiguation \"making\" and \"preparing\" are very similar in the context of \"food\", while \"picture\" and \"movie\" are not similar when picture is followed by \"day\"; (ii) attribute importance \"outside\" vs. \"deserted\" are smaller details when contrasting \"The man is in a deserted field\" with \"The man is outside in the field\"; (iii) compositional meaning \"A man is carrying a canoe with a dog\" has the same content words as \"A dog is carrying a man in a canoe\" but carries a different meaning; (iv) negation systems score \". . . with goggles and a swimming cap\" as nearly equivalent to \". . . without goggles or a swimming cap\". Inflated similarity scores for examples like \"There is a young girl\" vs. \"There is a young boy with the woman\" demonstrate (v) semantic blending, whereby appending \"with a woman\" to \"boy\" brings its representation closer to that of \"girl\". For multilingual and cross-lingual pairs, these issues are magnified by translation errors for systems that use MT followed by the application of a monolingual similarity model. For track 4b Spanish-English MT pairs, some of the poor performance can in part be attributed to many systems using MT to re-translate the output of another MT system, obscuring errors in the original translation.\n\n7.1 Contrasting Cross-lingual STS with MT Quality Estimation\nSince MT quality estimation pairs are translations of the same sentence, they are expected to be minimally on the same topic and have an STS score ≥ 1. 22 The actual distribution of STS scores is such that only 13% of the test instances score below 3, 22% of the instances score 3, 12% score 4 and 53% score 5. The high STS scores indicate that MT systems are surprisingly good at preserving meaning. However, even for a human, interpreting changes caused by translations errors can be difficult due both to disfluencies and subtle errors with important changes in meaning.\nThe Pearson correlation between the gold MT quality scores and the gold STS scores is 0.41, which shows that translation quality measures and STS are only moderately correlated. Differences are in part explained by translation quality scores penalizing all mismatches between the source segment and its translation, whereas STS focuses on differences in meaning. However, the difficult in- 22 The evaluation data for track 4b does in fact have STS scores that are ≥ 1 for all pairs. In the 1,000 sentence training set for this track, one sentence that received a score of zero. terpretation work required for STS annotation may increase the risk of inconsistent and subjective labels. The annotations for MT quality estimation are produced as by-product of post-editing. Humans fix MT output and the edit distance between the output and its post-edited correction provides the quality score. This post-editing based procedure is known to produce relatively consistent estimates across annotators.\n\n8 STS Benchmark\nThe STS Benchmark is a careful selection of the English data sets used in SemEval and *SEM STS shared tasks between 2012 and 2017. Tables 11 and 13 provide details on the composition of the benchmark. The data is partitioned into training, development and test sets. 23 The development set can be used to design new models and tune hyperparameters. The test set should be used sparingly and only after a model design and hyperparameters have been locked against further changes. Using the STS Benchmark enables comparable assessments across different research efforts and improved tracking of the state-of-the-art. Table 14 shows the STS Benchmark results for some of the best systems from Track 5 (EN-EN) 24 and compares their performance to competitive baselines from the literature. All baselines were run by the organizers using canonical pre-trained models made available by the originator of each method, 25 with the exception of PV-DBOW that Table 14 : STS Benchmark. Pearson's r × 100 results for select participants and baseline models.\nuses the model from Lau and Baldwin (2016) and InferSent which was reported independently. When multiple pre-trained models are available for a method, we report results for the one with the best dev set performance. For each method, input sentences are preprocessed to closely match the tokenization of the pre-trained models. 26  Joshua (Matt Post, 2015) pipeline to pre-process and tokenized English text; C-PHRASE, GloVe, PV-DBOW & inference hyperparameters are used unless noted otherwise. The averaged word embedding baselines compute a sentence embedding by averaging word embeddings and then using cosine to compute pairwise sentence similarity scores.\nWhile state-of-the-art baselines for obtaining sentence embeddings perform reasonably well on the benchmark data, improved performance is obtained by top 2017 STS shared task systems. There is still substantial room for further improvement. To follow the current state-of-the-art, visit the leaderboard on the STS wiki. 27\n\n9 Conclusion\nWe have presented the results of the 2017 STS shared task. This year's shared task differed substantially from previous iterations of STS in that the primary emphasis of the task shifted from English to multilingual and cross-lingual STS in-SIF: PTB tokenization provided by Stanford CoreNLP (Manning et al., 2014) with post-processing based on dev OOVs; Word2vec: Similar to FastText, to our knownledge, the preprocessing for the pre-trained Word2vec embeddings is not publicly described. We use the following heuristics for the Word2vec experiment: All numbers longer than a single digit are converted into a '#' (e.g., 24 → ##) then prefixed, suffixed and infixed punctuation is recursively removed from each token that does not match an entry in the model's lexicon.\n27 http://ixa2.si.ehu.es/stswiki/index. php/STSbenchmark volving four different languages: Arabic, Spanish, English and Turkish. Even with this substantial change relative to prior evaluations, the shared task obtained strong participation. 31 teams produced 84 system submissions with 17 teams producing a total of 44 system submissions that processed pairs in all of the STS 2017 languages. For languages that were part of prior STS evaluations (e.g., English and Spanish), state-of-the-art systems are able to achieve strong correlations with human judgment. However, we obtain weaker correlations from participating systems for Arabic, Arabic-English and Turkish-English. This suggests further research is necessary in order to develop robust models that can both be readily applied to new languages and perform well even when less supervised training data is available. To provide a standard benchmark for English STS, we present the STS Benchmark, a careful selection of the English data sets from previous STS tasks (2012) (2013) (2014) (2015) (2016) (2017). To assist in interpreting the results from new models, a number of competitive baselines and select participant systems are evaluated on the benchmark data. Ongoing improvements to the current state-of-the-art is available from an online leaderboard.\n\nFootnotes:\n3: Previous years of the STS shared task include more data sources. This year the task draws from two data sources and includes a diverse set of languages and language-pairs.\n4: HTER is the minimal number of edits required for correction of a translation divided by its length after correction.\n5: Produced by the Google Translate API.\n6: http://www.sdl.com/languagecloud/ managed-translation/\n7: We use 50-dimensional GloVe word embeddings (Pennington et al., 2014) trained on a combination of Gigaword 5 (Parker et al., 2011) and English Wikipedia available at http://nlp.stanford.edu/projects/glove/.\n8: 8 https://www.mturk.com\n9: / 9 A designation that statistically identifies workers who perform high quality work across a diverse set of\n10: tasks.10  Spanish data from 2015 and 2014 uses a 5 point scale that collapses STS labels 4 and 3, removing the distinction between unimportant and important details.\n11: https://competitions.codalab.org/ competitions/16051\n12: Words obtained using Arabic (ar), Spanish (es) and English (en) Treebank tokenizers.\n13: 13 http://translate.google.com\n16: The two remaining ECNU runs only use either RF or GB and exclude the deep learning models.\n17: The approach is similar to SIF (Arora et al., 2017) but without removal of the common principle component\n18: RTV took first place on track 5, English, but submitted no system description paper.\n23: Similar to the STS shared task, while the training set is provided as a convenience, researchers are encourage to incorporate other supervised and unsupervised data as long as no supervised annotations of the test partitions are used.\n24: Each participant submitted the run which did best in the development set of the STS Benchmark, which happened to be the same as their best run in Track 5 in all cases.\n\nReferences:\n\n- Year Data set Pairs Source 2012 MSRpar 1500 newswire 2012 MSRvid 1500 videos 2012 OnWN 750 glosses 2012 SMTnews 750 WMT eval. 2012 SMTeuroparl 750 WMT eval. 2013 HDL 750 newswire 2013 FNWN 189 glosses 2013 OnWN 561 glosses 2013 SMT 750 MT eval. 2014 HDL 750 newswire headlines 2014 OnWN 750 glosses 2014 Deft-forum 450 forum posts 2014 Deft-news 300 news summary 2014 Images 750 image descriptions 2014 Tweet-news 750 tweet-news pairs 2015 HDL 750 newswire headlines 2015 Images 750 image descriptions 2015 Ans.-student 750 student answers 2015 Ans.-forum 375 Q&A forum answers 2015 Belief 375 committed belief 2016 HDL 249 newswire headlines 2016 Plagiarism 230 short-answer plag. 2016 post-editing 244 MT postedits 2016 Ans.-Ans. 254 Q&A forum answers 2016 Quest.-Quest. 209 Q&A forum questions 2017 Trial 23 Mixed STS 2016 25 Sent2Vec: https://github.com/epfml/ sent2vec, trained model Sent2Vec twitter unigrams;- Wikipedia trained word frequencies enwiki vocab min200.txt, https://github.com/alexandres/lexvec em- beddings from lexvec.commoncrawl.300d.W+C.pos.vectors, first 15 principle components removed, α = 0.001, dev experiments varied α, principle components removed and STS 2017 Participants on STS Benchmark Name Description Dev Test ECNU Ensembles well performing feature eng. models with deep neural networks each using sent. 84.7 81.0 emb. from either LSTM, DAN, prj. word emb. or avg. word emb. (Tian et al., 2017)\n\n- BIT Ensembles sent. information content (IC) with cosine of sent. emb. derived from summed 82.9 80.9\n\n- word emb. with IDF weighting scheme (Wu et al., 2017)\n\n- DT TEAM Ensembles feature eng. and deep learning signals using sent. emb. from DSSM, CDSSM 83.0 79.2 and skip-thought models (Maharjan et al., 2017)\n\n- UdL Feature eng. model using cosine of tf-idf weighted char n-grams, num. match, sent. length 72.4 79.0\n\n- and avg. word emb. cosine over PoS and NER based alignments (Al-Natsheh et al., 2017) HCTI Deep learning model with sent. emb. computed using paired convolutional neural networks 83.4 78.4\n\n- CNN) and then compared using fully connected layers (Shao, 2017)\n\n- RTM Referential translation machines (RTM) use a feature eng. model with transductive learning 73.2 * 70.6 and parallel feature decay algorithm (ParFDA) training instance selection (Bic ¸ici, 2017b,a)\n\n- SEF@UHH Cosine of paragraph vector (PV-DBOW) sent. emb. (Duma and Menzel, 2017) 61.6 59.2\n\n- Sentence Level Baselines InferSent Sent. emb. from bi-directional LSTM trained on SNLI (Conneau et al., 2017) 80.1 75.8\n\n- Sent2Vec Word & bigram emb. sum from sent. spanning CBOW (Pagliardini et al., 2017)\n\n- SIF Weighted word emb. sum with principle component removal (Arora et al., 2017)\n\n- PV-DBOW Paragraph vectors (PV-DBOW) (Le and Mikolov, 2014; Lau and Baldwin, 2016)\n\n- C-PHRASE Word emb. sum from model of syntactic constituent context words (Pham et al., 2015) 74.3 63.9\n\n- Averaged Word Embedding Baselines LexVec Weighted matrix factorization of PPMI (Salle et al., 2016a,b) 68.9 55.8\n\n- FastText Skip-gram with sub-word character n-grams (Joulin et al., 2016) 65.2 53.9\n\n- Paragram Paraphrase Database (PPDB) fit word embeddings (Wieting et al., 2015) 63.0 50.1\n\n- GloVe Word co-occurrence count fit embeddings (Pennington et al., 2014) 52.4 40.6\n\n- Word2vec Skip-gram prediction of words in a context window (Mikolov et al., 2013a,b) 70.0 56.5\n\n- * 10-fold cross-validation on combination of dev and training data. References Eneko Agirre, Carmen Banea, Claire Cardie, Daniel Cer, Mona Diab, Aitor Gonzalez-Agirre, Weiwei Guo, Iñigo Lopez-Gazpio, Montse Maritxalar, Rada Mihalcea, Ger- man Rigau, Larraitz Uria, and Janyce Wiebe. 2015. SemEval-2015 Task 2: Semantic Textual Similarity, En- glish, Spanish and Pilot on Interpretability. In Proceedings of SemEval 2015. http://www.aclweb.org/anthology/S15- 2045.\n\n- Eneko Agirre, Carmen Banea, Claire Cardie, Daniel Cer, Mona Diab, Aitor Gonzalez-Agirre, Weiwei Guo, Rada Mihalcea, German Rigau, and Janyce Wiebe. 2014. SemEval-2014 Task 10: Multilingual semantic tex- tual similarity. In Proceedings of SemEval 2014. http://www.aclweb.org/anthology/S14-2010. Eneko Agirre, Carmen Banea, Daniel Cer, Mona Diab, Aitor Gonzalez-Agirre, Rada Mihalcea, German Rigau, and Janyce Wiebe. 2016. Semeval-2016 task 1: Se- mantic textual similarity, monolingual and cross-lingual evaluation. In Proceedings of the SemEval-2016.\n\n- Eneko Agirre, Daniel Cer, Mona Diab, and Aitor Gonzalez- Agirre. 2012. SemEval-2012 Task 6: A pilot on semantic textual similarity. In Proceedings of *SEM 2012/SemEval 2012. http://www.aclweb.org/anthology/S12-1051.\n\n- Eneko Agirre, Daniel Cer, Mona Diab, Aitor Gonzalez-Agirre, and Weiwei Guo. 2013. *SEM 2013 shared task: Se- mantic Textual Similarity. In Proceedings of *SEM 2013. http://www.aclweb.org/anthology/S13-1004.\n\n- Hussein T. Al-Natsheh, Lucie Martinet, Fabrice Muhlen- bach, and Djamel Abdelkader ZIGHED. 2017. UdL at SemEval-2017 Task 1: Semantic textual similarity esti- mation of english sentence pairs using regression model over pairwise features. In Proceedings of SemEval-2017. http://www.aclweb.org/anthology/S17-2013.\n\n- Sanjeev Arora, Yingyu Liang, and Tengyu Ma. 2017. A simple but tough-to-beat baseline for sen- tence embeddings. In Proceedings of ICLR 2017. https://openreview.net/pdf?id=SyK00v5xx.\n\n- Ignacio Arroyo-Fernández and Ivan Vladimir Meza Ruiz. 2017. LIPN-IIMAS at SemEval-2017 Task 1: Sub- word embeddings, attention recurrent neural net- works and cross word alignment for semantic tex- tual similarity. In Proceedings of SemEval-2017.\n\n- Collin F. Baker, Charles J. Fillmore, and John B. Lowe. 1998. The Berkeley FrameNet Project. In Proceedings of COLING '98. http://aclweb.org/anthology/P/P98/P98- 1013.pdf.\n\n- Daniel Bär, Chris Biemann, Iryna Gurevych, and Torsten Zesch. 2012. Ukp: Computing semantic textual sim- ilarity by combining multiple content similarity mea- sures. In Proceedings of *SEM 2012/SemEval 2012. http://www.aclweb.org/anthology/S12-1059.\n\n- Joe Barrow and Denis Peskov. 2017. UMDeep at SemEval- 2017 Task 1: End-to-end shared weight LSTM model for semantic textual similarity. In Proceedings of SemEval- 2017. http://www.aclweb.org/anthology/S17-2026.\n\n- Luisa Bentivogli, Raffaella Bernardi, Marco Marelli, Ste- fano Menini, Marco Baroni, and Roberto Zamparelli. 2016. SICK through the SemEval glasses. lesson learned from the evaluation of compositional distributional semantic models on full sentences through semantic relatedness and textual entailment. Lang Resour Eval 50(1):95-124. https://doi.org/10.1007/s10579-015-9332-5.\n\n- Alexandre Berard, Christophe Servan, Olivier Pietquin, and Laurent Besacier. 2016. MultiVec: a multilin- gual and multilevel representation learning toolkit for NLP. In Proceedings of LREC 2016. http://www.lrec- conf.org/proceedings/lrec2016/pdf/666 Paper.pdf.\n\n- Ergun Bic ¸ici. 2017a. Predicting translation performance with referential translation machines. In Proceedings of WMT17 (to appear).\n\n- Ergun Bic ¸ici. 2017b. RTM at SemEval-2017 Task 1: Referential translation machines for predicting se- mantic similarity. In Proceedings of SemEval-2017. http://www.aclweb.org/anthology/S17-2030.\n\n- Johannes Bjerva and Robert Östling. 2017. ResSim at SemEval-2017 Task 1: Multilingual word representations for semantic textual similarity. In Proceedings of SemEval- 2017. http://www.aclweb.org/anthology/S17-2021.\n\n- Ondrej Bojar, Christian Buck, Christian Federmann, Barry Haddow, Philipp Koehn, Johannes Leveling, Christof Monz, Pavel Pecina, Matt Post, Herve Saint-Amand, Radu Soricut, Lucia Specia, and Aleš Tamchyna. 2014. Findings of the 2014 workshop on statisti- cal machine translation. In Proceedings of WMT 2014. http://www.aclweb.org/anthology/W/W14/W14- 3302.pdf. Ondřej Bojar, Christian Buck, Chris Callison-Burch, Chris- tian Federmann, Barry Haddow, Philipp Koehn, Christof Monz, Matt Post, Radu Soricut, and Lucia Specia. 2013. Findings of the 2013 Workshop on Statistical Machine Translation. In Proceedings of WMT 2013. http://www.aclweb.org/anthology/W13-2201.\n\n- Samuel R. Bowman, Gabor Angeli, Christopher Potts, and Christopher D. Manning. 2015. A large annotated corpus for learning natural language inference. In Proceedings of EMNLP 2015. http://aclweb.org/anthology/D/D15/D15- 1075.pdf.\n\n- Tomas Brychcin and Lukas Svoboda. 2016. UWB at SemEval-2016 Task 1: Semantic textual sim- ilarity using lexical, syntactic, and semantic in- formation. In Proceedings of SemEval 2016. https://www.aclweb.org/anthology/S/S16/S16-1089.pdf.\n\n- Qian Chen, Xiaodan Zhu, Zhen-Hua Ling, Si Wei, and Hui Jiang. 2016. Enhancing and combining sequential and tree LSTM for natural language inference. CoRR abs/1609.06038. http://arxiv.org/abs/1609.06038.\n\n- Yun-Nung Chen, Dilek Hakkani-Tür, and Xiaodong He. 2015. Learning bidirectional intent embeddings by convolutional deep structured semantic models for spoken language understanding. In Proceedings of NIPS-SLU, 2015. https://www.microsoft.com/en- us/research/publication/learning-bidirectional-intent- embeddings-by-convolutional-deep-structured-semantic- models-for-spoken-language-understanding/.\n\n- Alexis Conneau, Douwe Kiela, Holger Schwenk, Loïc Bar- rault, and Antoine Bordes. 2017. Supervised learn- ing of universal sentence representations from natu- ral language inference data. CoRR abs/1705.02364. http://arxiv.org/abs/1705.02364.\n\n- Ido Dagan, Bill Dolan, Bernardo Magnini, and Dan Roth. 2010. Recognizing textual entailment: Rational, evalua- tion and approaches. J. Nat. Language Eng. 16:105-105. https://doi.org/10.1017/S1351324909990234.\n\n- Birk Diedenhofen and Jochen Musch. 2015. co- cor: A comprehensive solution for the statisti- cal comparison of correlations. PLoS ONE 10(4). http://dx.doi.org/10.1371/journal.pone.0121945.\n\n- Bill Dolan, Chris Quirk, and Chris Brockett. 2004. Unsu- pervised construction of large paraphrase corpora: Ex- ploiting massively parallel news sources. In Proceedings of COLING 04. http://aclweb.org/anthology/C/C04/C04- 1051.pdf. Mirela-Stefania Duma and Wolfgang Menzel. 2017. SEF@UHH at SemEval-2017 Task 1: Unsuper- vised knowledge-free semantic textual similarity via paragraph vector. In Proceedings of SemEval-2017. http://www.aclweb.org/anthology/S17-2024.\n\n- Cristina España Bonet and Alberto Barrón-Cedeño. 2017. Lump at SemEval-2017 Task 1: Towards an interlingua semantic similarity. In Proceedings of SemEval-2017. http://www.aclweb.org/anthology/S17-2019.\n\n- Christiane Fellbaum. 1998. WordNet: An Electronic Lexical Database. MIT Press. https://books.google.com/books?id=Rehu8OOzMIMC. Jérémy Ferrero, Laurent Besacier, Didier Schwab, and Frédéric Agnès. 2017. CompiLIG at SemEval-2017 Task 1: Cross-language plagiarism detection methods for seman- tic textual similarity. In Proceedings of SemEval-2017. http://www.aclweb.org/anthology/S17-2012.\n\n- Pedro Fialho, Hugo Patinho Rodrigues, Luísa Coheur, and Paulo Quaresma. 2017. L2f/inesc-id at semeval-2017 tasks 1 and 2: Lexical and semantic features in word and textual similarity. In Proceedings of SemEval-2017. http://www.aclweb.org/anthology/S17-2032.\n\n- Juri Ganitkevitch, Benjamin Van Durme, and Chris Callison-Burch. 2013. PPDB: The paraphrase database. In Proceedings of NAACL/HLT 2013. http://cs.jhu.edu/ ccb/publications/ppdb.pdf.\n\n- Basma Hassan, Samir AbdelRahman, Reem Bahgat, and Ibrahim Farag. 2017. FCICU at SemEval-2017 Task 1: Sense-based language independent semantic textual similarity approach. In Proceedings of SemEval-2017. http://www.aclweb.org/anthology/S17-2015.\n\n- Hua He, Kevin Gimpel, and Jimmy Lin. 2015. Multi- perspective sentence similarity modeling with convolu- tional neural networks. In Proceedings of EMNLP. pages 1576-1586. http://aclweb.org/anthology/D15-1181.\n\n- Hua He and Jimmy Lin. 2016. Pairwise word interaction modeling with deep neural networks for semantic sim- ilarity measurement. In Proceedings of NAACL/HLT. http://www.aclweb.org/anthology/N16-1108.\n\n- Hua He, John Wieting, Kevin Gimpel, Jinfeng Rao, and Jimmy Lin. 2016. UMD-TTIC-UW at SemEval- 2016 Task 1: Attention-based multi-perspective convolutional neural networks for textual similar- ity measurement. In Proceedings of SemEval 2016. http://www.anthology.aclweb.org/S/S16/S16-1170.pdf.\n\n- John Henderson, Elizabeth Merkhofer, Laura Strickhart, and Guido Zarrella. 2017. MITRE at SemEval-2017 Task 1: Simple semantic similarity. In Proceedings of SemEval- 2017. http://www.aclweb.org/anthology/S17-2027.\n\n- Felix Hill, Kyunghyun Cho, and Anna Korhonen. 2016. Learning distributed representations of sentences from unlabelled data. In Proceedings of NAACL/HLT. http://www.aclweb.org/anthology/N16-1162.\n\n- Sepp Hochreiter and Jürgen Schmidhuber. 1997. Long short-term memory. Neural Comput. 9(8):1735-1780. http://dx.doi.org/10.1162/neco.1997.9.8.1735.\n\n- Eduard Hovy, Mitchell Marcus, Martha Palmer, Lance Ramshaw, and Ralph Weischedel. 2006. OntoNotes: The 90% solution. In Proceedings of NAACL/HLT 2006. http://aclweb.org/anthology/N/N06/N06-2015.pdf.\n\n- Po-Sen Huang, Xiaodong He, Jianfeng Gao, Li Deng, Alex Acero, and Larry Heck. 2013. Learning deep structured semantic models for web search using clickthrough data. In Proceedings of CIKM. https://www.microsoft.com/en- us/research/publication/learning-deep-structured- semantic-models-for-web-search-using-clickthrough- data/.\n\n- Mohit Iyyer, Varun Manjunatha, Jordan Boyd-Graber, and Hal Daumé III. 2015. Deep unordered composition rivals syntactic methods for text classification. In Proceedings of ACL/IJCNLP. http://www.aclweb.org/anthology/P15- 1162.\n\n- Sergio Jimenez, Claudia Becerra, and Alexander Gelbukh. 2012a. Soft cardinality: A parameterized similarity func- tion for text comparison. In Proceedings of *SEM 2012/Se- mEval 2012. http://www.aclweb.org/anthology/S12-1061.\n\n- Sergio Jimenez, Claudia Becerra, and Alexander Gelbukh. 2012b. Soft Cardinality: A parameterized similarity func- tion for text comparison. In Proceedings of *SEM 2012/Se- mEval 2012. http://aclweb.org/anthology/S/S12/S12- 1061.pdf.\n\n- Armand Joulin, Edouard Grave, Piotr Bojanowski, and Tomas Mikolov. 2016. Bag of tricks for ef- ficient text classification. CoRR abs/1607.01759. http://arxiv.org/abs/1607.01759.\n\n- Tom Kenter, Alexey Borisov, and Maarten de Rijke. 2016. Siamese cbow: Optimizing word embeddings for sentence representations. In Proceedings of ACL. http://www.aclweb.org/anthology/P16-1089.\n\n- Ryan Kiros, Yukun Zhu, Ruslan Salakhutdinov, Richard S. Zemel, Antonio Torralba, Raquel Urtasun, and Sanja Fi- dler. 2015. Skip-thought vectors. CoRR abs/1506.06726. http://arxiv.org/abs/1506.06726.\n\n- Sarah Kohail, Amr Rekaby Salama, and Chris Biemann. 2017. STS-UHH at SemEval-2017 Task 1: Scoring semantic textual similarity using supervised and unsu- pervised ensemble. In Proceedings of SemEval-2017. http://www.aclweb.org/anthology/S17-2025.\n\n- Jey Han Lau and Timothy Baldwin. 2016. An em- pirical evaluation of doc2vec with practical insights into document embedding generation. In Proceed- ings of ACL Workshop on Representation Learning for NLP. http://www.aclweb.org/anthology/W/W16/W16- 1609.pdf. Quoc V. Le and Tomas Mikolov. 2014. Distributed represen- tations of sentences and documents. CoRR abs/1405.4053. http://arxiv.org/abs/1405.4053.\n\n- I-Ta Lee, Mahak Goindani, Chang Li, Di Jin, Kristen Marie Johnson, Xiao Zhang, Maria Leonor Pacheco, and Dan Goldwasser. 2017. PurdueNLP at SemEval-2017 Task 1: Predicting semantic textual similarity with paraphrase and event embeddings. In Proceedings of SemEval-2017. http://www.aclweb.org/anthology/S17-2029.\n\n- Wenjie Liu, Chengjie Sun, Lei Lin, and Bingquan Liu. 2017. ITNLP-AiKF at SemEval-2017 Task 1: Rich features based svr for semantic textual simi- larity computing. In Proceedings of SemEval-2017. http://www.aclweb.org/anthology/S17-2022.\n\n- Nabin Maharjan, Rajendra Banjade, Dipesh Gautam, Lasang J. Tamang, and Vasile Rus. 2017. Dt team at semeval-2017 task 1: Semantic similarity using align- ments, sentence-level embeddings and gaussian mix- ture model output. In Proceedings of SemEval-2017. http://www.aclweb.org/anthology/S17-2014.\n\n- Christopher D. Manning, Mihai Surdeanu, John Bauer, Jenny Finkel, Steven J. Bethard, and David McClosky. 2014. The Stanford CoreNLP natural language process- ing toolkit. In Proceedings of ACL 2014 Demonstrations. http://www.aclweb.org/anthology/P/P14/P14-5010.\n\n- Marco Marelli, Stefano Menini, Marco Baroni, Luisa Bentivogli, Raffaella Bernardi, and Roberto Zam- parelli. 2014. A SICK cure for the evaluation of compositional distributional semantic models. In Proceedings of LREC 14. http://www.lrec- conf.org/proceedings/lrec2014/pdf/363 Paper.pdf.\n\n- Yuan Cao Gaurav Kumar Matt Post. 2015. Joshua 6: A phrase-based and hierarchical statistical machine transla- tion. The Prague Bulletin of Mathematical Linguistics 104:516. https://ufal.mff.cuni.cz/pbml/104/art-post-cao- kumar.pdf.\n\n- Fanqing Meng, Wenpeng Lu, Yuteng Zhang, Jinyong Cheng, Yuehan Du, and Shuwang Han. 2017. QLUT at SemEval- 2017 Task 1: Semantic textual similarity based on word embeddings. In Proceedings of SemEval-2017. http://www.aclweb.org/anthology/S17-2020.\n\n- Tomas Mikolov, Kai Chen, Greg Corrado, and Jeffrey Dean. 2013a. Efficient estimation of word repre- sentations in vector space. CoRR abs/1301.3781. http://arxiv.org/abs/1301.3781.\n\n- Tomas Mikolov, Ilya Sutskever, Kai Chen, Greg S Corrado, and Jeff Dean. 2013b. Distributed representations of words and phrases and their compositionality. In Pro- ceedings of NIPS 2013. http://papers.nips.cc/paper/5021- distributed-representations-of-words-and-phrases-and- their-compositionality.pdf.\n\n- George A. Miller. 1995. WordNet: A lexical database for english. Commun. ACM 38(11):39-41. https://doi.org/10.1145/219717.219748.\n\n- Alessandro Moschitti. 2006. Efficient convolution kernels for dependency and constituent syntactic trees. In Proceed- ings of ECML'06. http://dx.doi.org/10.1007/11871842 32.\n\n- Jiaqi Mu, Suma Bhat, and Pramod Viswanath. 2017. Rep- resenting sentences as low-rank subspaces. CoRR abs/1704.05358. http://arxiv.org/abs/1704.05358.\n\n- El Moatez Billah Nagoudi, Jérémy Ferrero, and Didier Schwab. 2017. LIM-LIG at SemEval-2017 Task1: En- hancing the semantic similarity for arabic sentences with vectors weighting. In Proceedings of SemEval-2017. http://www.aclweb.org/anthology/S17-2017.\n\n- Roberto Navigli and Simone Paolo Ponzetto. 2010. BabelNet: Building a very large multilingual se- mantic network. In Proceedings of ACL 2010. http://aclweb.org/anthology/P/P10/P10-1023.pdf.\n\n- Matteo Pagliardini, Prakhar Gupta, and Martin Jaggi. 2017. Unsupervised Learning of Sentence Embed- dings using Compositional n-Gram Features. arXiv https://arxiv.org/pdf/1703.02507.pdf.\n\n- Robert Parker, David Graff, Junbo Kong, Ke Chen, and Kazuaki Maeda. 2011. Gigaword Fifth Edi- tion LDC2011T07. Linguistic Data Consortium. https://catalog.ldc.upenn.edu/ldc2011t07.\n\n- Jeffrey Pennington, Richard Socher, and Christopher D. Manning. 2014. GloVe: Global Vectors for Word Representation. In Proceedings of EMNLP 2014. http://www.aclweb.org/anthology/D14-1162.\n\n- Nghia The Pham, Germán Kruszewski, Angeliki Lazari- dou, and Marco Baroni. 2015. Jointly optimizing word representations for lexical and sentential tasks with the c-phrase model. In Proceedings of ACL/IJCNLP. http://www.aclweb.org/anthology/P15-1094.\n\n- Nils Reimers, Philip Beyer, and Iryna Gurevych. 2016. Task-oriented intrinsic evaluation of semantic tex- tual similarity. In Proceedings of COLING 2016. http://aclweb.org/anthology/C16-1009.\n\n- Barbara Rychalska, Katarzyna Pakulska, Krystyna Chodor- owska, Wojciech Walczak, and Piotr Andruszkiewicz. 2016. Samsung Poland NLP Team at SemEval-2016 Task 1: Necessity for diversity; combining recursive au- toencoders, wordnet and ensemble methods to measure semantic similarity. In Proceedings of SemEval-2016. http://www.aclweb.org/anthology/S16-1091.\n\n- Alexandre Salle, Marco Idiart, and Aline Villavicencio. 2016a. Enhancing the lexvec distributed word representation model using positional contexts and external memory. CoRR abs/1606.01283. http://arxiv.org/abs/1606.01283.\n\n- Alexandre Salle, Marco Idiart, and Aline Villavicencio. 2016b. Matrix factorization using window sampling and negative sampling for improved word representations. In Proceed- ings of ACL. http://aclweb.org/anthology/P16-2068.\n\n- Gilles Serasset. 2015. DBnary: Wiktionary as a lemon- based multilingual lexical resource in RDF. Semantic Web Journal (special issue on Multilingual Linked Open Data) 6:355-361. https://doi.org/10.3233/SW-140147.\n\n- Yang Shao. 2017. HCTI at SemEval-2017 Task 1: Use convolutional neural network to evaluate seman- tic textual similarity. In Proceedings of SemEval-2017. http://www.aclweb.org/anthology/S17-2016.\n\n- Yelong Shen, Xiaodong He, Jianfeng Gao, Li Deng, and Gregoire Mesnil. 2014. A latent semantic model with convolutional-pooling structure for in- formation retrieval. In Proceedings of CIKM '14. https://www.microsoft.com/en-us/research/publication/a- latent-semantic-model-with-convolutional-pooling- structure-for-information-retrieval/.\n\n- Matthew Snover, Bonnie Dorr, Richard Schwartz, Linnea Mic- ciulla, and John Makhoul. 2006. A study of translation edit rate with targeted human annotation. In Proceed- ings of AMTA 2006. http://mt-archive.info/AMTA-2006- Snover.pdf.\n\n- Martyna Śpiewak, Piotr Sobecki, and Daniel Karaś. 2017. OPI-JSA at SemEval-2017 Task 1: Appli- cation of ensemble learning for computing semantic textual similarity. In Proceedings of SemEval-2017. http://www.aclweb.org/anthology/S17-2018. Md Arafat Sultan, Steven Bethard, and Tamara Sumner. 2015. DLS@CU: Sentence similarity from word alignment and semantic vector composition. In Proceedings of SemEval 2015. http://aclweb.org/anthology/S/S15/S15-2027.pdf.\n\n- Junfeng Tian, Zhiheng Zhou, Man Lan, and Yuanbin Wu. 2017. ECNU at SemEval-2017 Task 1: Leverage kernel- based traditional nlp features and neural networks to build a universal model for multilingual and cross-lingual seman- tic textual similarity. In Proceedings of SemEval-2017. http://www.aclweb.org/anthology/S17-2028.\n\n- Frane Šarić, Goran Glavaš, Mladen Karan, Jan Šnajder, and Bojana Dalbelo Bašić. 2012a. Take- lab: Systems for measuring semantic text similar- ity. In Proceedings of *SEM 2012/SemEval 2012. http://www.aclweb.org/anthology/S12-1060.\n\n- Frane Šarić, Goran Glavaš, Mladen Karan, Jan Šnajder, and Bojana Dalbelo Bašić. 2012b. TakeLab: Systems for mea- suring semantic text similarity. In Proceedings of SemEval 2012. http://www.aclweb.org/anthology/S12-1060.\n\n- John Wieting, Mohit Bansal, Kevin Gimpel, and Karen Livescu. 2015. From paraphrase database to compositional paraphrase model and back. Transactions of the ACL (TACL) 3:345-358. http://aclweb.org/anthology/Q/Q15/Q15-1025.pdf.\n\n- John Wieting, Mohit Bansal, Kevin Gimpel, and Karen Livescu. 2016a. Charagram: Embedding words and sen- tences via character n-grams. In Proceedings of EMNLP. https://aclweb.org/anthology/D16-1157.\n\n- John Wieting, Mohit Bansal, Kevin Gimpel, and Karen Livescu. 2016b. Towards universal paraphrastic sen- tence embeddings. In Proceedings of ICLR 2016. http://arxiv.org/abs/1511.08198. John Wieting and Kevin Gimpel. 2017. Revisiting recurrent networks for paraphrastic sentence embeddings. CoRR abs/1705.00364. http://arxiv.org/abs/1705.00364.\n\n- Hao Wu, Heyan Huang, Ping Jian, Yuhang Guo, and Chao Su. 2017. BIT at SemEval-2017 Task 1: Us- ing semantic information space to evaluate semantic textual similarity. In Proceedings of SemEval-2017. http://www.aclweb.org/anthology/S17-2007.\n\n- Wei Xu, Chris Callison-Burch, and William B. Dolan. 2015. SemEval-2015 Task 1: Paraphrase and semantic similar- ity in Twitter (PIT). In Proceedings of SemEval 2015. http://www.aclweb.org/anthology/S15-2001.\n\n- Peter Young, Alice Lai, Micah Hodosh, and Julia Hock- enmaier. 2014. From image descriptions to vi- sual denotations: New similarity metrics for seman- tic inference over event descriptions. TACL 2:67-78. http://aclweb.org/anthology/Q14-1006.\n\n- WenLi Zhuang and Ernie Chang. 2017. Neobility at SemEval-2017 Task 1: An attention-based sen- tence similarity model. In Proceedings SemEval-2017. http://www.aclweb.org/anthology/S17-2023.\n\n", "annotations": {"Abstract": [{"begin": 100, "end": 1067, "idx": 0}], "Head": [{"begin": 1070, "end": 1084, "n": "1", "idx": 0}, {"begin": 5038, "end": 5053, "n": "2", "idx": 1}, {"begin": 5922, "end": 5939, "n": "3", "idx": 2}, {"begin": 6261, "end": 6262, "idx": 3}, {"begin": 6416, "end": 6417, "idx": 4}, {"begin": 6577, "end": 6578, "idx": 5}, {"begin": 6768, "end": 6769, "idx": 6}, {"begin": 6904, "end": 6905, "idx": 7}, {"begin": 7052, "end": 7053, "idx": 8}, {"begin": 8376, "end": 8386, "n": "3.1", "idx": 9}, {"begin": 8772, "end": 8792, "n": "3.2", "idx": 10}, {"begin": 9077, "end": 9120, "n": "3.3", "idx": 11}, {"begin": 9662, "end": 9696, "n": "3.4", "idx": 12}, {"begin": 10177, "end": 10189, "n": "4", "idx": 13}, {"begin": 10329, "end": 10357, "n": "4.1", "idx": 14}, {"begin": 10908, "end": 10929, "n": "4.2", "idx": 15}, {"begin": 11531, "end": 11546, "n": "5", "idx": 16}, {"begin": 12397, "end": 12438, "n": "5.1", "idx": 17}, {"begin": 13099, "end": 13118, "n": "6", "idx": 18}, {"begin": 13210, "end": 13227, "n": "6.1", "idx": 19}, {"begin": 13619, "end": 13640, "n": "6.2", "idx": 20}, {"begin": 13842, "end": 13853, "n": "6.3", "idx": 21}, {"begin": 13952, "end": 13964, "n": "6.4", "idx": 22}, {"begin": 14406, "end": 14418, "n": "6.5", "idx": 23}, {"begin": 15568, "end": 15579, "n": "6.6", "idx": 24}, {"begin": 22720, "end": 22730, "n": "7", "idx": 25}, {"begin": 25208, "end": 25268, "n": "7.1", "idx": 26}, {"begin": 26841, "end": 26856, "n": "8", "idx": 27}, {"begin": 28888, "end": 28900, "n": "9", "idx": 28}], "ReferenceToBib": [{"begin": 1748, "end": 1773, "target": "#b30", "idx": 0}, {"begin": 1774, "end": 1794, "target": "#b36", "idx": 1}, {"begin": 1795, "end": 1814, "target": "#b41", "idx": 2}, {"begin": 1837, "end": 1862, "target": "#b30", "idx": 3}, {"begin": 1888, "end": 1905, "target": "#b99", "idx": 4}, {"begin": 1906, "end": 1932, "target": "#b47", "idx": 5}, {"begin": 1933, "end": 1952, "target": "#b43", "idx": 6}, {"begin": 2595, "end": 2615, "target": "#b22", "idx": 7}, {"begin": 2616, "end": 2638, "target": "#b23", "idx": 8}, {"begin": 2639, "end": 2661, "target": "#b21", "idx": 9}, {"begin": 2662, "end": 2684, "target": "#b20", "idx": 10}, {"begin": 2685, "end": 2709, "target": "#b21", "idx": 11}, {"begin": 2889, "end": 2907, "target": "#b28", "idx": 12}, {"begin": 2908, "end": 2928, "target": "#b93", "idx": 13}, {"begin": 2929, "end": 2951, "target": "#b58", "idx": 14}, {"begin": 3031, "end": 3051, "target": "#b91", "idx": 15}, {"begin": 3174, "end": 3191, "idx": 16}, {"begin": 3293, "end": 3317, "target": "#b84", "idx": 17}, {"begin": 3517, "end": 3531, "target": "#b74", "idx": 18}, {"begin": 3532, "end": 3547, "target": "#b45", "idx": 19}, {"begin": 3558, "end": 3578, "target": "#b27", "idx": 20}, {"begin": 3590, "end": 3609, "target": "#b55", "idx": 21}, {"begin": 4584, "end": 4603, "target": "#b25", "idx": 22}, {"begin": 4605, "end": 4626, "target": "#b40", "idx": 23}, {"begin": 4628, "end": 4644, "target": "#b76", "idx": 24}, {"begin": 4646, "end": 4671, "target": "#b79", "idx": 25}, {"begin": 4673, "end": 4698, "target": "#b97", "idx": 26}, {"begin": 4700, "end": 4717, "idx": 27}, {"begin": 4719, "end": 4737, "target": "#b53", "idx": 28}, {"begin": 4739, "end": 4759, "target": "#b61", "idx": 29}, {"begin": 4785, "end": 4809, "idx": 30}, {"begin": 4811, "end": 4827, "target": "#b49", "idx": 31}, {"begin": 4829, "end": 4847, "target": "#b82", "idx": 32}, {"begin": 5765, "end": 5785, "target": "#b41", "idx": 33}, {"begin": 5994, "end": 6015, "target": "#b36", "idx": 34}, {"begin": 7197, "end": 7217, "target": "#b23", "idx": 35}, {"begin": 7381, "end": 7401, "target": "#b100", "idx": 36}, {"begin": 7669, "end": 7691, "target": "#b69", "idx": 37}, {"begin": 9878, "end": 9899, "target": "#b21", "idx": 38}, {"begin": 10642, "end": 10662, "target": "#b21", "idx": 39}, {"begin": 12163, "end": 12183, "target": "#b35", "idx": 40}, {"begin": 16179, "end": 16200, "target": "#b83", "idx": 41}, {"begin": 17011, "end": 17033, "idx": 42}, {"begin": 17054, "end": 17077, "target": "#b67", "idx": 43}, {"begin": 17092, "end": 17115, "target": "#b67", "idx": 44}, {"begin": 17130, "end": 17153, "target": "#b67", "idx": 45}, {"begin": 17166, "end": 17187, "target": "#b48", "idx": 46}, {"begin": 17204, "end": 17222, "target": "#b66", "idx": 47}, {"begin": 17239, "end": 17257, "target": "#b66", "idx": 48}, {"begin": 17274, "end": 17292, "target": "#b66", "idx": 49}, {"begin": 17312, "end": 17333, "target": "#b46", "idx": 50}, {"begin": 17334, "end": 17357, "idx": 51}, {"begin": 17372, "end": 17395, "idx": 52}, {"begin": 17410, "end": 17433, "idx": 53}, {"begin": 17450, "end": 17468, "target": "#b65", "idx": 54}, {"begin": 17485, "end": 17503, "target": "#b65", "idx": 55}, {"begin": 17520, "end": 17538, "target": "#b65", "idx": 56}, {"begin": 17550, "end": 17569, "target": "#b71", "idx": 57}, {"begin": 17583, "end": 17602, "target": "#b71", "idx": 58}, {"begin": 17614, "end": 17633, "target": "#b71", "idx": 59}, {"begin": 17956, "end": 17985, "target": "#b42", "idx": 60}, {"begin": 17992, "end": 18011, "target": "#b92", "idx": 61}, {"begin": 18359, "end": 18376, "target": "#b75", "idx": 62}, {"begin": 18394, "end": 18415, "target": "#b91", "idx": 63}, {"begin": 18772, "end": 18792, "target": "#b57", "idx": 64}, {"begin": 18801, "end": 18835, "target": "#b54", "idx": 65}, {"begin": 19100, "end": 19117, "target": "#b98", "idx": 66}, {"begin": 19619, "end": 19631, "target": "#b88", "idx": 67}, {"begin": 19751, "end": 19770, "target": "#b39", "idx": 68}, {"begin": 19771, "end": 19790, "target": "#b56", "idx": 69}, {"begin": 20117, "end": 20142, "target": "#b29", "idx": 70}, {"begin": 20231, "end": 20255, "target": "#b52", "idx": 71}, {"begin": 20446, "end": 20468, "idx": 72}, {"begin": 20716, "end": 20735, "target": "#b38", "idx": 73}, {"begin": 20743, "end": 20764, "target": "#b48", "idx": 74}, {"begin": 20846, "end": 20874, "target": "#b78", "idx": 75}, {"begin": 21256, "end": 21279, "target": "#b59", "idx": 76}, {"begin": 21290, "end": 21312, "idx": 77}, {"begin": 21472, "end": 21488, "target": "#b87", "idx": 78}, {"begin": 21515, "end": 21536, "target": "#b31", "idx": 79}, {"begin": 21545, "end": 21567, "target": "#b77", "idx": 80}, {"begin": 22002, "end": 22025, "target": "#b67", "idx": 81}, {"begin": 22155, "end": 22175, "target": "#b56", "idx": 82}, {"begin": 22183, "end": 22202, "target": "#b89", "idx": 83}, {"begin": 28235, "end": 28259, "idx": 84}, {"begin": 29193, "end": 29215, "idx": 85}, {"begin": 30695, "end": 30701, "idx": 86}, {"begin": 30702, "end": 30708, "idx": 87}, {"begin": 30709, "end": 30715, "idx": 88}, {"begin": 30716, "end": 30722, "idx": 89}, {"begin": 30723, "end": 30729, "idx": 90}, {"begin": 30730, "end": 30736, "idx": 91}, {"begin": 31442, "end": 31467, "target": "#b81", "idx": 92}, {"begin": 31507, "end": 31528, "target": "#b80", "idx": 93}, {"begin": 32226, "end": 32246, "target": "#b25", "idx": 94}], "ReferenceToFootnote": [{"begin": 9428, "end": 9429, "target": "#foot_2", "idx": 0}, {"begin": 9659, "end": 9660, "target": "#foot_3", "idx": 1}, {"begin": 10028, "end": 10029, "target": "#foot_4", "idx": 2}, {"begin": 10422, "end": 10423, "target": "#foot_5", "idx": 3}, {"begin": 10805, "end": 10806, "target": "#foot_6", "idx": 4}, {"begin": 13948, "end": 13950, "target": "#foot_8", "idx": 5}, {"begin": 14102, "end": 14104, "target": "#foot_9", "idx": 6}, {"begin": 14223, "end": 14225, "target": "#foot_10", "idx": 7}, {"begin": 19094, "end": 19096, "target": "#foot_11", "idx": 8}, {"begin": 21642, "end": 21644, "target": "#foot_12", "idx": 9}, {"begin": 22060, "end": 22062, "target": "#foot_13", "idx": 10}, {"begin": 27124, "end": 27126, "target": "#foot_14", "idx": 11}, {"begin": 27563, "end": 27565, "target": "#foot_15", "idx": 12}], "SectionFootnote": [{"begin": 30990, "end": 32800, "idx": 0}], "ReferenceString": [{"begin": 32817, "end": 33732, "id": "b0", "idx": 0}, {"begin": 33734, "end": 34248, "id": "b1", "idx": 1}, {"begin": 34252, "end": 34352, "id": "b2", "idx": 2}, {"begin": 34356, "end": 34409, "id": "b3", "idx": 3}, {"begin": 34413, "end": 34561, "id": "b4", "idx": 4}, {"begin": 34565, "end": 34668, "id": "b5", "idx": 5}, {"begin": 34672, "end": 34860, "id": "b6", "idx": 6}, {"begin": 34864, "end": 34928, "id": "b7", "idx": 7}, {"begin": 34932, "end": 35132, "id": "b8", "idx": 8}, {"begin": 35136, "end": 35225, "id": "b9", "idx": 9}, {"begin": 35229, "end": 35348, "id": "b10", "idx": 10}, {"begin": 35352, "end": 35435, "id": "b11", "idx": 11}, {"begin": 35439, "end": 35519, "id": "b12", "idx": 12}, {"begin": 35523, "end": 35604, "id": "b13", "idx": 13}, {"begin": 35608, "end": 35710, "id": "b14", "idx": 14}, {"begin": 35714, "end": 35826, "id": "b15", "idx": 15}, {"begin": 35830, "end": 35912, "id": "b16", "idx": 16}, {"begin": 35916, "end": 36004, "id": "b17", "idx": 17}, {"begin": 36008, "end": 36089, "id": "b18", "idx": 18}, {"begin": 36093, "end": 36187, "id": "b19", "idx": 19}, {"begin": 36191, "end": 36654, "id": "b20", "idx": 20}, {"begin": 36658, "end": 37208, "id": "b21", "idx": 21}, {"begin": 37212, "end": 37427, "id": "b22", "idx": 22}, {"begin": 37431, "end": 37637, "id": "b23", "idx": 23}, {"begin": 37641, "end": 37953, "id": "b24", "idx": 24}, {"begin": 37957, "end": 38139, "id": "b25", "idx": 25}, {"begin": 38143, "end": 38389, "id": "b26", "idx": 26}, {"begin": 38393, "end": 38564, "id": "b27", "idx": 27}, {"begin": 38568, "end": 38817, "id": "b28", "idx": 28}, {"begin": 38821, "end": 39031, "id": "b29", "idx": 29}, {"begin": 39035, "end": 39411, "id": "b30", "idx": 30}, {"begin": 39415, "end": 39675, "id": "b31", "idx": 31}, {"begin": 39679, "end": 39812, "id": "b32", "idx": 32}, {"begin": 39816, "end": 40011, "id": "b33", "idx": 33}, {"begin": 40015, "end": 40229, "id": "b34", "idx": 34}, {"begin": 40233, "end": 40896, "id": "b35", "idx": 35}, {"begin": 40900, "end": 41129, "id": "b36", "idx": 36}, {"begin": 41133, "end": 41369, "id": "b37", "idx": 37}, {"begin": 41373, "end": 41575, "id": "b38", "idx": 38}, {"begin": 41579, "end": 41976, "id": "b39", "idx": 39}, {"begin": 41980, "end": 42221, "id": "b40", "idx": 40}, {"begin": 42225, "end": 42433, "id": "b41", "idx": 41}, {"begin": 42437, "end": 42625, "id": "b42", "idx": 42}, {"begin": 42629, "end": 43094, "id": "b43", "idx": 43}, {"begin": 43098, "end": 43299, "id": "b44", "idx": 44}, {"begin": 43303, "end": 43690, "id": "b45", "idx": 45}, {"begin": 43694, "end": 43951, "id": "b46", "idx": 46}, {"begin": 43955, "end": 44136, "id": "b47", "idx": 47}, {"begin": 44140, "end": 44385, "id": "b48", "idx": 48}, {"begin": 44389, "end": 44597, "id": "b49", "idx": 49}, {"begin": 44601, "end": 44799, "id": "b50", "idx": 50}, {"begin": 44803, "end": 45095, "id": "b51", "idx": 51}, {"begin": 45099, "end": 45312, "id": "b52", "idx": 52}, {"begin": 45316, "end": 45510, "id": "b53", "idx": 53}, {"begin": 45514, "end": 45660, "id": "b54", "idx": 54}, {"begin": 45664, "end": 45862, "id": "b55", "idx": 55}, {"begin": 45866, "end": 46192, "id": "b56", "idx": 56}, {"begin": 46196, "end": 46421, "id": "b57", "idx": 57}, {"begin": 46425, "end": 46650, "id": "b58", "idx": 58}, {"begin": 46654, "end": 46886, "id": "b59", "idx": 59}, {"begin": 46890, "end": 47067, "id": "b60", "idx": 60}, {"begin": 47071, "end": 47262, "id": "b61", "idx": 61}, {"begin": 47266, "end": 47464, "id": "b62", "idx": 62}, {"begin": 47468, "end": 47713, "id": "b63", "idx": 63}, {"begin": 47717, "end": 48120, "id": "b64", "idx": 64}, {"begin": 48124, "end": 48435, "id": "b65", "idx": 65}, {"begin": 48439, "end": 48675, "id": "b66", "idx": 66}, {"begin": 48679, "end": 48976, "id": "b67", "idx": 67}, {"begin": 48980, "end": 49241, "id": "b68", "idx": 68}, {"begin": 49245, "end": 49532, "id": "b69", "idx": 69}, {"begin": 49536, "end": 49767, "id": "b70", "idx": 70}, {"begin": 49771, "end": 50017, "id": "b71", "idx": 71}, {"begin": 50021, "end": 50200, "id": "b72", "idx": 72}, {"begin": 50204, "end": 50506, "id": "b73", "idx": 73}, {"begin": 50510, "end": 50639, "id": "b74", "idx": 74}, {"begin": 50643, "end": 50816, "id": "b75", "idx": 75}, {"begin": 50820, "end": 50970, "id": "b76", "idx": 76}, {"begin": 50974, "end": 51226, "id": "b77", "idx": 77}, {"begin": 51230, "end": 51419, "id": "b78", "idx": 78}, {"begin": 51423, "end": 51609, "id": "b79", "idx": 79}, {"begin": 51613, "end": 51793, "id": "b80", "idx": 80}, {"begin": 51797, "end": 51985, "id": "b81", "idx": 81}, {"begin": 51989, "end": 52239, "id": "b82", "idx": 82}, {"begin": 52243, "end": 52434, "id": "b83", "idx": 83}, {"begin": 52438, "end": 52794, "id": "b84", "idx": 84}, {"begin": 52798, "end": 53020, "id": "b85", "idx": 85}, {"begin": 53024, "end": 53249, "id": "b86", "idx": 86}, {"begin": 53253, "end": 53466, "id": "b87", "idx": 87}, {"begin": 53470, "end": 53665, "id": "b88", "idx": 88}, {"begin": 53669, "end": 54006, "id": "b89", "idx": 89}, {"begin": 54010, "end": 54242, "id": "b90", "idx": 90}, {"begin": 54246, "end": 54705, "id": "b91", "idx": 91}, {"begin": 54709, "end": 55031, "id": "b92", "idx": 92}, {"begin": 55035, "end": 55266, "id": "b93", "idx": 93}, {"begin": 55270, "end": 55489, "id": "b94", "idx": 94}, {"begin": 55493, "end": 55718, "id": "b95", "idx": 95}, {"begin": 55722, "end": 55919, "id": "b96", "idx": 96}, {"begin": 55923, "end": 56265, "id": "b97", "idx": 97}, {"begin": 56269, "end": 56509, "id": "b98", "idx": 98}, {"begin": 56513, "end": 56720, "id": "b99", "idx": 99}, {"begin": 56724, "end": 56966, "id": "b100", "idx": 100}, {"begin": 56970, "end": 57158, "id": "b101", "idx": 101}], "ReferenceToTable": [{"begin": 5344, "end": 5345, "target": "#tab_0", "idx": 0}, {"begin": 8345, "end": 8346, "idx": 1}, {"begin": 8393, "end": 8394, "idx": 2}, {"begin": 13370, "end": 13371, "target": "#tab_12", "idx": 3}, {"begin": 14464, "end": 14466, "target": "#tab_0", "idx": 4}, {"begin": 17634, "end": 17636, "target": "#tab_0", "idx": 5}, {"begin": 23434, "end": 23436, "target": "#tab_19", "idx": 6}, {"begin": 27478, "end": 27480, "target": "#tab_5", "idx": 7}, {"begin": 27812, "end": 27814, "target": "#tab_5", "idx": 8}], "Footnote": [{"begin": 31001, "end": 31175, "id": "foot_0", "n": "3", "idx": 0}, {"begin": 31176, "end": 31295, "id": "foot_1", "n": "4", "idx": 1}, {"begin": 31296, "end": 31336, "id": "foot_2", "n": "5", "idx": 2}, {"begin": 31337, "end": 31394, "id": "foot_3", "n": "6", "idx": 3}, {"begin": 31395, "end": 31604, "id": "foot_4", "n": "7", "idx": 4}, {"begin": 31605, "end": 31631, "id": "foot_5", "n": "8", "idx": 5}, {"begin": 31632, "end": 31744, "id": "foot_6", "n": "9", "idx": 6}, {"begin": 31745, "end": 31914, "id": "foot_7", "n": "10", "idx": 7}, {"begin": 31915, "end": 31971, "id": "foot_8", "n": "11", "idx": 8}, {"begin": 31972, "end": 32060, "id": "foot_9", "n": "12", "idx": 9}, {"begin": 32061, "end": 32095, "id": "foot_10", "n": "13", "idx": 10}, {"begin": 32096, "end": 32190, "id": "foot_11", "n": "16", "idx": 11}, {"begin": 32191, "end": 32300, "id": "foot_12", "n": "17", "idx": 12}, {"begin": 32301, "end": 32389, "id": "foot_13", "n": "18", "idx": 13}, {"begin": 32390, "end": 32628, "id": "foot_14", "n": "23", "idx": 14}, {"begin": 32629, "end": 32800, "id": "foot_15", "n": "24", "idx": 15}], "ReferenceToFormula": [{"begin": 19341, "end": 19345, "idx": 0}, {"begin": 21174, "end": 21178, "idx": 1}], "Paragraph": [{"begin": 110, "end": 1067, "idx": 0}, {"begin": 1085, "end": 2417, "idx": 1}, {"begin": 2418, "end": 3318, "idx": 2}, {"begin": 3319, "end": 4452, "idx": 3}, {"begin": 4453, "end": 5036, "idx": 4}, {"begin": 5054, "end": 5920, "idx": 5}, {"begin": 5940, "end": 6259, "idx": 6}, {"begin": 6263, "end": 6414, "idx": 7}, {"begin": 6418, "end": 6575, "idx": 8}, {"begin": 6579, "end": 6766, "idx": 9}, {"begin": 6770, "end": 6902, "idx": 10}, {"begin": 6906, "end": 7050, "idx": 11}, {"begin": 7054, "end": 7218, "idx": 12}, {"begin": 7219, "end": 7805, "idx": 13}, {"begin": 7806, "end": 8374, "idx": 14}, {"begin": 8387, "end": 8435, "idx": 15}, {"begin": 8436, "end": 8770, "idx": 16}, {"begin": 8793, "end": 9075, "idx": 17}, {"begin": 9121, "end": 9660, "idx": 18}, {"begin": 9697, "end": 10116, "idx": 19}, {"begin": 10190, "end": 10327, "idx": 20}, {"begin": 10358, "end": 10906, "idx": 21}, {"begin": 10930, "end": 11529, "idx": 22}, {"begin": 11547, "end": 12395, "idx": 23}, {"begin": 12439, "end": 13097, "idx": 24}, {"begin": 13119, "end": 13208, "idx": 25}, {"begin": 13228, "end": 13617, "idx": 26}, {"begin": 13641, "end": 13840, "idx": 27}, {"begin": 13854, "end": 13950, "idx": 28}, {"begin": 13965, "end": 14404, "idx": 29}, {"begin": 14419, "end": 14671, "idx": 30}, {"begin": 14672, "end": 15018, "idx": 31}, {"begin": 15019, "end": 15566, "idx": 32}, {"begin": 15580, "end": 16525, "idx": 33}, {"begin": 16526, "end": 17986, "idx": 34}, {"begin": 17987, "end": 19613, "idx": 35}, {"begin": 19614, "end": 20224, "idx": 36}, {"begin": 20225, "end": 20736, "idx": 37}, {"begin": 20737, "end": 21280, "idx": 38}, {"begin": 21281, "end": 21993, "idx": 39}, {"begin": 21994, "end": 22718, "idx": 40}, {"begin": 22731, "end": 23427, "idx": 41}, {"begin": 23428, "end": 25206, "idx": 42}, {"begin": 25269, "end": 25842, "idx": 43}, {"begin": 25843, "end": 26839, "idx": 44}, {"begin": 26857, "end": 27902, "idx": 45}, {"begin": 27903, "end": 28563, "idx": 46}, {"begin": 28564, "end": 28886, "idx": 47}, {"begin": 28901, "end": 29671, "idx": 48}, {"begin": 29672, "end": 30988, "idx": 49}], "SectionHeader": [{"begin": 0, "end": 1067, "idx": 0}], "SectionReference": [{"begin": 32802, "end": 57160, "idx": 0}], "Sentence": [{"begin": 110, "end": 189, "idx": 0}, {"begin": 190, "end": 362, "idx": 1}, {"begin": 363, "end": 437, "idx": 2}, {"begin": 438, "end": 563, "idx": 3}, {"begin": 564, "end": 663, "idx": 4}, {"begin": 664, "end": 739, "idx": 5}, {"begin": 740, "end": 833, "idx": 6}, {"begin": 834, "end": 1067, "idx": 7}, {"begin": 1085, "end": 1204, "idx": 8}, {"begin": 1205, "end": 1556, "idx": 9}, {"begin": 1557, "end": 1680, "idx": 10}, {"begin": 1681, "end": 1953, "idx": 11}, {"begin": 1954, "end": 2140, "idx": 12}, {"begin": 2141, "end": 2417, "idx": 13}, {"begin": 2418, "end": 2710, "idx": 14}, {"begin": 2711, "end": 2791, "idx": 15}, {"begin": 2792, "end": 2952, "idx": 16}, {"begin": 2953, "end": 3078, "idx": 17}, {"begin": 3079, "end": 3192, "idx": 18}, {"begin": 3193, "end": 3318, "idx": 19}, {"begin": 3319, "end": 3678, "idx": 20}, {"begin": 3679, "end": 3740, "idx": 21}, {"begin": 3741, "end": 3787, "idx": 22}, {"begin": 3788, "end": 3869, "idx": 23}, {"begin": 3870, "end": 4000, "idx": 24}, {"begin": 4001, "end": 4190, "idx": 25}, {"begin": 4191, "end": 4355, "idx": 26}, {"begin": 4356, "end": 4452, "idx": 27}, {"begin": 4453, "end": 4849, "idx": 28}, {"begin": 4850, "end": 5036, "idx": 29}, {"begin": 5054, "end": 5147, "idx": 30}, {"begin": 5148, "end": 5225, "idx": 31}, {"begin": 5226, "end": 5316, "idx": 32}, {"begin": 5317, "end": 5438, "idx": 33}, {"begin": 5439, "end": 5518, "idx": 34}, {"begin": 5519, "end": 5640, "idx": 35}, {"begin": 5641, "end": 5786, "idx": 36}, {"begin": 5787, "end": 5920, "idx": 37}, {"begin": 5940, "end": 6138, "idx": 38}, {"begin": 6139, "end": 6259, "idx": 39}, {"begin": 6263, "end": 6336, "idx": 40}, {"begin": 6337, "end": 6369, "idx": 41}, {"begin": 6370, "end": 6414, "idx": 42}, {"begin": 6418, "end": 6495, "idx": 43}, {"begin": 6496, "end": 6540, "idx": 44}, {"begin": 6541, "end": 6575, "idx": 45}, {"begin": 6579, "end": 6668, "idx": 46}, {"begin": 6669, "end": 6724, "idx": 47}, {"begin": 6725, "end": 6755, "idx": 48}, {"begin": 6756, "end": 6766, "idx": 49}, {"begin": 6770, "end": 6831, "idx": 50}, {"begin": 6832, "end": 6868, "idx": 51}, {"begin": 6869, "end": 6902, "idx": 52}, {"begin": 6906, "end": 6970, "idx": 53}, {"begin": 6971, "end": 7003, "idx": 54}, {"begin": 7004, "end": 7050, "idx": 55}, {"begin": 7054, "end": 7098, "idx": 56}, {"begin": 7099, "end": 7141, "idx": 57}, {"begin": 7142, "end": 7195, "idx": 58}, {"begin": 7196, "end": 7218, "idx": 59}, {"begin": 7219, "end": 7319, "idx": 60}, {"begin": 7320, "end": 7488, "idx": 61}, {"begin": 7489, "end": 7603, "idx": 62}, {"begin": 7604, "end": 7805, "idx": 63}, {"begin": 7806, "end": 7939, "idx": 64}, {"begin": 7940, "end": 8079, "idx": 65}, {"begin": 8080, "end": 8240, "idx": 66}, {"begin": 8241, "end": 8338, "idx": 67}, {"begin": 8339, "end": 8374, "idx": 68}, {"begin": 8387, "end": 8435, "idx": 69}, {"begin": 8436, "end": 8509, "idx": 70}, {"begin": 8510, "end": 8608, "idx": 71}, {"begin": 8609, "end": 8770, "idx": 72}, {"begin": 8793, "end": 8855, "idx": 73}, {"begin": 8856, "end": 9008, "idx": 74}, {"begin": 9009, "end": 9075, "idx": 75}, {"begin": 9121, "end": 9195, "idx": 76}, {"begin": 9196, "end": 9252, "idx": 77}, {"begin": 9253, "end": 9350, "idx": 78}, {"begin": 9351, "end": 9480, "idx": 79}, {"begin": 9481, "end": 9614, "idx": 80}, {"begin": 9615, "end": 9660, "idx": 81}, {"begin": 9697, "end": 9813, "idx": 82}, {"begin": 9814, "end": 9934, "idx": 83}, {"begin": 9935, "end": 10116, "idx": 84}, {"begin": 10190, "end": 10327, "idx": 85}, {"begin": 10358, "end": 10486, "idx": 86}, {"begin": 10487, "end": 10583, "idx": 87}, {"begin": 10584, "end": 10663, "idx": 88}, {"begin": 10664, "end": 10746, "idx": 89}, {"begin": 10747, "end": 10787, "idx": 90}, {"begin": 10788, "end": 10853, "idx": 91}, {"begin": 10854, "end": 10906, "idx": 92}, {"begin": 10930, "end": 11113, "idx": 93}, {"begin": 11114, "end": 11211, "idx": 94}, {"begin": 11212, "end": 11304, "idx": 95}, {"begin": 11305, "end": 11400, "idx": 96}, {"begin": 11401, "end": 11529, "idx": 97}, {"begin": 11547, "end": 11694, "idx": 98}, {"begin": 11695, "end": 11839, "idx": 99}, {"begin": 11840, "end": 12017, "idx": 100}, {"begin": 12018, "end": 12184, "idx": 101}, {"begin": 12185, "end": 12395, "idx": 102}, {"begin": 12439, "end": 12734, "idx": 103}, {"begin": 12735, "end": 12807, "idx": 104}, {"begin": 12808, "end": 12893, "idx": 105}, {"begin": 12894, "end": 13007, "idx": 106}, {"begin": 13008, "end": 13097, "idx": 107}, {"begin": 13119, "end": 13208, "idx": 108}, {"begin": 13228, "end": 13301, "idx": 109}, {"begin": 13302, "end": 13363, "idx": 110}, {"begin": 13364, "end": 13406, "idx": 111}, {"begin": 13407, "end": 13498, "idx": 112}, {"begin": 13499, "end": 13571, "idx": 113}, {"begin": 13572, "end": 13617, "idx": 114}, {"begin": 13641, "end": 13723, "idx": 115}, {"begin": 13724, "end": 13840, "idx": 116}, {"begin": 13854, "end": 13950, "idx": 117}, {"begin": 13965, "end": 14104, "idx": 118}, {"begin": 14105, "end": 14225, "idx": 119}, {"begin": 14226, "end": 14404, "idx": 120}, {"begin": 14419, "end": 14467, "idx": 121}, {"begin": 14468, "end": 14671, "idx": 122}, {"begin": 14672, "end": 14736, "idx": 123}, {"begin": 14737, "end": 14805, "idx": 124}, {"begin": 14806, "end": 14911, "idx": 125}, {"begin": 14912, "end": 15018, "idx": 126}, {"begin": 15019, "end": 15140, "idx": 127}, {"begin": 15141, "end": 15262, "idx": 128}, {"begin": 15263, "end": 15377, "idx": 129}, {"begin": 15378, "end": 15426, "idx": 130}, {"begin": 15427, "end": 15566, "idx": 131}, {"begin": 15580, "end": 15710, "idx": 132}, {"begin": 15711, "end": 15999, "idx": 133}, {"begin": 16000, "end": 16131, "idx": 134}, {"begin": 16132, "end": 16172, "idx": 135}, {"begin": 16173, "end": 16525, "idx": 136}, {"begin": 16526, "end": 16649, "idx": 137}, {"begin": 16650, "end": 16778, "idx": 138}, {"begin": 16779, "end": 16870, "idx": 139}, {"begin": 16871, "end": 16949, "idx": 140}, {"begin": 16950, "end": 17009, "idx": 141}, {"begin": 17010, "end": 17706, "idx": 142}, {"begin": 17707, "end": 17766, "idx": 143}, {"begin": 17767, "end": 17986, "idx": 144}, {"begin": 17987, "end": 18134, "idx": 145}, {"begin": 18135, "end": 18585, "idx": 146}, {"begin": 18586, "end": 18836, "idx": 147}, {"begin": 18837, "end": 18999, "idx": 148}, {"begin": 19000, "end": 19096, "idx": 149}, {"begin": 19097, "end": 19253, "idx": 150}, {"begin": 19254, "end": 19298, "idx": 151}, {"begin": 19299, "end": 19472, "idx": 152}, {"begin": 19473, "end": 19545, "idx": 153}, {"begin": 19546, "end": 19613, "idx": 154}, {"begin": 19614, "end": 19791, "idx": 155}, {"begin": 19792, "end": 19873, "idx": 156}, {"begin": 19874, "end": 20038, "idx": 157}, {"begin": 20039, "end": 20109, "idx": 158}, {"begin": 20110, "end": 20224, "idx": 159}, {"begin": 20225, "end": 20381, "idx": 160}, {"begin": 20382, "end": 20736, "idx": 161}, {"begin": 20737, "end": 20875, "idx": 162}, {"begin": 20876, "end": 20999, "idx": 163}, {"begin": 21000, "end": 21189, "idx": 164}, {"begin": 21190, "end": 21280, "idx": 165}, {"begin": 21281, "end": 21644, "idx": 166}, {"begin": 21645, "end": 21749, "idx": 167}, {"begin": 21750, "end": 21803, "idx": 168}, {"begin": 21804, "end": 21845, "idx": 169}, {"begin": 21846, "end": 21993, "idx": 170}, {"begin": 21994, "end": 22313, "idx": 171}, {"begin": 22314, "end": 22414, "idx": 172}, {"begin": 22415, "end": 22562, "idx": 173}, {"begin": 22563, "end": 22718, "idx": 174}, {"begin": 22731, "end": 22881, "idx": 175}, {"begin": 22882, "end": 23089, "idx": 176}, {"begin": 23090, "end": 23242, "idx": 177}, {"begin": 23243, "end": 23427, "idx": 178}, {"begin": 23428, "end": 23772, "idx": 179}, {"begin": 23773, "end": 23923, "idx": 180}, {"begin": 23924, "end": 24474, "idx": 181}, {"begin": 24475, "end": 24538, "idx": 182}, {"begin": 24539, "end": 24574, "idx": 183}, {"begin": 24575, "end": 24814, "idx": 184}, {"begin": 24815, "end": 24992, "idx": 185}, {"begin": 24993, "end": 25206, "idx": 186}, {"begin": 25269, "end": 25579, "idx": 187}, {"begin": 25580, "end": 25669, "idx": 188}, {"begin": 25670, "end": 25842, "idx": 189}, {"begin": 25843, "end": 26020, "idx": 190}, {"begin": 26021, "end": 26205, "idx": 191}, {"begin": 26206, "end": 26325, "idx": 192}, {"begin": 26326, "end": 26420, "idx": 193}, {"begin": 26421, "end": 26527, "idx": 194}, {"begin": 26528, "end": 26613, "idx": 195}, {"begin": 26614, "end": 26734, "idx": 196}, {"begin": 26735, "end": 26839, "idx": 197}, {"begin": 26857, "end": 26987, "idx": 198}, {"begin": 26988, "end": 27057, "idx": 199}, {"begin": 27058, "end": 27126, "idx": 200}, {"begin": 27127, "end": 27205, "idx": 201}, {"begin": 27206, "end": 27335, "idx": 202}, {"begin": 27336, "end": 27471, "idx": 203}, {"begin": 27472, "end": 27642, "idx": 204}, {"begin": 27643, "end": 27831, "idx": 205}, {"begin": 27832, "end": 27902, "idx": 206}, {"begin": 27903, "end": 27993, "idx": 207}, {"begin": 27994, "end": 28119, "idx": 208}, {"begin": 28120, "end": 28233, "idx": 209}, {"begin": 28234, "end": 28397, "idx": 210}, {"begin": 28398, "end": 28563, "idx": 211}, {"begin": 28564, "end": 28747, "idx": 212}, {"begin": 28748, "end": 28804, "idx": 213}, {"begin": 28805, "end": 28886, "idx": 214}, {"begin": 28901, "end": 28959, "idx": 215}, {"begin": 28960, "end": 29390, "idx": 216}, {"begin": 29391, "end": 29671, "idx": 217}, {"begin": 29672, "end": 29711, "idx": 218}, {"begin": 29712, "end": 29800, "idx": 219}, {"begin": 29801, "end": 29912, "idx": 220}, {"begin": 29913, "end": 30064, "idx": 221}, {"begin": 30065, "end": 30233, "idx": 222}, {"begin": 30234, "end": 30347, "idx": 223}, {"begin": 30348, "end": 30546, "idx": 224}, {"begin": 30547, "end": 30737, "idx": 225}, {"begin": 30738, "end": 30894, "idx": 226}, {"begin": 30895, "end": 30988, "idx": 227}], "ReferenceToFigure": [{"begin": 22738, "end": 22739, "target": "#fig_2", "idx": 0}], "Div": [{"begin": 110, "end": 1067, "idx": 0}, {"begin": 1070, "end": 5036, "idx": 1}, {"begin": 5038, "end": 5920, "idx": 2}, {"begin": 5922, "end": 6259, "idx": 3}, {"begin": 6261, "end": 6414, "idx": 4}, {"begin": 6416, "end": 6575, "idx": 5}, {"begin": 6577, "end": 6766, "idx": 6}, {"begin": 6768, "end": 6902, "idx": 7}, {"begin": 6904, "end": 7050, "idx": 8}, {"begin": 7052, "end": 8374, "idx": 9}, {"begin": 8376, "end": 8770, "idx": 10}, {"begin": 8772, "end": 9075, "idx": 11}, {"begin": 9077, "end": 9660, "idx": 12}, {"begin": 9662, "end": 10175, "idx": 13}, {"begin": 10177, "end": 10327, "idx": 14}, {"begin": 10329, "end": 10906, "idx": 15}, {"begin": 10908, "end": 11529, "idx": 16}, {"begin": 11531, "end": 12395, "idx": 17}, {"begin": 12397, "end": 13097, "idx": 18}, {"begin": 13099, "end": 13208, "idx": 19}, {"begin": 13210, "end": 13617, "idx": 20}, {"begin": 13619, "end": 13840, "idx": 21}, {"begin": 13842, "end": 13950, "idx": 22}, {"begin": 13952, "end": 14404, "idx": 23}, {"begin": 14406, "end": 15566, "idx": 24}, {"begin": 15568, "end": 22718, "idx": 25}, {"begin": 22720, "end": 25206, "idx": 26}, {"begin": 25208, "end": 26839, "idx": 27}, {"begin": 26841, "end": 28886, "idx": 28}, {"begin": 28888, "end": 30988, "idx": 29}], "SectionMain": [{"begin": 1067, "end": 30988, "idx": 0}]}}