{"text": "Distilling the Knowledge in a Neural Network\n\nAbstract:\nA very simple way to improve the performance of almost any machine learning algorithm is to train many different models on the same data and then to average their predictions [3]. Unfortunately, making predictions using a whole ensemble of models is cumbersome and may be too computationally expensive to allow deployment to a large number of users, especially if the individual models are large neural nets. Caruana and his collaborators [1] have shown that it is possible to compress the knowledge in an ensemble into a single model which is much easier to deploy and we develop this approach further using a different compression technique. We achieve some surprising results on MNIST and we show that we can significantly improve the acoustic model of a heavily used commercial system by distilling the knowledge in an ensemble of models into a single model. We also introduce a new type of ensemble composed of one or more full models and many specialist models which learn to distinguish fine-grained classes that the full models confuse. Unlike a mixture of experts, these specialist models can be trained rapidly and in parallel.\n\n\n1 Introduction\nMany insects have a larval form that is optimized for extracting energy and nutrients from the environment and a completely different adult form that is optimized for the very different requirements of traveling and reproduction. In large-scale machine learning, we typically use very similar models for the training stage and the deployment stage despite their very different requirements: For tasks like speech and object recognition, training must extract structure from very large, highly redundant datasets but it does not need to operate in real time and it can use a huge amount of computation. Deployment to a large number of users, however, has much more stringent requirements on latency and computational resources. The analogy with insects suggests that we should be willing to train very cumbersome models if that makes it easier to extract structure from the data. The cumbersome model could be an ensemble of separately trained models or a single very large model trained with a very strong regularizer such as dropout [9]. Once the cumbersome model has been trained, we can then use a different kind of training, which we call \"distillation\" to transfer the knowledge from the cumbersome model to a small model that is more suitable for deployment. A version of this strategy has already been pioneered by Rich Caruana and his collaborators [1]. In their important paper they demonstrate convincingly that the knowledge acquired by a large ensemble of models can be transferred to a single small model.\nA conceptual block that may have prevented more investigation of this very promising approach is that we tend to identify the knowledge in a trained model with the learned parameter values and this makes it hard to see how we can change the form of the model but keep the same knowledge. A more abstract view of the knowledge, that frees it from any particular instantiation, is that it is a learned mapping from input vectors to output vectors. For cumbersome models that learn to discriminate between a large number of classes, the normal training objective is to maximize the average log probability of the correct answer, but a side-effect of the learning is that the trained model assigns probabilities to all of the incorrect answers and even when these probabilities are very small, some of them are much larger than others. The relative probabilities of incorrect answers tell us a lot about how the cumbersome model tends to generalize. An image of a BMW, for example, may only have a very small chance of being mistaken for a garbage truck, but that mistake is still many times more probable than mistaking it for a carrot.\nIt is generally accepted that the objective function used for training should reflect the true objective of the user as closely as possible. Despite this, models are usually trained to optimize performance on the training data when the real objective is to generalize well to new data. It would clearly be better to train models to generalize well, but this requires information about the correct way to generalize and this information is not normally available. When we are distilling the knowledge from a large model into a small one, however, we can train the small model to generalize in the same way as the large model. If the cumbersome model generalizes well because, for example, it is the average of a large ensemble of different models, a small model trained to generalize in the same way will typically do much better on test data than a small model that is trained in the normal way on the same training set as was used to train the ensemble.\nAn obvious way to transfer the generalization ability of the cumbersome model to a small model is to use the class probabilities produced by the cumbersome model as \"soft targets\" for training the small model. For this transfer stage, we could use the same training set or a separate \"transfer\" set. When the cumbersome model is a large ensemble of simpler models, we can use an arithmetic or geometric mean of their individual predictive distributions as the soft targets. When the soft targets have high entropy, they provide much more information per training case than hard targets and much less variance in the gradient between training cases, so the small model can often be trained on much less data than the original cumbersome model and using a much higher learning rate.\nFor tasks like MNIST in which the cumbersome model almost always produces the correct answer with very high confidence, much of the information about the learned function resides in the ratios of very small probabilities in the soft targets. For example, one version of a 2 may be given a probability of 10 −6 of being a 3 and 10 −9 of being a 7 whereas for another version it may be the other way around. This is valuable information that defines a rich similarity structure over the data (i. e. it says which 2's look like 3's and which look like 7's) but it has very little influence on the cross-entropy cost function during the transfer stage because the probabilities are so close to zero. Caruana and his collaborators circumvent this problem by using the logits (the inputs to the final softmax) rather than the probabilities produced by the softmax as the targets for learning the small model and they minimize the squared difference between the logits produced by the cumbersome model and the logits produced by the small model. Our more general solution, called \"distillation\", is to raise the temperature of the final softmax until the cumbersome model produces a suitably soft set of targets. We then use the same high temperature when training the small model to match these soft targets. We show later that matching the logits of the cumbersome model is actually a special case of distillation.\nThe transfer set that is used to train the small model could consist entirely of unlabeled data [1] or we could use the original training set. We have found that using the original training set works well, especially if we add a small term to the objective function that encourages the small model to predict the true targets as well as matching the soft targets provided by the cumbersome model. Typically, the small model cannot exactly match the soft targets and erring in the direction of the correct answer turns out to be helpful.\n\n2 Distillation\nNeural networks typically produce class probabilities by using a \"softmax\" output layer that converts the logit, z i , computed for each class into a probability, q i , by comparing z i with the other logits.q i = exp(z i /T ) j exp(z j /T )\nwhere T is a temperature that is normally set to 1. Using a higher value for T produces a softer probability distribution over classes.\nIn the simplest form of distillation, knowledge is transferred to the distilled model by training it on a transfer set and using a soft target distribution for each case in the transfer set that is produced by using the cumbersome model with a high temperature in its softmax. The same high temperature is used when training the distilled model, but after it has been trained it uses a temperature of 1.\nWhen the correct labels are known for all or some of the transfer set, this method can be significantly improved by also training the distilled model to produce the correct labels. One way to do this is to use the correct labels to modify the soft targets, but we found that a better way is to simply use a weighted average of two different objective functions. The first objective function is the cross entropy with the soft targets and this cross entropy is computed using the same high temperature in the softmax of the distilled model as was used for generating the soft targets from the cumbersome model. The second objective function is the cross entropy with the correct labels. This is computed using exactly the same logits in softmax of the distilled model but at a temperature of 1. We found that the best results were generally obtained by using a condiderably lower weight on the second objective function. Since the magnitudes of the gradients produced by the soft targets scale as 1/T 2 it is important to multiply them by T 2 when using both hard and soft targets. This ensures that the relative contributions of the hard and soft targets remain roughly unchanged if the temperature used for distillation is changed while experimenting with meta-parameters.\n\n2.1 Matching logits is a special case of distillation\nEach case in the transfer set contributes a cross-entropy gradient, dC/dz i , with respect to each logit, z i of the distilled model. If the cumbersome model has logits v i which produce soft target probabilities p i and the transfer training is done at a temperature of T , this gradient is given by:∂C ∂z i = 1 T (q i − p i ) = 1 T e zi/T j e zj/T − e vi/T j e vj /T\nIf the temperature is high compared with the magnitude of the logits, we can approximate:∂C ∂z i ≈ 1 T 1 + z i /T N + j z j /T − 1 + v i /T N + j v j /T\nIf we now assume that the logits have been zero-meaned separately for each transfer case so that j z j = j v j = 0 Eq. 3 simplifies to:∂C ∂z i ≈ 1 N T 2 (z i − v i )\nSo in the high temperature limit, distillation is equivalent to minimizing 1/2(z i − v i ) 2 , provided the logits are zero-meaned separately for each transfer case. At lower temperatures, distillation pays much less attention to matching logits that are much more negative than the average. This is potentially advantageous because these logits are almost completely unconstrained by the cost function used for training the cumbersome model so they could be very noisy. On the other hand, the very negative logits may convey useful information about the knowledge acquired by the cumbersome model. Which of these effects dominates is an empirical question. We show that when the distilled model is much too small to capture all of the knowledege in the cumbersome model, intermediate temperatures work best which strongly suggests that ignoring the large negative logits can be helpful.\n\n3 Preliminary experiments on MNIST\nTo see how well distillation works, we trained a single large neural net with two hidden layers of 1200 rectified linear hidden units on all 60,000 training cases. The net was strongly regularized using dropout and weight-constraints as described in [5]. Dropout can be viewed as a way of training an exponentially large ensemble of models that share weights. In addition, the input images were jittered by up to two pixels in any direction. This net achieved 67 test errors whereas a smaller net with two hidden layers of 800 rectified linear hidden units and no regularization achieved 146 errors. But if the smaller net was regularized solely by adding the additional task of matching the soft targets produced by the large net at a temperature of 20, it achieved 74 test errors. This shows that soft targets can transfer a great deal of knowledge to the distilled model, including the knowledge about how to generalize that is learned from translated training data even though the transfer set does not contain any translations.\nWhen the distilled net had 300 or more units in each of its two hidden layers, all temperatures above 8 gave fairly similar results. But when this was radically reduced to 30 units per layer, temperatures in the range 2.5 to 4 worked significantly better than higher or lower temperatures.\nWe\n\n4 Experiments on speech recognition\nIn this section, we investigate the effects of ensembling Deep Neural Network (DNN) acoustic models that are used in Automatic Speech Recognition (ASR). We show that the distillation strategy that we propose in this paper achieves the desired effect of distilling an ensemble of models into a single model that works significantly better than a model of the same size that is learned directly from the same training data.\nState-of-the-art ASR systems currently use DNNs to map a (short) temporal context of features derived from the waveform to a probability distribution over the discrete states of a Hidden Markov Model (HMM) [4]. More specifically, the DNN produces a probability distribution over clusters of tri-phone states at each time and a decoder then finds a path through the HMM states that is the best compromise between using high probability states and producing a transcription that is probable under the language model.\nAlthough it is possible (and desirable) to train the DNN in such a way that the decoder (and, thus, the language model) is taken into account by marginalizing over all possible paths, it is common to train the DNN to perform frame-by-frame classification by (locally) minimizing the cross entropy between the predictions made by the net and the labels given by a forced alignment with the ground truth sequence of states for each observation:θ = arg max θ ′ P (h t |s t ; θ ′ )\nwhere θ are the parameters of our acoustic model P which maps acoustic observations at time t, s t , to a probability, P (h t |s t ; θ ′ ) , of the \"correct\" HMM state h t , which is determined by a forced alignment with the correct sequence of words. The model is trained with a distributed stochastic gradient descent approach.\nWe use an architecture with 8 hidden layers each containing 2560 rectified linear units and a final softmax layer with 14,000 labels (HMM targets h t\n\n4.1 Results\nWe trained 10 separate models to predict P (h t |s t ; θ), using exactly the same architecture and training procedure as the baseline. The models are randomly initialized with different initial parameter values and we find that this creates sufficient diversity in the trained models to allow the averaged predictions of the ensemble to significantly outperform the individual models. We have explored adding diversity to the models by varying the sets of data that each model sees, but we found this to not significantly change our results, so we opted for the simpler approach. For the distillation we tried temperatures of [1, 2, 5, 10] and used a relative weight of 0.5 on the cross-entropy for the hard targets, where bold font indicates the best value that was used for table 1.\nTable 1 shows that, indeed, our distillation approach is able to extract more useful information from the training set than simply using the hard labels to train a single model. More than 80% of the improvement in frame classification accuracy achieved by using an ensemble of 10 models is transferred to the distilled model which is similar to the improvement we observed in our preliminary experiments on MNIST. The ensemble gives a smaller improvement on the ultimate objective of WER (on a 23K-word test set) due to the mismatch in the objective function, but again, the improvement in WER achieved by the ensemble is transferred to the distilled model.\nWe have recently become aware of related work on learning a small acoustic model by matching the class probabilities of an already trained larger model [8]. However, they do the distillation at a temperature of 1 using a large unlabeled dataset and their best distilled model only reduces the error rate of the small model by 28% of the gap between the error rates of the large and small models when they are both trained with hard labels.\n\n5 Training ensembles of specialists on very big datasets\nTraining an ensemble of models is a very simple way to take advantage of parallel computation and the usual objection that an ensemble requires too much computation at test time can be dealt with by using distillation. There is, however, another important objection to ensembles: If the individual models are large neural networks and the dataset is very large, the amount of computation required at training time is excessive, even though it is easy to parallelize.\nIn this section we give an example of such a dataset and we show how learning specialist models that each focus on a different confusable subset of the classes can reduce the total amount of computation required to learn an ensemble. The main problem with specialists that focus on making fine-grained distinctions is that they overfit very easily and we describe how this overfitting may be prevented by using soft targets.\n\n5.1 The JFT dataset\nJFT is an internal Google dataset that has 100 million labeled images with 15,000 labels. When we did this work, Google's baseline model for JFT was a deep convolutional neural network [7] that had been trained for about six months using asynchronous stochastic gradient descent on a large number of cores. This training used two types of parallelism [2]. First, there were many replicas of the neural net running on different sets of cores and processing different mini-batches from the training set. Each replica computes the average gradient on its current mini-batch and sends this gradient to a sharded parameter server which sends back new values for the parameters. These new values reflect all of the gradients received by the parameter server since the last time it sent parameters to the replica. Second, each replica is spread over multiple cores by putting different subsets of the neurons on each core. Ensemble training is yet a third type of parallelism that can be wrapped  Waiting for several years to train an ensemble of models was not an option, so we needed a much faster way to improve the baseline model.\n\n5.2 Specialist Models\nWhen the number of classes is very large, it makes sense for the cumbersome model to be an ensemble that contains one generalist model trained on all the data and many \"specialist\" models, each of which is trained on data that is highly enriched in examples from a very confusable subset of the classes (like different types of mushroom). The softmax of this type of specialist can be made much smaller by combining all of the classes it does not care about into a single dustbin class.\nTo reduce overfitting and share the work of learning lower level feature detectors, each specialist model is initialized with the weights of the generalist model. These weights are then slightly modified by training the specialist with half its examples coming from its special subset and half sampled at random from the remainder of the training set. After training, we can correct for the biased training set by incrementing the logit of the dustbin class by the log of the proportion by which the specialist class is oversampled.\n\n5.3 Assigning classes to specialists\nIn order to derive groupings of object categories for the specialists, we decided to focus on categories that our full network often confuses. Even though we could have computed the confusion matrix and used it as a way to find such clusters, we opted for a simpler approach that does not require the true labels to construct the clusters.\nIn particular, we apply a clustering algorithm to the covariance matrix of the predictions of our generalist model, so that a set of classes S m that are often predicted together will be used as targets for one of our specialist models, m. We applied an on-line version of the K-means algorithm to the columns of the covariance matrix, and obtained reasonable clusters (shown in Table 2). We tried several clustering algorithms which produced similar results.\n\n5.4 Performing inference with ensembles of specialists\nBefore investigating what happens when specialist models are distilled, we wanted to see how well ensembles containing specialists performed. In addition to the specialist models, we always have a generalist model so that we can deal with classes for which we have no specialists and so that we can decide which specialists to use. Given an input image x, we do top-one classification in two steps:\nStep 1: For each test case, we find the n most probable classes according to the generalist model. Call this set of classes k. In our experiments, we used n = 1.\nStep 2: We then take all the specialist models, m, whose special subset of confusable classes, S m , has a non-empty intersection with k and call this the active set of specialists A k (note that this set may be empty). We then find the full probability distribution q over all the classes that minimizes:KL(p g , q) + m∈A k KL(p m , q)\nwhere KL denotes the KL divergence, and p m p g denote the probability distribution of a specialist model or the generalist full model. The distribution p m is a distribution over all the specialist classes of m plus a single dustbin class, so when computing its KL divergence from the full q distribution we sum all of the probabilities that the full q distribution assigns to all the classes in m's dustbin. Eq. 5 does not have a general closed form solution, though when all the models produce a single probability for each class the solution is either the arithmetic or geometric mean, depending on whether we use KL(p, q) or KL(q, p)). We parameterize q = sof tmax(z) (with T = 1) and we use gradient descent to optimize the logits z w.r.t. eq. 5. Note that this optimization must be carried out for each image.\n\n5.5 Results\nStarting from the trained baseline full network, the specialists train extremely fast (a few days instead of many weeks for JFT). Also, all the specialists are trained completely independently. Table 3 shows the absolute test accuracy for the baseline system and the baseline system combined with the specialist models. With 61 specialist models, there is a 4.4% relative improvement in test accuracy overall. We also report conditional test accuracy, which is the accuracy by only considering examples belonging to the specialist classes, and restricting our predictions to that subset of classes.\nFor our JFT specialist experiments, we trained 61 specialist models, each with 300 classes (plus the dustbin class). Because the sets of classes for the specialists are not disjoint, we often had multiple specialists covering a particular image class. Table 4 shows the number of test set examples, the change in the number of examples correct at position 1 when using the specialist(s), and the relative percentage improvement in top1 accuracy for the JFT dataset broken down by the number of specialists covering the class. We are encouraged by the general trend that accuracy improvements are larger when we have more specialists covering a particular class, since training independent specialist models is very easy to parallelize.\n\n6 Soft Targets as Regularizers\nOne of our main claims about using soft targets instead of hard targets is that a lot of helpful information can be carried in soft targets that could not possibly be encoded with a single hard target. In this section we demonstrate that this is a very large effect by using far less data to fit the 85M parameters of the baseline speech model described earlier.\n\n6.1 Using soft targets to prevent specialists from overfitting\nThe specialists that we used in our experiments on the JFT dataset collapsed all of their non-specialist classes into a single dustbin class. If we allow specialists to have a full softmax over all classes, there may be a much better way to prevent them overfitting than using early stopping. A specialist is trained on data that is highly enriched in its special classes. This means that the effective size of its training set is much smaller and it has a strong tendency to overfit on its special classes. This problem cannot be solved by making the specialist a lot smaller because then we lose the very helpful transfer effects we get from modeling all of the non-specialist classes.\nOur experiment using 3% of the speech data strongly suggests that if a specialist is initialized with the weights of the generalist, we can make it retain nearly all of its knowledge about the non-special classes by training it with soft targets for the non-special classes in addition to training it with hard targets. The soft targets can be provided by the generalist. We are currently exploring this approach.\n\n7 Relationship to Mixtures of Experts\nThe use of specialists that are trained on subsets of the data has some resemblance to mixtures of experts [6] which use a gating network to compute the probability of assigning each example to each expert. At the same time as the experts are learning to deal with the examples assigned to them, the gating network is learning to choose which experts to assign each example to based on the relative discriminative performance of the experts for that example. Using the discriminative performance of the experts to determine the learned assignments is much better than simply clustering the input vectors and assigning an expert to each cluster, but it makes the training hard to parallelize: First, the weighted training set for each expert keeps changing in a way that depends on all the other experts and second, the gating network needs to compare the performance of different experts on the same example to know how to revise its assignment probabilities. These difficulties have meant that mixtures of experts are rarely used in the regime where they might be most beneficial: tasks with huge datasets that contain distinctly different subsets.\nIt is much easier to parallelize the training of multiple specialists. We first train a generalist model and then use the confusion matrix to define the subsets that the specialists are trained on. Once these subsets have been defined the specialists can be trained entirely independently. At test time we can use the predictions from the generalist model to decide which specialists are relevant and only these specialists need to be run.\n\n8 Discussion\nWe have shown that distilling works very well for transferring knowledge from an ensemble or from a large highly regularized model into a smaller, distilled model. On MNIST distillation works remarkably well even when the transfer set that is used to train the distilled model lacks any examples of one or more of the classes. For a deep acoustic model that is version of the one used by Android voice search, we have shown that nearly all of the improvement that is achieved by training an ensemble of deep neural nets can be distilled into a single neural net of the same size which is far easier to deploy.\nFor really big neural networks, it can be infeasible even to train a full ensemble, but we have shown that the performance of a single really big net that has been trained for a very long time can be significantly improved by learning a large number of specialist nets, each of which learns to discriminate between the classes in a highly confusable cluster. We have not yet shown that we can distill the knowledge in the specialists back into the single large net.\n\nFootnotes:\n\nReferences:\n\n- C. Buciluǎ, R. Caruana, and A. Niculescu-Mizil. Model compression. In Proceedings of the 12th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, KDD '06, pages 535-541, New York, NY, USA, 2006. ACM.- J. Dean, G. S. Corrado, R. Monga, K. Chen, M. Devin, Q. V. Le, M. Z. Mao, M. Ranzato, A. Senior, P. Tucker, K. Yang, and A. Y. Ng. Large scale distributed deep networks. In NIPS, 2012.\n\n- T. G. Dietterich. Ensemble methods in machine learning. In Multiple classifier systems, pages 1-15. Springer, 2000.\n\n- G. E. Hinton, L. Deng, D. Yu, G. E. Dahl, A. Mohamed, N. Jaitly, A. Senior, V. Vanhoucke, P. Nguyen, T. N Sainath, and B. Kingsbury. Deep neural networks for acoustic modeling in speech recognition: The shared views of four research groups. Signal Processing Magazine, IEEE, 29(6):82-97, 2012.\n\n- G. E. Hinton, N. Srivastava, A. Krizhevsky, I. Sutskever, and R. R. Salakhutdinov. Im- proving neural networks by preventing co-adaptation of feature detectors. arXiv preprint arXiv:1207.0580, 2012.\n\n- R. A. Jacobs, M. I. Jordan, S. J. Nowlan, and G. E. Hinton. Adaptive mixtures of local experts. Neural computation, 3(1):79-87, 1991.\n\n- A. Krizhevsky, I. Sutskever, and G. E. Hinton. Imagenet classification with deep convolutional neural networks. In Advances in Neural Information Processing Systems, pages 1097-1105, 2012.\n\n- J. Li, R. Zhao, J. Huang, and Y. Gong. Learning small-size dnn with output-distribution-based criteria. In Proceedings Interspeech 2014, pages 1910-1914, 2014.\n\n- N. Srivastava, G.E. Hinton, A. Krizhevsky, I. Sutskever, and R. R. Salakhutdinov. Dropout: A simple way to prevent neural networks from overfitting. The Journal of Machine Learning Research, 15(1):1929-1958, 2014.\n\n", "annotations": {"Abstract": [{"begin": 46, "end": 1193, "idx": 0}], "Head": [{"begin": 1196, "end": 1210, "n": "1", "idx": 0}, {"begin": 7548, "end": 7562, "n": "2", "idx": 1}, {"begin": 9620, "end": 9673, "n": "2.1", "idx": 2}, {"begin": 11251, "end": 11285, "n": "3", "idx": 3}, {"begin": 12613, "end": 12648, "n": "4", "idx": 4}, {"begin": 14545, "end": 14556, "n": "4.1", "idx": 5}, {"begin": 16441, "end": 16497, "n": "5", "idx": 6}, {"begin": 17391, "end": 17410, "n": "5.1", "idx": 7}, {"begin": 18540, "end": 18561, "n": "5.2", "idx": 8}, {"begin": 19583, "end": 19619, "n": "5.3", "idx": 9}, {"begin": 20421, "end": 20475, "n": "5.4", "idx": 10}, {"begin": 22192, "end": 22203, "n": "5.5", "idx": 11}, {"begin": 23540, "end": 23570, "n": "6", "idx": 12}, {"begin": 23935, "end": 23997, "n": "6.1", "idx": 13}, {"begin": 25101, "end": 25138, "n": "7", "idx": 14}, {"begin": 26730, "end": 26742, "n": "8", "idx": 15}], "ReferenceToBib": [{"begin": 231, "end": 234, "target": "#b2", "idx": 0}, {"begin": 2245, "end": 2248, "target": "#b8", "idx": 1}, {"begin": 2568, "end": 2571, "target": "#b0", "idx": 2}, {"begin": 7106, "end": 7109, "target": "#b0", "idx": 3}, {"begin": 11536, "end": 11539, "target": "#b4", "idx": 4}, {"begin": 13277, "end": 13280, "target": "#b3", "idx": 5}, {"begin": 16152, "end": 16155, "target": "#b7", "idx": 6}, {"begin": 17596, "end": 17599, "target": "#b6", "idx": 7}, {"begin": 17762, "end": 17765, "target": "#b1", "idx": 8}, {"begin": 25246, "end": 25249, "target": "#b5", "idx": 9}], "SectionFootnote": [{"begin": 27820, "end": 27830, "idx": 0}], "ReferenceString": [{"begin": 27847, "end": 28070, "id": "b0", "idx": 0}, {"begin": 28072, "end": 28256, "id": "b1", "idx": 1}, {"begin": 28260, "end": 28375, "id": "b2", "idx": 2}, {"begin": 28379, "end": 28672, "id": "b3", "idx": 3}, {"begin": 28676, "end": 28874, "id": "b4", "idx": 4}, {"begin": 28878, "end": 29011, "id": "b5", "idx": 5}, {"begin": 29015, "end": 29203, "id": "b6", "idx": 6}, {"begin": 29207, "end": 29366, "id": "b7", "idx": 7}, {"begin": 29370, "end": 29583, "id": "b8", "idx": 8}], "ReferenceToTable": [{"begin": 15339, "end": 15340, "target": "#tab_1", "idx": 0}, {"begin": 15348, "end": 15349, "target": "#tab_1", "idx": 1}, {"begin": 20345, "end": 20346, "target": "#tab_3", "idx": 2}, {"begin": 22404, "end": 22405, "target": "#tab_5", "idx": 3}, {"begin": 23061, "end": 23062, "target": "#tab_6", "idx": 4}], "Paragraph": [{"begin": 56, "end": 1193, "idx": 0}, {"begin": 1211, "end": 2729, "idx": 1}, {"begin": 2730, "end": 3863, "idx": 2}, {"begin": 3864, "end": 4818, "idx": 3}, {"begin": 4819, "end": 5599, "idx": 4}, {"begin": 5600, "end": 7009, "idx": 5}, {"begin": 7010, "end": 7546, "idx": 6}, {"begin": 7563, "end": 7771, "idx": 7}, {"begin": 7805, "end": 7940, "idx": 8}, {"begin": 7941, "end": 8344, "idx": 9}, {"begin": 8345, "end": 9618, "idx": 10}, {"begin": 9674, "end": 9975, "idx": 11}, {"begin": 10043, "end": 10132, "idx": 12}, {"begin": 10196, "end": 10331, "idx": 13}, {"begin": 10362, "end": 11249, "idx": 14}, {"begin": 11286, "end": 12318, "idx": 15}, {"begin": 12319, "end": 12608, "idx": 16}, {"begin": 12609, "end": 12611, "idx": 17}, {"begin": 12649, "end": 13070, "idx": 18}, {"begin": 13071, "end": 13585, "idx": 19}, {"begin": 13586, "end": 14028, "idx": 20}, {"begin": 14064, "end": 14393, "idx": 21}, {"begin": 14394, "end": 14543, "idx": 22}, {"begin": 14557, "end": 15341, "idx": 23}, {"begin": 15342, "end": 15999, "idx": 24}, {"begin": 16000, "end": 16439, "idx": 25}, {"begin": 16498, "end": 16964, "idx": 26}, {"begin": 16965, "end": 17389, "idx": 27}, {"begin": 17411, "end": 18538, "idx": 28}, {"begin": 18562, "end": 19048, "idx": 29}, {"begin": 19049, "end": 19581, "idx": 30}, {"begin": 19620, "end": 19959, "idx": 31}, {"begin": 19960, "end": 20419, "idx": 32}, {"begin": 20476, "end": 20874, "idx": 33}, {"begin": 20875, "end": 21036, "idx": 34}, {"begin": 21037, "end": 21342, "idx": 35}, {"begin": 21374, "end": 22190, "idx": 36}, {"begin": 22204, "end": 22802, "idx": 37}, {"begin": 22803, "end": 23538, "idx": 38}, {"begin": 23571, "end": 23933, "idx": 39}, {"begin": 23998, "end": 24685, "idx": 40}, {"begin": 24686, "end": 25099, "idx": 41}, {"begin": 25139, "end": 26288, "idx": 42}, {"begin": 26289, "end": 26728, "idx": 43}, {"begin": 26743, "end": 27352, "idx": 44}, {"begin": 27353, "end": 27818, "idx": 45}], "SectionHeader": [{"begin": 0, "end": 1193, "idx": 0}], "SectionReference": [{"begin": 27832, "end": 29585, "idx": 0}], "Sentence": [{"begin": 56, "end": 235, "idx": 0}, {"begin": 236, "end": 464, "idx": 1}, {"begin": 465, "end": 699, "idx": 2}, {"begin": 700, "end": 918, "idx": 3}, {"begin": 919, "end": 1100, "idx": 4}, {"begin": 1101, "end": 1193, "idx": 5}, {"begin": 1211, "end": 1440, "idx": 6}, {"begin": 1441, "end": 1812, "idx": 7}, {"begin": 1813, "end": 1937, "idx": 8}, {"begin": 1938, "end": 2089, "idx": 9}, {"begin": 2090, "end": 2249, "idx": 10}, {"begin": 2250, "end": 2475, "idx": 11}, {"begin": 2476, "end": 2572, "idx": 12}, {"begin": 2573, "end": 2729, "idx": 13}, {"begin": 2730, "end": 3017, "idx": 14}, {"begin": 3018, "end": 3175, "idx": 15}, {"begin": 3176, "end": 3561, "idx": 16}, {"begin": 3562, "end": 3675, "idx": 17}, {"begin": 3676, "end": 3863, "idx": 18}, {"begin": 3864, "end": 4004, "idx": 19}, {"begin": 4005, "end": 4149, "idx": 20}, {"begin": 4150, "end": 4326, "idx": 21}, {"begin": 4327, "end": 4488, "idx": 22}, {"begin": 4489, "end": 4818, "idx": 23}, {"begin": 4819, "end": 5028, "idx": 24}, {"begin": 5029, "end": 5118, "idx": 25}, {"begin": 5119, "end": 5292, "idx": 26}, {"begin": 5293, "end": 5599, "idx": 27}, {"begin": 5600, "end": 5841, "idx": 28}, {"begin": 5842, "end": 6005, "idx": 29}, {"begin": 6006, "end": 6093, "idx": 30}, {"begin": 6094, "end": 6295, "idx": 31}, {"begin": 6296, "end": 6638, "idx": 32}, {"begin": 6639, "end": 6805, "idx": 33}, {"begin": 6806, "end": 6902, "idx": 34}, {"begin": 6903, "end": 7009, "idx": 35}, {"begin": 7010, "end": 7152, "idx": 36}, {"begin": 7153, "end": 7406, "idx": 37}, {"begin": 7407, "end": 7546, "idx": 38}, {"begin": 7563, "end": 7771, "idx": 39}, {"begin": 7805, "end": 7940, "idx": 40}, {"begin": 7941, "end": 8217, "idx": 41}, {"begin": 8218, "end": 8344, "idx": 42}, {"begin": 8345, "end": 8525, "idx": 43}, {"begin": 8526, "end": 8706, "idx": 44}, {"begin": 8707, "end": 8954, "idx": 45}, {"begin": 8955, "end": 9030, "idx": 46}, {"begin": 9031, "end": 9138, "idx": 47}, {"begin": 9139, "end": 9264, "idx": 48}, {"begin": 9265, "end": 9425, "idx": 49}, {"begin": 9426, "end": 9618, "idx": 50}, {"begin": 9674, "end": 9807, "idx": 51}, {"begin": 9808, "end": 9975, "idx": 52}, {"begin": 10043, "end": 10132, "idx": 53}, {"begin": 10196, "end": 10331, "idx": 54}, {"begin": 10362, "end": 10527, "idx": 55}, {"begin": 10528, "end": 10653, "idx": 56}, {"begin": 10654, "end": 10832, "idx": 57}, {"begin": 10833, "end": 10960, "idx": 58}, {"begin": 10961, "end": 11019, "idx": 59}, {"begin": 11020, "end": 11249, "idx": 60}, {"begin": 11286, "end": 11449, "idx": 61}, {"begin": 11450, "end": 11540, "idx": 62}, {"begin": 11541, "end": 11645, "idx": 63}, {"begin": 11646, "end": 11727, "idx": 64}, {"begin": 11728, "end": 11885, "idx": 65}, {"begin": 11886, "end": 12068, "idx": 66}, {"begin": 12069, "end": 12318, "idx": 67}, {"begin": 12319, "end": 12451, "idx": 68}, {"begin": 12452, "end": 12608, "idx": 69}, {"begin": 12609, "end": 12611, "idx": 70}, {"begin": 12649, "end": 12801, "idx": 71}, {"begin": 12802, "end": 13070, "idx": 72}, {"begin": 13071, "end": 13281, "idx": 73}, {"begin": 13282, "end": 13585, "idx": 74}, {"begin": 13586, "end": 14028, "idx": 75}, {"begin": 14064, "end": 14315, "idx": 76}, {"begin": 14316, "end": 14393, "idx": 77}, {"begin": 14394, "end": 14543, "idx": 78}, {"begin": 14557, "end": 14691, "idx": 79}, {"begin": 14692, "end": 14941, "idx": 80}, {"begin": 14942, "end": 15136, "idx": 81}, {"begin": 15137, "end": 15341, "idx": 82}, {"begin": 15342, "end": 15519, "idx": 83}, {"begin": 15520, "end": 15755, "idx": 84}, {"begin": 15756, "end": 15999, "idx": 85}, {"begin": 16000, "end": 16156, "idx": 86}, {"begin": 16157, "end": 16439, "idx": 87}, {"begin": 16498, "end": 16716, "idx": 88}, {"begin": 16717, "end": 16964, "idx": 89}, {"begin": 16965, "end": 17198, "idx": 90}, {"begin": 17199, "end": 17389, "idx": 91}, {"begin": 17411, "end": 17500, "idx": 92}, {"begin": 17501, "end": 17717, "idx": 93}, {"begin": 17718, "end": 17766, "idx": 94}, {"begin": 17767, "end": 17912, "idx": 95}, {"begin": 17913, "end": 18083, "idx": 96}, {"begin": 18084, "end": 18217, "idx": 97}, {"begin": 18218, "end": 18326, "idx": 98}, {"begin": 18327, "end": 18538, "idx": 99}, {"begin": 18562, "end": 18900, "idx": 100}, {"begin": 18901, "end": 19048, "idx": 101}, {"begin": 19049, "end": 19211, "idx": 102}, {"begin": 19212, "end": 19400, "idx": 103}, {"begin": 19401, "end": 19581, "idx": 104}, {"begin": 19620, "end": 19762, "idx": 105}, {"begin": 19763, "end": 19959, "idx": 106}, {"begin": 19960, "end": 20199, "idx": 107}, {"begin": 20200, "end": 20348, "idx": 108}, {"begin": 20349, "end": 20419, "idx": 109}, {"begin": 20476, "end": 20617, "idx": 110}, {"begin": 20618, "end": 20807, "idx": 111}, {"begin": 20808, "end": 20874, "idx": 112}, {"begin": 20875, "end": 20973, "idx": 113}, {"begin": 20974, "end": 21001, "idx": 114}, {"begin": 21002, "end": 21036, "idx": 115}, {"begin": 21037, "end": 21256, "idx": 116}, {"begin": 21257, "end": 21342, "idx": 117}, {"begin": 21374, "end": 21509, "idx": 118}, {"begin": 21510, "end": 21783, "idx": 119}, {"begin": 21784, "end": 22014, "idx": 120}, {"begin": 22015, "end": 22119, "idx": 121}, {"begin": 22120, "end": 22190, "idx": 122}, {"begin": 22204, "end": 22333, "idx": 123}, {"begin": 22334, "end": 22397, "idx": 124}, {"begin": 22398, "end": 22523, "idx": 125}, {"begin": 22524, "end": 22613, "idx": 126}, {"begin": 22614, "end": 22802, "idx": 127}, {"begin": 22803, "end": 22919, "idx": 128}, {"begin": 22920, "end": 23054, "idx": 129}, {"begin": 23055, "end": 23328, "idx": 130}, {"begin": 23329, "end": 23538, "idx": 131}, {"begin": 23571, "end": 23772, "idx": 132}, {"begin": 23773, "end": 23933, "idx": 133}, {"begin": 23998, "end": 24139, "idx": 134}, {"begin": 24140, "end": 24290, "idx": 135}, {"begin": 24291, "end": 24370, "idx": 136}, {"begin": 24371, "end": 24505, "idx": 137}, {"begin": 24506, "end": 24685, "idx": 138}, {"begin": 24686, "end": 25005, "idx": 139}, {"begin": 25006, "end": 25057, "idx": 140}, {"begin": 25058, "end": 25099, "idx": 141}, {"begin": 25139, "end": 25345, "idx": 142}, {"begin": 25346, "end": 25597, "idx": 143}, {"begin": 25598, "end": 26098, "idx": 144}, {"begin": 26099, "end": 26288, "idx": 145}, {"begin": 26289, "end": 26359, "idx": 146}, {"begin": 26360, "end": 26486, "idx": 147}, {"begin": 26487, "end": 26578, "idx": 148}, {"begin": 26579, "end": 26728, "idx": 149}, {"begin": 26743, "end": 26906, "idx": 150}, {"begin": 26907, "end": 27069, "idx": 151}, {"begin": 27070, "end": 27352, "idx": 152}, {"begin": 27353, "end": 27711, "idx": 153}, {"begin": 27712, "end": 27818, "idx": 154}], "Div": [{"begin": 56, "end": 1193, "idx": 0}, {"begin": 1196, "end": 7546, "idx": 1}, {"begin": 7548, "end": 9618, "idx": 2}, {"begin": 9620, "end": 11249, "idx": 3}, {"begin": 11251, "end": 12611, "idx": 4}, {"begin": 12613, "end": 14543, "idx": 5}, {"begin": 14545, "end": 16439, "idx": 6}, {"begin": 16441, "end": 17389, "idx": 7}, {"begin": 17391, "end": 18538, "idx": 8}, {"begin": 18540, "end": 19581, "idx": 9}, {"begin": 19583, "end": 20419, "idx": 10}, {"begin": 20421, "end": 22190, "idx": 11}, {"begin": 22192, "end": 23538, "idx": 12}, {"begin": 23540, "end": 23933, "idx": 13}, {"begin": 23935, "end": 25099, "idx": 14}, {"begin": 25101, "end": 26728, "idx": 15}, {"begin": 26730, "end": 27818, "idx": 16}], "SectionMain": [{"begin": 1193, "end": 27818, "idx": 0}]}}