{"text": "LayoutLMv2: Multi-modal Pre-training for Visually-rich Document Understanding\n\nAbstract:\nPre-training of text and layout has proved effective in a variety of visually-rich document understanding tasks due to its effective model architecture and the advantage of large-scale unlabeled scanned/digital-born documents. We propose LayoutLMv2 architecture with new pre-training tasks to model the interaction among text, layout, and image in a single multi-modal framework. Specifically, with a two-stream multi-modal Transformer encoder, LayoutLMv2 uses not only the existing masked visual-language modeling task but also the new text-image alignment and text-image matching tasks, which make it better capture the cross-modality interaction in the pre-training stage. Meanwhile, it also integrates a spatial-aware self-attention mechanism into the Transformer architecture so that the model can fully understand the relative positional relationship among different text blocks. Experiment results show that LayoutLMv2 outperforms LayoutLM by a large margin and achieves new state-ofthe-art results on a wide variety of downstream visually-rich document understanding tasks, including FUNSD (0.7895 → 0.8420), CORD (0.9493 → 0.9601), SROIE (0.9524 → 0.9781), Kleister-NDA (0.8340 → 0.8520), RVL-CDIP (0.9443 → 0.9564), and DocVQA (0.7295 → 0.8672). We made our model and code publicly available at https://aka.ms /layoutlmv2.\n\n\n1 Introduction\nVisually-rich Document Understanding (VrDU) aims to analyze scanned/digital-born business documents (images of invoices, forms in PDF format, etc.) where structured information can be automatically extracted and organized for many business * Equal contributions during internship at MSRA applications. Distinct from conventional information extraction tasks, the VrDU task relies on not only textual information but also visual and layout information that is vital for visually-rich documents. Different types of documents indicate that the text fields of interest located at different positions within the document, which is often determined by the style and format of each type as well as the document content. Therefore, to accurately recognize the text fields of interest, it is inevitable to take advantage of the cross-modality nature of visually-rich documents, where the textual, visual, and layout information should be jointly modeled and learned end-to-end in a single framework.\nThe recent progress of VrDU lies primarily in two directions. The first direction is usually built on the shallow fusion between textual and visual/layout/style information (Yang et al., 2017; Liu et al., 2019; Sarkhel and Nandi, 2019; Yu et al., 2020; Majumder et al., 2020; Wei et al., 2020; Zhang et al., 2020). These approaches leverage the pre-trained NLP and CV models individually and combine the information from multiple modalities for supervised learning. Although good performance has been achieved, the domain knowledge of one document type cannot be easily transferred into another, so that these models often need to be re-trained once the document type is changed. Thereby the local invariance in general document layout (key-value pairs in a left-right layout, tables in a grid layout, etc.) cannot be fully exploited. To this end, the second direction relies on the deep fusion among textual, visual, and layout information from a great number of unlabeled documents in different domains, where pre-training techniques play an important role in learning the cross-modality interaction in an end-to-end fashion (Lockard et al., 2020; Xu et al., 2020). In this way, the pre-trained models absorb cross-modal knowledge from different document types, where the local invariance among these layouts and styles is preserved. Furthermore, when the model needs to be transferred into another domain with different document formats, only a few labeled samples would be sufficient to fine-tune the generic model in order to achieve state-of-the-art accuracy. Therefore, the proposed model in this paper follows the second direction, and we explore how to further improve the pre-training strategies for the VrDU tasks.\nIn this paper, we present an improved version of LayoutLM (Xu et al., 2020), aka LayoutLMv2. Different from the vanilla LayoutLM model where visual embeddings are combined in the fine-tuning stage, we integrate the visual information in the pre-training stage in LayoutLMv2 by taking advantage of the Transformer architecture to learn the cross-modality interaction between visual and textual information. In addition, inspired by the 1-D relative position representations (Shaw et al., 2018; Raffel et al., 2020; Bao et al., 2020), we propose the spatial-aware self-attention mechanism for LayoutLMv2, which involves a 2-D relative position representation for token pairs. Different from the absolute 2-D position embeddings that Lay-outLM uses to model the page layout, the relative position embeddings explicitly provide a broader view for the contextual spatial modeling. For the pre-training strategies, we use two new training objectives for LayoutLMv2 in addition to the masked visual-language modeling. The first is the proposed text-image alignment strategy, which aligns the text lines and the corresponding image regions. The second is the text-image matching strategy popular in previous vision-language pre-training models (Tan and Bansal, 2019; Lu et al., 2019; Su et al., 2020; Chen et al., 2020; Sun et al., 2019), where the model learns whether the document image and textual content are correlated.\nWe select six publicly available benchmark datasets as the downstream tasks to evaluate the performance of the pre-trained LayoutLMv2 model, which are the FUNSD dataset (Jaume et al., 2019) for form understanding, the CORD dataset (Park et al., 2019) and the SROIE dataset (Huang et al., 2019) for receipt understanding, the Kleister-NDA dataset (Graliński et al., 2020) for long document understanding with a complex layout, the RVL-CDIP dataset (Harley et al., 2015) for document image classification, and the DocVQA dataset (Mathew et al., 2021) for visual question answering on document images. Experiment results show that the LayoutLMv2 model significantly outperforms strong baselines, including the vanilla LayoutLM, and achieves new state-of-the-art results in all of these tasks.\nThe contributions of this paper are summarized as follows:\n• We propose a multi-modal Transformer model to integrate the document text, layout, and visual information in the pre-training stage, which learns the cross-modal interaction endto-end in a single framework. Meanwhile, a spatial-aware self-attention mechanism is integrated into the Transformer architecture.\n• In addition to the masked visual-language model, we add text-image alignment and textimage matching as the new pre-training strategies to enforce the alignment among different modalities.\n• LayoutLMv2 significantly outperforms and achieves new SOTA results not only on the conventional VrDU tasks but also on the VQA task for document images, which demonstrates the great potential for the multi-modal pre-training for VrDU.\n\n2 Approach\nIn this section, we will introduce the model architecture and the multi-modal pre-training tasks of LayoutLMv2, which is illustrated in Figure 1.\n\n2.1 Model Architecture\nWe build a multi-modal Transformer architecture as the backbone of LayoutLMv2, which takes text, visual, and layout information as input to establish deep cross-modal interactions. We also introduce a spatial-aware self-attention mechanism to the model architecture for better modeling the document layout. Detailed descriptions of the model are as follows.\nText Embedding Following the common practice, we use WordPiece (Wu et al., 2016) The final text embedding is the sum of three embeddings. Token embedding represents the token itself, 1D positional embedding represents the token index, and segment embedding is used to distinguish different text segments. Formally, we have the i-th (0 ≤ i < L) text embeddingt i = TokEmb(w i )+PosEmb1D(i)+SegEmb(s i )\nVisual Embedding Although all information we need is contained in the page image, the model has difficulty capturing detailed features in a single information-rich representation of the entire page. Therefore, we leverage the output feature map of a CNN-based visual encoder, which converts the page image to a fixed-length sequence. We use ResNeXt-FPN (Xie et al., 2017; Lin et al., 2017) architecture as the backbone of the visual encoder, whose parameters can be updated through backpropagation.\nGiven a document page image I, it is resized to 224 × 224 then fed into the visual backbone. After that, the output feature map is average-pooled to a fixed size with the width being W and height being H. Next, it is flattened into a visual embedding sequence of length W ×H. The sequence is named VisTokEmb(I). A linear projection layer is then applied to each visual token embedding to unify the dimensionality with the text embeddings. Since the CNN-based visual backbone cannot capture the positional information, we also add a 1D positional embedding to these visual token embeddings. The 1D positional embedding is shared with the text embedding layer. For the segment embedding, we attach all visual tokens to the visual segment [C]. The i-th (0 ≤ i < W H) visual embedding can be represented asv i = Proj VisTokEmb(I) i +PosEmb1D(i)+SegEmb([C])\nLayout Embedding The layout embedding layer is for embedding the spatial layout information represented by axis-aligned token bounding boxes from the OCR results, in which box width and height together with corner coordinates are identified. Following the vanilla LayoutLM, we normalize and discretize all coordinates to integers in the range [0, 1000], and use two embedding layers to embed x-axis features and y-axis features separately. Given the normalized bounding box of the i-th (0 ≤ i < W H + L) text/visual token box i = (x min , x max , y min , y max , width, height), the layout embedding layer concatenates six bounding box features to construct a token-level 2D positional embedding, aka the layout embeddingl i = Concat PosEmb2D x (x min , x max , width), PosEmb2D y (y min , y max , height)\nNote that CNNs perform local transformation, thus the visual token embeddings can be mapped back to image regions one by one with neither overlap nor omission. When calculating bounding boxes, the visual tokens can be treated as evenly divided grids. An empty bounding box box PAD = (0, 0, 0, 0, 0, 0) is attached to special tokens [CLS], [SEP] and [PAD].\nMulti-modal Encoder with Spatial-Aware Self-Attention Mechanism The encoder concatenates visual embeddings {v 0 , ..., v W H−1 } and text embeddings {t 0 , ..., t L−1 } to a unified sequence and fuses spatial information by adding the layout embeddings to get the i-th (0≤ i < W H + L) first layer input x (0) i = X i + l i , where X = {v 0 , ..., v W H−1 , t 0 , ..., t L−1 }\nFollowing the architecture of Transformer, we build our multi-modal encoder with a stack of multi-head self-attention layers followed by a feedforward network. However, the original selfattention mechanism can only implicitly capture the relationship between the input tokens with the absolute position hints. In order to efficiently model local invariance in the document layout, it is necessary to insert relative position information explicitly. Therefore, we introduce the spatial-aware self-attention mechanism into the self-attention layers. For simplicity, the following description is for a single head in a single self-attention layer with hidden size of d head and projection matrics W Q , W K , W V . The original self-attention mechanism captures the correlation between query x i and key x j by projecting the two vectors and calculating the attention scoreα ij = 1 √ d head x i W Q x j W K T\nConsidering the large range of positions, we model the semantic relative position and spatial relative position as bias terms to prevent adding too many parameters. Similar practice has been shown effective on text-only Transformer architectures (Raffel et al., 2020; Bao et al., 2020). Let b (1D) , b (2Dx) and b (2Dy) denote the learnable 1D and 2D relative position biases respectively. The biases are different among attention heads but shared in all encoder layers. Assuming (x i , y i ) anchors the top left corner coordinates of the i-th bounding box, we obtain the spatial-aware attention scoreα ij = α ij + b (1D) j−i + b (2Dx) x j −x i + b (2Dy) y j −y i\nFinally, the output vectors are represented as the weighted average of all the projected value vectors with respect to normalized spatial-aware attention scoresh i = j exp α ij k exp α ik x j W V\n\n2.2 Pre-training Tasks\nMasked Visual-Language Modeling Similar to the vanilla LayoutLM, we use the Masked Visual-Language Modeling (MVLM) to make the model learn better in the language side with the crossmodality clues. We randomly mask some text tokens and ask the model to recover the masked tokens. Meanwhile, the layout information remains unchanged, which means the model knows each masked token's location on the page. The output representations of masked tokens from the encoder are fed into a classifier over the whole vocabulary, driven by a cross-entropy loss. To avoid visual clue leakage, we mask image regions corresponding to masked tokens on the raw page image input before feeding it into the visual encoder.\nText-Image Alignment To help the model learn the spatial location correspondence between image and coordinates of bounding boxes, we propose the Text-Image Alignment (TIA) as a fine-grained cross-modality alignment task. In the TIA task, some tokens lines are randomly selected, and their image regions are covered on the document image. We call this operation covering to avoid confusion with the masking operation in MVLM. During pretraining, a classification layer is built above the encoder outputs. This layer predicts a label for each text token depending on whether it is covered, i.e., [Covered] or [Not Covered], and computes the binary cross-entropy loss. Considering the input image's resolution is limited, and some document elements like signs and bars in a figure may look like covered text regions, the task of finding a word-sized covered image region can be noisy. Thus, the covering operation is performed at the line-level. When MVLM and TIA are performed simultaneously, TIA losses of the tokens masked in MVLM are not taken into account. This prevents the model from learning the useless but straightforward correspondence from[MASK] to [Covered].\nText-Image Matching Furthermore, a coarsegrained cross-modality alignment task, Text-Image Matching (TIM) is applied to help the model learn the correspondence between document image and textual content. We feed the output representation at [CLS] into a classifier to predict whether the image and text are from the same document page. Regular inputs are positive samples. To construct a negative sample, an image is either replaced by a page image from another document or dropped. To prevent the model from cheating by finding task features, we perform the same masking and covering operations to images in negative samples. The TIA target labels are all set to [Covered] in negative samples. We apply the binary cross-entropy loss in the optimization process.\n\n3 Experiments\n\n\n3.1 Data\nIn order to pre-train and evaluate LayoutLMv2 models, we select datasets in a wide range from the visually-rich document understanding area. Following LayoutLM, we use IIT-CDIP Test Collection (Lewis et al., 2006) as the pre-training dataset. Six datasets are used as down-stream tasks. The FUNSD (Jaume et al., 2019), CORD (Park et al., 2019), SROIE (Huang et al., 2019) and Kleister-NDA (Graliński et al., 2020) datasets define entity extraction tasks that aim to extract the value of a set of pre-defined keys, which we formalize as a sequential labeling task. RVL-CDIP (Harley et al., 2015) is for document image classification. DocVQA (Mathew et al., 2021) For the encoder along with the text embedding layer, LayoutLMv2 uses the same architecture as UniLMv2 (Bao et al., 2020), thus it is initialized from UniLMv2. For the ResNeXt-FPN part in the visual embedding layer, the backbone of a Mask-RCNN (He et al., 2017) model trained on Pub-LayNet (Zhong et al., 2019) is leveraged. 1 The rest of the parameters in the model are randomly initialized.\nDuring pre-training, we sample pages from the IIT-CDIP dataset and select a random sliding window of the text sequence if the sample is too long. We set the maximum sequence length L = 512 and assign all text tokens to the segment [A]. The output shape of the average pooling layer is set to W = H = 7, so that it transforms the feature map into 49 visual tokens. In MVLM, 15% text tokens are masked among which 80% are replaced by a special token [MASK], 10% are replaced by a random token sampled from the whole vocabulary, and 10% remains the same. In TIA, 15% of the lines are covered. In TIM, 15% images are replaced, and 5% are dropped.\n\nFine-tuning LayoutLMv2 We use the [CLS]\noutput along with pooled visual token representations as global features in the document-level classification task RVL-CDIP. For the extractive question answering task DocVQA and the other four entity extraction tasks, we follow common practice like (Devlin et al., 2019) and build task specified head layers over the text part of LayoutLMv2 outputs.\nIn the DocVQA paper, experiment results show that the BERT model fine-tuned on the SQuAD dataset (Rajpurkar et al., 2016) outperforms the original BERT model. Inspired by this fact, we add an extra setting, which is that we first fine-tune Lay-outLMv2 on a question generation (QG) dataset followed by the DocVQA dataset. The QG dataset contains almost one million question-answer pairs generated by a generation model trained on the SQuAD dataset.\nBaselines We select three baseline models in the experiments to compare LayoutLMv2 with the text-only pre-trained models as well as the vanilla LayoutLM model. Specifically, we compare LayoutLMv2 with BERT (Devlin et al., 2019), UniLMv2 (Bao et al., 2020), and LayoutLM (Xu et al., 2020) for all the experiment settings. We use the publicly available PyTorch models for BERT (Wolf et al., 2020) and LayoutLM, and use our in-house implementation for the UniLMv2 models. For each baseline approach, experiments are conducted using both the BASE and LARGE parameter settings.\n\n3.3 Results\nEntity Extraction Tasks Table 2 shows the model accuracy on the four datasets FUNSD, CORD, SROIE, and Kleister-NDA, which we regard as sequential labeling tasks evaluated using entity-level F1 score. We report the evaluation results of Kleister-NDA on the validation set because the ground-truth labels and the submission website for the test set are not available right now. For text-only models, the UniLMv2 models outperform the BERT models by a large margin in terms of the BASE and LARGE settings. For text+layout models, the LayoutLM family, especially the LayoutLMv2 models, brings significant performance improvement over the text-only baselines. Compared to the baselines, the LayoutLMv2 models are superior to the SPADE (Hwang et al., 2020) decoder method, as well as the text+layout pre-training approach BROS (Hong et al., 2021) that is built on the SPADE decoder, which demonstrates the effectiveness of our modeling approach. Moreover, with the same modal information, our LayoutLMv2 models also outperform existing multi-modal approaches PICK (Yu et al., 2020), TRIE (Zhang et al., 2020) and the previous top-1 method on the leaderboard, 2 confirming the effectiveness of our pre-training for text, layout, and visual information. The best performance on all the four datasets is achieved by (Das et al., 2018) 91.11% Ensemble (Das et al., 2018) 92.21% InceptionResNetV2 (Szegedy et al., 2017) 92.63% LadderNet (Sarkhel and Nandi, 2019) 92.77% Single model (Dauphinee et al., 2019) 93.03% Ensemble (Dauphinee et al., 2019) 93.07%\nTable 3 : Classification accuracy on the RVL-CDIP dataset the LayoutLMv2 LARGE , which illustrates that the multi-modal pre-training in LayoutLMv2 learns better from the interactions from different modalities, thereby leading to the new SOTA on various document understanding tasks.\nRVL-CDIP Table 3 shows the classification accuracy on the RVL-CDIP dataset, including textonly pre-trained models, the LayoutLM family as well as several image-based baseline models. As shown in the table, both the text and visual information are important to the document image classification task because document images are text-intensive and represented by a variety of layouts and formats. Therefore, we observed that the LayoutLM family outperforms those text-only or image-only models as it leverages the multi-modal information within the documents. Specifically, the LayoutLMv2 LARGE model significantly improves the classification accuracy by more than 1.2% point over the previous SOTA results, which achieves an accuracy of 95.64%. This also verifies that the pre-trained LayoutLMv2 model benefits not only the information extraction tasks in document understanding but also the document image classification task through effective multi-model training.\nDocVQA Table 4 tuned on the train set. By using all data (train + dev) as the fine-tuning dataset, the LayoutLMv2 LARGE single model outperforms the previous top-1 on the leaderboard which ensembles 30 models. 3 Under the setting of fine-tuning LayoutLMv2 LARGE on a question generation dataset (QG) and the DocVQA dataset successively, the single model performance increases by more than 1.6% ANLS and achieves the new SOTA.\n\n3.4 Ablation Studies\nTo fully understand the underlying impact of different components, we conduct an ablation study to explore the effect of visual information, the pretraining tasks, spatial-aware self-attention mechanism, as well as different text-side initialization models. Table 5 shows model performance on the DocVQA validation set. Under all the settings, we pre-train the models using all IIT-CDIP data for one epoch. The hyper-parameters are the same as those used to pre-train LayoutLMv2 BASE in Section 3.2. \"LayoutLM\" denotes the vanilla LayoutLM architecture in (Xu et al., 2020), which can be regarded as a LayoutLMv2 architecture without visual module and spatial-aware self-attention mechanism. \"X101-FPN\" denotes the ResNeXt101-FPN visual backbone described in Section 3.2. We first evaluate the effect of introducing visual information. From #1 to #2a, we add the visual module without changing the pre-training strategy, where results show that LayoutLMv2 pre- trained with only MVLM can leverage visual information effectively. Then, we compare the two cross-modality alignment pre-training tasks TIA and TIM. According to the four results in #2, both tasks improve the model performance substantially, and the proposed TIA benefits the model more than the commonly used TIM. Using both tasks together is more effective than using either one alone. According to this observation, we keep all the three pre-training tasks and introduce the spatial-aware self-attention mechanism (SASAM) to the model architecture. Compare the results #2d and #3, the proposed SASAM can further improve the model accuracy. Finally, in settings #3 and #4, we change the text-side initialization checkpoint from BERT to UniLMv2, and confirm that LayoutLMv2 benefits from the better initialization.\n\n4 Related Work\nIn recent years, pre-training techniques have become popular in both NLP and CV areas, and have also been leveraged in the VrDU tasks.  Devlin et al. (2019) introduced a new language representation model called BERT, which is designed to pre-train deep bidirectional representations from the unlabeled text by jointly conditioning on both left and right context in all layers.  Bao et al. (2020) propose to pre-train a unified language model for both autoencoding and partially autoregressive language modeling tasks using a novel training procedure, referred to as a pseudo-masked language model. Our multi-modal Transformer architecture and the MVLM pre-training strategy extend Transformer and MLM used in these work to leverage visual information.  Lu et al. (2019) proposed ViLBERT for learning task-agnostic joint representations of image content and natural language by extending the popular BERT architecture to a multi-modal two-stream model.  Su et al. (2020) proposed VL-BERT that adopts the Transformer model as the backbone, and extends it to take both visual and linguistic embedded features as input. Different from these vision-language pre-training approaches, the visual part of LayoutLMv2 directly uses the feature map instead of pooled ROI features, and benefits from the new TIA pre-training task.  Xu et al. (2020) proposed LayoutLM to jointly model interactions between text and layout information across scanned document images, benefiting a great number of real-world document image understanding tasks such as information extraction from scanned documents. This work is a natural extension of the vanilla LayoutLM, which takes advantage of textual, layout, and visual information in a single multi-modal pre-training framework.\n\n5 Conclusion\nIn this paper, we present a multi-modal pre-training approach for visually-rich document understanding tasks, aka LayoutLMv2. Distinct from existing methods for VrDU, the LayoutLMv2 model not only considers the text and layout information but also integrates the image information in the pretraining stage with a single multi-modal framework. Meanwhile, the spatial-aware self-attention mechanism is integrated into the Transformer architecture to capture the relative relationship among different bounding boxes. Furthermore, new pre-training objectives are also leveraged to enforce the learning of cross-modal interaction among different modalities. Experiment results on 6 different VrDU tasks have illustrated that the pre-trained LayoutLMv2 model has substantially outperformed the SOTA baselines in the document intelligence area, which greatly benefits a number of real-world document understanding tasks.\nFor future research, we will further explore the network architecture as well as the pre-training strategies for the LayoutLM family. Meanwhile, we will also investigate the language expansion to make the multi-lingual LayoutLMv2 model available for different languages, especially the non-English areas around the world. evaluation tools. 5 Words and bounding boxes are extracted from the raw PDF file. We use heuristics to locate entity spans because the normalized standard answers may not appear in the utterance. As the labeled answers are normalized into a canonical form, we apply post-processing heuristics to convert the extracted date information into the \"YYYY-MM-DD\" format, and company names into the abbreviations such as \"LLC\" and \"Inc.\". RVL-CDIP RVL-CDIP (Harley et al., 2015) consists of 400,000 grayscale images, with 8:1:1 for the training set, validation set, and test set. A multiclass single-label classification task is defined on RVL-CDIP. The images are categorized into 16 classes, with 25,000 images per class. The evaluation metric is the overall classification accuracy. Text and layout information is extracted by Microsoft OCR.\nDocVQA As a VQA dataset on the document understanding field, DocVQA (Mathew et al., 2021) consists of 50,000 questions defined on over 12,000 pages from a variety of documents. Pages are split into the training set, validation set, and test set with a ratio of about 8:1:1. The dataset is organized as a set of triples page image, questions, answers . Thus, we use Microsoft Read API to extract text and bounding boxes from images. Heuristics are used to find given answers in the extracted text. The task is evaluated using an edit distance based metric ANLS (aka average normalized Levenshtein similarity). Given that human performance is about 98% ANLS on the test set, it is reasonable to assume that the found ground truth which reaches over 97% ANLS on training and validation sets is good enough to train a model. Results on the test set are provided by the official evaluation site.\n\nB Model Training Details\nPre-training We pre-train LayoutLMv2 models using Adam optimizer (Kingma and Ba, 2015; Loshchilov and Hutter, 2019), with the learning rate of 2 × 10 −5 , weight decay of 1 × 10 −2 ,and (β 1 , β 2 ) = (0.9, 0.999). The learning rate is linearly warmed up over the first 10% steps then linearly decayed. LayoutLMv2 BASE is trained with a batch size of 64 for 5 epochs, and LayoutLMv2 LARGE is trained with a batch size of 2048 for 20 epochs on the IIT-CDIP dataset. Fine-tuning for Sequential Labeling We formalize FUNSD, SROIE, CORD, and Kleister-NDA as the sequential labeling tasks. To fine-tune Lay-outLMv2 models on these tasks, we build a tokenlevel classification layer above the text part of the output representations to predict the BIO tags for each entity field.\n\nC Detailed Experiment Results\nTables list per-task detailed results for the four entity extraction tasks, with Table 6 for FUNSD, Table 7 for CORD, Table 8 for SROIE, and Table 9 for Kleister-NDA.\n\nFootnotes:\n1: \"MaskRCNN ResNeXt101 32x8d FPN 3X\" setting in https://github.com/hpanwar08/detectron2\n2: Unpublished results, the leaderboard is available at https://rrc.cvc.uab.es/?ch=13&com=eval\n3: Unpublished results, the leaderboard is available at https://rrc.cvc.uab.es/?ch=17&com=eval\n4: https://docs.microsoft.com/en-us/azu re/cognitive-services/computer-vision/co ncept-recognizing-text\n\nReferences:\n\n- Muhammad Zeshan Afzal, Andreas Kölsch, Sheraz Ahmed, and Marcus Liwicki. 2017. Cutting the er- ror by half: Investigation of very deep cnn and ad- vanced training strategies for document image classi- fication. 2017 14th IAPR International Conference on Document Analysis and Recognition (ICDAR), 01:883-888.- Hangbo Bao, Li Dong, Furu Wei, Wenhui Wang, Nan Yang, Xiaodong Liu, Yu Wang, Jianfeng Gao, Songhao Piao, Ming Zhou, and Hsiao-Wuen Hon. 2020. Unilmv2: Pseudo-masked language models for unified language model pre-training. In Proceed- ings of the 37th International Conference on Ma- chine Learning, ICML 2020, 13-18 July 2020, Vir- tual Event, volume 119 of Proceedings of Machine Learning Research, pages 642-652. PMLR.\n\n- Yen-Chun Chen, Linjie Li, Licheng Yu, Ahmed El Kholy, Faisal Ahmed, Zhe Gan, Yu Cheng, and Jingjing Liu. 2020. Uniter: Universal image-text representation learning. In ECCV.\n\n- Arindam Das, Saikat Roy, and Ujjwal Bhattacharya. 2018. Document image classification with intra- domain transfer learning and stacked generaliza- tion of deep convolutional neural networks. 2018 24th International Conference on Pattern Recogni- tion (ICPR), pages 3180-3185.\n\n- Tyler Dauphinee, Nikunj Patel, and Mohammad Mehdi Rashidi. 2019. Modular multimodal architecture for document classification. ArXiv, abs/1912.04376.\n\n- Jacob Devlin, Ming-Wei Chang, Kenton Lee, and Kristina Toutanova. 2019. BERT: Pre-training of deep bidirectional transformers for language under- standing. In Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 1 (Long and Short Papers), pages 4171-4186, Minneapolis, Minnesota. Associ- ation for Computational Linguistics.\n\n- Filip Graliński, Tomasz Stanisławek, Anna Wróblewska, Dawid Lipiński, Agnieszka Kaliska, Paulina Rosalska, Bartosz Topolski, and Prze- mysław Biecek. 2020. Kleister: A novel task for information extraction involving long documents with complex layout.\n\n- Adam W Harley, Alex Ufkes, and Konstantinos G Der- panis. 2015. Evaluation of deep convolutional nets for document image classification and retrieval. In International Conference on Document Analysis and Recognition (ICDAR).\n\n- Kaiming He, Georgia Gkioxari, Piotr Dollár, and Ross B. Girshick. 2017. Mask R-CNN. In IEEE In- ternational Conference on Computer Vision, ICCV 2017, Venice, Italy, October 22-29, 2017, pages 2980-2988. IEEE Computer Society.\n\n- Teakgyu Hong, DongHyun Kim, Mingi Ji, Wonseok Hwang, Daehyun Nam, and Sungrae Park. 2021. {BROS}: A pre-trained language model for under- standing texts in document.\n\n- Z. Huang, K. Chen, J. He, X. Bai, D. Karatzas, S. Lu, and C. V. Jawahar. 2019. Icdar2019 competition on scanned receipt ocr and information extraction. In 2019 International Conference on Document Analy- sis and Recognition (ICDAR), pages 1516-1520.\n\n- Wonseok Hwang, Jinyeong Yim, Seunghyun Park, So- hee Yang, and Minjoon Seo. 2020. Spatial depen- dency parsing for semi-structured document infor- mation extraction.\n\n- Guillaume Jaume, Hazim Kemal Ekenel, and Jean- Philippe Thiran. 2019. Funsd: A dataset for form understanding in noisy scanned documents. 2019 International Conference on Document Analysis and Recognition Workshops (ICDARW).\n\n- Diederik P. Kingma and Jimmy Ba. 2015. Adam: A method for stochastic optimization. In 3rd Inter- national Conference on Learning Representations, ICLR 2015, San Diego, CA, USA, May 7-9, 2015, Conference Track Proceedings.\n\n- D. Lewis, G. Agam, S. Argamon, O. Frieder, D. Gross- man, and J. Heard. 2006. Building a test collection for complex document information processing. In Proceedings of the 29th Annual International ACM SIGIR Conference on Research and Development in Information Retrieval, SIGIR '06, page 665-666, New York, NY, USA. Association for Computing Machinery.\n\n- Tsung-Yi Lin, Piotr Dollar, Ross Girshick, Kaiming He, Bharath Hariharan, and Serge Belongie. 2017. Feature networks for object detection. In Proceed- ings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR).\n\n- Xiaojing Liu, Feiyu Gao, Qiong Zhang, and Huasha Zhao. 2019. Graph convolution for multimodal in- formation extraction from visually rich documents. In Proceedings of the 2019 Conference of the North American Chapter of the Association for Computa- tional Linguistics: Human Language Technologies, Volume 2 (Industry Papers), pages 32-39, Minneapo- lis, Minnesota. Association for Computational Lin- guistics.\n\n- Colin Lockard, Prashant Shiralkar, Xin Luna Dong, and Hannaneh Hajishirzi. 2020. ZeroShotCeres: Zero-shot relation extraction from semi-structured webpages. In Proceedings of the 58th Annual Meet- ing of the Association for Computational Linguistics, pages 8105-8117, Online. Association for Computa- tional Linguistics.\n\n- Ilya Loshchilov and Frank Hutter. 2019. Decou- pled weight decay regularization. In 7th Inter- national Conference on Learning Representations, ICLR 2019, New Orleans, LA, USA, May 6-9, 2019. OpenReview.net.\n\n- Jiasen Lu, Dhruv Batra, Devi Parikh, and Stefan Lee. 2019. Vilbert: Pretraining task-agnostic visi- olinguistic representations for vision-and-language tasks. In Advances in Neural Information Process- ing Systems 32: Annual Conference on Neural Infor- mation Processing Systems 2019, NeurIPS 2019, De- cember 8-14, 2019, Vancouver, BC, Canada, pages 13-23.\n\n- Bodhisattwa Prasad Majumder, Navneet Potti, Sandeep Tata, James Bradley Wendt, Qi Zhao, and Marc Na- jork. 2020. Representation learning for informa- tion extraction from form-like documents. In Pro- ceedings of the 58th Annual Meeting of the Asso- ciation for Computational Linguistics, pages 6495- 6504, Online. Association for Computational Lin- guistics.\n\n- Minesh Mathew, Dimosthenis Karatzas, and C.V. Jawa- har. 2021. Docvqa: A dataset for vqa on docu- ment images. In Proceedings of the IEEE/CVF Win- ter Conference on Applications of Computer Vision (WACV), pages 2200-2209.\n\n- Seunghyun Park, Seung Shin, Bado Lee, Junyeop Lee, Jaeheung Surh, Minjoon Seo, and Hwalsuk Lee. 2019. Cord: A consolidated receipt dataset for post- ocr parsing.\n\n- Colin Raffel, Noam Shazeer, Adam Roberts, Katherine Lee, Sharan Narang, Michael Matena, Yanqi Zhou, Wei Li, and Peter J Liu. 2020. Exploring the lim- its of transfer learning with a unified text-to-text transformer. Journal of Machine Learning Research, 21(140):1-67.\n\n- Pranav Rajpurkar, Jian Zhang, Konstantin Lopyrev, and Percy Liang. 2016. SQuAD: 100,000+ questions for machine comprehension of text. In Proceedings of the 2016 Conference on Empirical Methods in Natu- ral Language Processing, pages 2383-2392, Austin, Texas. Association for Computational Linguistics.\n\n- Ritesh Sarkhel and Arnab Nandi. 2019. Deterministic routing between layout abstractions for multi-scale classification of visually rich documents. In Pro- ceedings of the Twenty-Eighth International Joint Conference on Artificial Intelligence, IJCAI 2019, Macao, China, August 10-16, 2019, pages 3360- 3366. ijcai.org.\n\n- Peter Shaw, Jakob Uszkoreit, and Ashish Vaswani. 2018. Self-attention with relative position represen- tations. In Proceedings of the 2018 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Tech- nologies, Volume 2 (Short Papers), pages 464-468, New Orleans, Louisiana. Association for Computa- tional Linguistics.\n\n- Weijie Su, Xizhou Zhu, Yue Cao, Bin Li, Lewei Lu, Furu Wei, and Jifeng Dai. 2020. VL-BERT: pre- training of generic visual-linguistic representations. In 8th International Conference on Learning Repre- sentations, ICLR 2020, Addis Ababa, Ethiopia, April 26-30, 2020. OpenReview.net.\n\n- Chen Sun, Austin Myers, Carl Vondrick, Kevin Mur- phy, and Cordelia Schmid. 2019. Videobert: A joint model for video and language representation learning. In 2019 IEEE/CVF International Confer- ence on Computer Vision, ICCV 2019, Seoul, Ko- rea (South), October 27 -November 2, 2019, pages 7463-7472. IEEE.\n\n- Christian Szegedy, Sergey Ioffe, Vincent Vanhoucke, and Alexander A. Alemi. 2017. Inception-v4, inception-resnet and the impact of residual connec- tions on learning. In Proceedings of the Thirty-First AAAI Conference on Artificial Intelligence, Febru- ary 4-9, 2017, San Francisco, California, USA, pages 4278-4284. AAAI Press.\n\n- Hao Tan and Mohit Bansal. 2019. LXMERT: Learning cross-modality encoder representations from trans- formers. In Proceedings of the 2019 Conference on Empirical Methods in Natural Language Processing and the 9th International Joint Conference on Natu- ral Language Processing (EMNLP-IJCNLP), pages 5100-5111, Hong Kong, China. Association for Computational Linguistics.\n\n- Mengxi Wei, Yifan He, and Qiong Zhang. 2020. Ro- bust layout-aware IE for visually rich documents with pre-trained language models. In Proceedings of the 43rd International ACM SIGIR conference on research and development in Information Retrieval, SIGIR 2020, Virtual Event, China, July 25-30, 2020, pages 2367-2376. ACM.\n\n- Thomas Wolf, Lysandre Debut, Victor Sanh, Julien Chaumond, Clement Delangue, Anthony Moi, Pier- ric Cistac, Tim Rault, Remi Louf, Morgan Funtow- icz, Joe Davison, Sam Shleifer, Patrick von Platen, Clara Ma, Yacine Jernite, Julien Plu, Canwen Xu, Teven Le Scao, Sylvain Gugger, Mariama Drame, Quentin Lhoest, and Alexander Rush. 2020. Trans- formers: State-of-the-art natural language process- ing. In Proceedings of the 2020 Conference on Em- pirical Methods in Natural Language Processing: System Demonstrations, pages 38-45, Online. Asso- ciation for Computational Linguistics.\n\n- Yonghui Wu, Mike Schuster, Zhifeng Chen, Quoc V Le, Mohammad Norouzi, Wolfgang Macherey, Maxim Krikun, Yuan Cao, Qin Gao, Klaus Macherey, et al. 2016. Google's neural machine translation system: Bridging the gap between hu- man and machine translation. arXiv preprint arXiv:1609.08144.\n\n- Saining Xie, Ross B. Girshick, Piotr Dollár, Zhuowen Tu, and Kaiming He. 2017. Aggregated residual transformations for deep neural networks. In 2017 IEEE Conference on Computer Vision and Pattern Recognition, CVPR 2017, Honolulu, HI, USA, July 21-26, 2017, pages 5987-5995. IEEE Computer So- ciety.\n\n- Yiheng Xu, Minghao Li, Lei Cui, Shaohan Huang, Furu Wei, and Ming Zhou. 2020. Layoutlm: Pre- training of text and layout for document image un- derstanding. In KDD '20: The 26th ACM SIGKDD Conference on Knowledge Discovery and Data Min- ing, Virtual Event, CA, USA, August 23-27, 2020, pages 1192-1200. ACM.\n\n- Xiao Yang, Ersin Yumer, Paul Asente, Mike Kraley, Daniel Kifer, and C. Lee Giles. 2017. Learning to extract semantic structure from documents using multimodal fully convolutional neural networks. In 2017 IEEE Conference on Computer Vision and Pat- tern Recognition, CVPR 2017, Honolulu, HI, USA, July 21-26, 2017, pages 4342-4351. IEEE Computer Society.\n\n- Wenwen Yu, Ning Lu, Xianbiao Qi, Ping Gong, and Rong Xiao. 2020. Pick: Processing key information extraction from documents using improved graph learning-convolutional networks.\n\n- Peng Zhang, Yunlu Xu, Zhanzhan Cheng, Shiliang Pu, Jing Lu, Liang Qiao, Yi Niu, and Fei Wu. 2020. Trie: End-to-end text reading and information extraction for document understanding.\n\n- Xu Zhong, Jianbin Tang, and Antonio Jimeno Yepes. 2019. Publaynet: largest dataset ever for document layout analysis. In 2019 International Conference on Document Analysis and Recognition (ICDAR), pages 1015-1022. IEEE.\n\n", "annotations": {"Abstract": [{"begin": 79, "end": 1421, "idx": 0}], "Head": [{"begin": 1424, "end": 1438, "n": "1", "idx": 0}, {"begin": 7160, "end": 7170, "n": "2", "idx": 1}, {"begin": 7318, "end": 7340, "n": "2.1", "idx": 2}, {"begin": 12760, "end": 12782, "n": "2.2", "idx": 3}, {"begin": 15418, "end": 15431, "n": "3", "idx": 4}, {"begin": 15434, "end": 15442, "n": "3.1", "idx": 5}, {"begin": 17141, "end": 17180, "idx": 6}, {"begin": 18555, "end": 18566, "n": "3.3", "idx": 7}, {"begin": 21788, "end": 21808, "n": "3.4", "idx": 8}, {"begin": 23588, "end": 23602, "n": "4", "idx": 9}, {"begin": 25358, "end": 25370, "n": "5", "idx": 10}, {"begin": 28337, "end": 28361, "idx": 11}, {"begin": 29136, "end": 29165, "idx": 12}], "ReferenceToBib": [{"begin": 2603, "end": 2622, "target": "#b36", "idx": 0}, {"begin": 2623, "end": 2640, "target": "#b16", "idx": 1}, {"begin": 2641, "end": 2665, "target": "#b25", "idx": 2}, {"begin": 2666, "end": 2682, "target": "#b37", "idx": 3}, {"begin": 2683, "end": 2705, "target": "#b20", "idx": 4}, {"begin": 2706, "end": 2723, "target": "#b27", "idx": 5}, {"begin": 2724, "end": 2743, "target": "#b38", "idx": 6}, {"begin": 3557, "end": 3579, "target": "#b17", "idx": 7}, {"begin": 3580, "end": 3596, "target": "#b35", "idx": 8}, {"begin": 4214, "end": 4231, "target": "#b35", "idx": 9}, {"begin": 4629, "end": 4648, "target": "#b26", "idx": 10}, {"begin": 4649, "end": 4669, "target": "#b23", "idx": 11}, {"begin": 4670, "end": 4687, "target": "#b1", "idx": 12}, {"begin": 5392, "end": 5414, "target": "#b30", "idx": 13}, {"begin": 5415, "end": 5431, "target": "#b19", "idx": 14}, {"begin": 5432, "end": 5448, "target": "#b27", "idx": 15}, {"begin": 5449, "end": 5467, "target": "#b2", "idx": 16}, {"begin": 5468, "end": 5485, "target": "#b28", "idx": 17}, {"begin": 5742, "end": 5762, "target": "#b12", "idx": 18}, {"begin": 5804, "end": 5823, "target": "#b22", "idx": 19}, {"begin": 5846, "end": 5866, "target": "#b10", "idx": 20}, {"begin": 5919, "end": 5943, "target": "#b6", "idx": 21}, {"begin": 6020, "end": 6041, "target": "#b7", "idx": 22}, {"begin": 6100, "end": 6121, "target": "#b21", "idx": 23}, {"begin": 7762, "end": 7779, "target": "#b33", "idx": 24}, {"begin": 8454, "end": 8472, "target": "#b34", "idx": 25}, {"begin": 8473, "end": 8490, "target": "#b15", "idx": 26}, {"begin": 12144, "end": 12165, "target": "#b23", "idx": 27}, {"begin": 12166, "end": 12183, "target": "#b1", "idx": 28}, {"begin": 14079, "end": 14088, "idx": 29}, {"begin": 15636, "end": 15656, "target": "#b14", "idx": 30}, {"begin": 15740, "end": 15760, "target": "#b12", "idx": 31}, {"begin": 15767, "end": 15786, "target": "#b22", "idx": 32}, {"begin": 15794, "end": 15814, "target": "#b10", "idx": 33}, {"begin": 15832, "end": 15856, "target": "#b6", "idx": 34}, {"begin": 16016, "end": 16037, "target": "#b7", "idx": 35}, {"begin": 16083, "end": 16104, "target": "#b21", "idx": 36}, {"begin": 16207, "end": 16225, "target": "#b1", "idx": 37}, {"begin": 16348, "end": 16365, "target": "#b8", "idx": 38}, {"begin": 16394, "end": 16414, "target": "#b39", "idx": 39}, {"begin": 17431, "end": 17452, "target": "#b5", "idx": 40}, {"begin": 17629, "end": 17653, "target": "#b24", "idx": 41}, {"begin": 18187, "end": 18208, "target": "#b5", "idx": 42}, {"begin": 18218, "end": 18236, "target": "#b1", "idx": 43}, {"begin": 18251, "end": 18268, "target": "#b35", "idx": 44}, {"begin": 18356, "end": 18375, "target": "#b32", "idx": 45}, {"begin": 19297, "end": 19317, "target": "#b11", "idx": 46}, {"begin": 19388, "end": 19407, "target": "#b9", "idx": 47}, {"begin": 19625, "end": 19642, "target": "#b37", "idx": 48}, {"begin": 19649, "end": 19669, "target": "#b38", "idx": 49}, {"begin": 19874, "end": 19892, "target": "#b3", "idx": 50}, {"begin": 19909, "end": 19927, "target": "#b3", "idx": 51}, {"begin": 19953, "end": 19975, "target": "#b29", "idx": 52}, {"begin": 19993, "end": 20018, "target": "#b25", "idx": 53}, {"begin": 20039, "end": 20063, "target": "#b4", "idx": 54}, {"begin": 20080, "end": 20104, "target": "#b4", "idx": 55}, {"begin": 22365, "end": 22382, "target": "#b35", "idx": 56}, {"begin": 23739, "end": 23759, "target": "#b5", "idx": 57}, {"begin": 23981, "end": 23998, "target": "#b1", "idx": 58}, {"begin": 24356, "end": 24372, "target": "#b19", "idx": 59}, {"begin": 24556, "end": 24572, "target": "#b27", "idx": 60}, {"begin": 24923, "end": 24939, "target": "#b35", "idx": 61}, {"begin": 27057, "end": 27078, "target": "#b7", "idx": 62}, {"begin": 27513, "end": 27534, "target": "#b21", "idx": 63}, {"begin": 28427, "end": 28448, "target": "#b13", "idx": 64}, {"begin": 28449, "end": 28477, "target": "#b18", "idx": 65}], "ReferenceToFootnote": [{"begin": 16429, "end": 16430, "target": "#foot_0", "idx": 0}, {"begin": 19720, "end": 19721, "target": "#foot_1", "idx": 1}, {"begin": 21571, "end": 21572, "target": "#foot_2", "idx": 2}], "SectionFootnote": [{"begin": 29334, "end": 29727, "idx": 0}], "ReferenceString": [{"begin": 29744, "end": 30052, "id": "b0", "idx": 0}, {"begin": 30054, "end": 30474, "id": "b1", "idx": 1}, {"begin": 30478, "end": 30651, "id": "b2", "idx": 2}, {"begin": 30655, "end": 30930, "id": "b3", "idx": 3}, {"begin": 30934, "end": 31082, "id": "b4", "idx": 4}, {"begin": 31086, "end": 31508, "id": "b5", "idx": 5}, {"begin": 31512, "end": 31763, "id": "b6", "idx": 6}, {"begin": 31767, "end": 31991, "id": "b7", "idx": 7}, {"begin": 31995, "end": 32220, "id": "b8", "idx": 8}, {"begin": 32224, "end": 32389, "id": "b9", "idx": 9}, {"begin": 32393, "end": 32642, "id": "b10", "idx": 10}, {"begin": 32646, "end": 32811, "id": "b11", "idx": 11}, {"begin": 32815, "end": 33039, "id": "b12", "idx": 12}, {"begin": 33043, "end": 33264, "id": "b13", "idx": 13}, {"begin": 33268, "end": 33621, "id": "b14", "idx": 14}, {"begin": 33625, "end": 33854, "id": "b15", "idx": 15}, {"begin": 33858, "end": 34267, "id": "b16", "idx": 16}, {"begin": 34271, "end": 34591, "id": "b17", "idx": 17}, {"begin": 34595, "end": 34802, "id": "b18", "idx": 18}, {"begin": 34806, "end": 35163, "id": "b19", "idx": 19}, {"begin": 35167, "end": 35525, "id": "b20", "idx": 20}, {"begin": 35529, "end": 35750, "id": "b21", "idx": 21}, {"begin": 35754, "end": 35915, "id": "b22", "idx": 22}, {"begin": 35919, "end": 36186, "id": "b23", "idx": 23}, {"begin": 36190, "end": 36491, "id": "b24", "idx": 24}, {"begin": 36495, "end": 36813, "id": "b25", "idx": 25}, {"begin": 36817, "end": 37186, "id": "b26", "idx": 26}, {"begin": 37190, "end": 37472, "id": "b27", "idx": 27}, {"begin": 37476, "end": 37782, "id": "b28", "idx": 28}, {"begin": 37786, "end": 38114, "id": "b29", "idx": 29}, {"begin": 38118, "end": 38486, "id": "b30", "idx": 30}, {"begin": 38490, "end": 38811, "id": "b31", "idx": 31}, {"begin": 38815, "end": 39394, "id": "b32", "idx": 32}, {"begin": 39398, "end": 39683, "id": "b33", "idx": 33}, {"begin": 39687, "end": 39985, "id": "b34", "idx": 34}, {"begin": 39989, "end": 40296, "id": "b35", "idx": 35}, {"begin": 40300, "end": 40653, "id": "b36", "idx": 36}, {"begin": 40657, "end": 40834, "id": "b37", "idx": 37}, {"begin": 40838, "end": 41020, "id": "b38", "idx": 38}, {"begin": 41024, "end": 41243, "id": "b39", "idx": 39}], "ReferenceToTable": [{"begin": 18597, "end": 18598, "target": "#tab_2", "idx": 0}, {"begin": 20118, "end": 20119, "idx": 1}, {"begin": 20410, "end": 20411, "idx": 2}, {"begin": 21374, "end": 21375, "target": "#tab_4", "idx": 3}, {"begin": 22073, "end": 22074, "target": "#tab_5", "idx": 4}, {"begin": 29253, "end": 29254, "idx": 5}, {"begin": 29290, "end": 29291, "idx": 6}, {"begin": 29313, "end": 29314, "idx": 7}], "Footnote": [{"begin": 29345, "end": 29433, "id": "foot_0", "n": "1", "idx": 0}, {"begin": 29434, "end": 29528, "id": "foot_1", "n": "2", "idx": 1}, {"begin": 29529, "end": 29623, "id": "foot_2", "n": "3", "idx": 2}, {"begin": 29624, "end": 29727, "id": "foot_3", "n": "4", "idx": 3}], "Paragraph": [{"begin": 89, "end": 1421, "idx": 0}, {"begin": 1439, "end": 2429, "idx": 1}, {"begin": 2430, "end": 4155, "idx": 2}, {"begin": 4156, "end": 5572, "idx": 3}, {"begin": 5573, "end": 6362, "idx": 4}, {"begin": 6363, "end": 6421, "idx": 5}, {"begin": 6422, "end": 6731, "idx": 6}, {"begin": 6732, "end": 6921, "idx": 7}, {"begin": 6922, "end": 7158, "idx": 8}, {"begin": 7171, "end": 7316, "idx": 9}, {"begin": 7341, "end": 7698, "idx": 10}, {"begin": 7699, "end": 8057, "idx": 11}, {"begin": 8101, "end": 8599, "idx": 12}, {"begin": 8600, "end": 9402, "idx": 13}, {"begin": 9453, "end": 10174, "idx": 14}, {"begin": 10259, "end": 10614, "idx": 15}, {"begin": 10615, "end": 10886, "idx": 16}, {"begin": 10992, "end": 11862, "idx": 17}, {"begin": 11898, "end": 12500, "idx": 18}, {"begin": 12563, "end": 12723, "idx": 19}, {"begin": 12783, "end": 13484, "idx": 20}, {"begin": 13485, "end": 14633, "idx": 21}, {"begin": 14654, "end": 15416, "idx": 22}, {"begin": 15443, "end": 16496, "idx": 23}, {"begin": 16497, "end": 17139, "idx": 24}, {"begin": 17181, "end": 17531, "idx": 25}, {"begin": 17532, "end": 17980, "idx": 26}, {"begin": 17981, "end": 18553, "idx": 27}, {"begin": 18567, "end": 20111, "idx": 28}, {"begin": 20112, "end": 20394, "idx": 29}, {"begin": 20395, "end": 21360, "idx": 30}, {"begin": 21361, "end": 21786, "idx": 31}, {"begin": 21809, "end": 23586, "idx": 32}, {"begin": 23603, "end": 25356, "idx": 33}, {"begin": 25371, "end": 26284, "idx": 34}, {"begin": 26285, "end": 27444, "idx": 35}, {"begin": 27445, "end": 28335, "idx": 36}, {"begin": 28362, "end": 29134, "idx": 37}, {"begin": 29166, "end": 29332, "idx": 38}], "SectionHeader": [{"begin": 0, "end": 1421, "idx": 0}], "SectionReference": [{"begin": 29729, "end": 41245, "idx": 0}], "Sentence": [{"begin": 89, "end": 315, "idx": 0}, {"begin": 316, "end": 468, "idx": 1}, {"begin": 469, "end": 764, "idx": 2}, {"begin": 765, "end": 974, "idx": 3}, {"begin": 975, "end": 1344, "idx": 4}, {"begin": 1345, "end": 1408, "idx": 5}, {"begin": 1409, "end": 1421, "idx": 6}, {"begin": 1439, "end": 1740, "idx": 7}, {"begin": 1741, "end": 1932, "idx": 8}, {"begin": 1933, "end": 2151, "idx": 9}, {"begin": 2152, "end": 2429, "idx": 10}, {"begin": 2430, "end": 2491, "idx": 11}, {"begin": 2492, "end": 2744, "idx": 12}, {"begin": 2745, "end": 2895, "idx": 13}, {"begin": 2896, "end": 3109, "idx": 14}, {"begin": 3110, "end": 3264, "idx": 15}, {"begin": 3265, "end": 3597, "idx": 16}, {"begin": 3598, "end": 3765, "idx": 17}, {"begin": 3766, "end": 3995, "idx": 18}, {"begin": 3996, "end": 4155, "idx": 19}, {"begin": 4156, "end": 4248, "idx": 20}, {"begin": 4249, "end": 4561, "idx": 21}, {"begin": 4562, "end": 4829, "idx": 22}, {"begin": 4830, "end": 5031, "idx": 23}, {"begin": 5032, "end": 5166, "idx": 24}, {"begin": 5167, "end": 5288, "idx": 25}, {"begin": 5289, "end": 5572, "idx": 26}, {"begin": 5573, "end": 6171, "idx": 27}, {"begin": 6172, "end": 6362, "idx": 28}, {"begin": 6363, "end": 6421, "idx": 29}, {"begin": 6422, "end": 6630, "idx": 30}, {"begin": 6631, "end": 6731, "idx": 31}, {"begin": 6732, "end": 6921, "idx": 32}, {"begin": 6922, "end": 7158, "idx": 33}, {"begin": 7171, "end": 7316, "idx": 34}, {"begin": 7341, "end": 7521, "idx": 35}, {"begin": 7522, "end": 7647, "idx": 36}, {"begin": 7648, "end": 7698, "idx": 37}, {"begin": 7699, "end": 7836, "idx": 38}, {"begin": 7837, "end": 8003, "idx": 39}, {"begin": 8004, "end": 8057, "idx": 40}, {"begin": 8101, "end": 8299, "idx": 41}, {"begin": 8300, "end": 8434, "idx": 42}, {"begin": 8435, "end": 8599, "idx": 43}, {"begin": 8600, "end": 8692, "idx": 44}, {"begin": 8693, "end": 8911, "idx": 45}, {"begin": 8912, "end": 9038, "idx": 46}, {"begin": 9039, "end": 9189, "idx": 47}, {"begin": 9190, "end": 9258, "idx": 48}, {"begin": 9259, "end": 9340, "idx": 49}, {"begin": 9341, "end": 9402, "idx": 50}, {"begin": 9453, "end": 9694, "idx": 51}, {"begin": 9695, "end": 9892, "idx": 52}, {"begin": 9893, "end": 10174, "idx": 53}, {"begin": 10259, "end": 10418, "idx": 54}, {"begin": 10419, "end": 10509, "idx": 55}, {"begin": 10510, "end": 10614, "idx": 56}, {"begin": 10615, "end": 10886, "idx": 57}, {"begin": 10992, "end": 11151, "idx": 58}, {"begin": 11152, "end": 11301, "idx": 59}, {"begin": 11302, "end": 11440, "idx": 60}, {"begin": 11441, "end": 11539, "idx": 61}, {"begin": 11540, "end": 11703, "idx": 62}, {"begin": 11704, "end": 11862, "idx": 63}, {"begin": 11898, "end": 12062, "idx": 64}, {"begin": 12063, "end": 12184, "idx": 65}, {"begin": 12185, "end": 12287, "idx": 66}, {"begin": 12288, "end": 12368, "idx": 67}, {"begin": 12369, "end": 12500, "idx": 68}, {"begin": 12563, "end": 12723, "idx": 69}, {"begin": 12783, "end": 12979, "idx": 70}, {"begin": 12980, "end": 13061, "idx": 71}, {"begin": 13062, "end": 13184, "idx": 72}, {"begin": 13185, "end": 13330, "idx": 73}, {"begin": 13331, "end": 13484, "idx": 74}, {"begin": 13485, "end": 13705, "idx": 75}, {"begin": 13706, "end": 13822, "idx": 76}, {"begin": 13823, "end": 13909, "idx": 77}, {"begin": 13910, "end": 13988, "idx": 78}, {"begin": 13989, "end": 14150, "idx": 79}, {"begin": 14151, "end": 14366, "idx": 80}, {"begin": 14367, "end": 14427, "idx": 81}, {"begin": 14428, "end": 14543, "idx": 82}, {"begin": 14544, "end": 14633, "idx": 83}, {"begin": 14654, "end": 14857, "idx": 84}, {"begin": 14858, "end": 14989, "idx": 85}, {"begin": 14990, "end": 15026, "idx": 86}, {"begin": 15027, "end": 15136, "idx": 87}, {"begin": 15137, "end": 15280, "idx": 88}, {"begin": 15281, "end": 15348, "idx": 89}, {"begin": 15349, "end": 15416, "idx": 90}, {"begin": 15443, "end": 15583, "idx": 91}, {"begin": 15584, "end": 15685, "idx": 92}, {"begin": 15686, "end": 15729, "idx": 93}, {"begin": 15730, "end": 16006, "idx": 94}, {"begin": 16007, "end": 16075, "idx": 95}, {"begin": 16076, "end": 16263, "idx": 96}, {"begin": 16264, "end": 16430, "idx": 97}, {"begin": 16431, "end": 16496, "idx": 98}, {"begin": 16497, "end": 16642, "idx": 99}, {"begin": 16643, "end": 16732, "idx": 100}, {"begin": 16733, "end": 16860, "idx": 101}, {"begin": 16861, "end": 17048, "idx": 102}, {"begin": 17049, "end": 17086, "idx": 103}, {"begin": 17087, "end": 17139, "idx": 104}, {"begin": 17181, "end": 17305, "idx": 105}, {"begin": 17306, "end": 17531, "idx": 106}, {"begin": 17532, "end": 17690, "idx": 107}, {"begin": 17691, "end": 17853, "idx": 108}, {"begin": 17854, "end": 17980, "idx": 109}, {"begin": 17981, "end": 18140, "idx": 110}, {"begin": 18141, "end": 18301, "idx": 111}, {"begin": 18302, "end": 18449, "idx": 112}, {"begin": 18450, "end": 18553, "idx": 113}, {"begin": 18567, "end": 18766, "idx": 114}, {"begin": 18767, "end": 18942, "idx": 115}, {"begin": 18943, "end": 19069, "idx": 116}, {"begin": 19070, "end": 19221, "idx": 117}, {"begin": 19222, "end": 19506, "idx": 118}, {"begin": 19507, "end": 19812, "idx": 119}, {"begin": 19813, "end": 20111, "idx": 120}, {"begin": 20112, "end": 20394, "idx": 121}, {"begin": 20395, "end": 20577, "idx": 122}, {"begin": 20578, "end": 20789, "idx": 123}, {"begin": 20790, "end": 20952, "idx": 124}, {"begin": 20953, "end": 21138, "idx": 125}, {"begin": 21139, "end": 21360, "idx": 126}, {"begin": 21361, "end": 21399, "idx": 127}, {"begin": 21400, "end": 21572, "idx": 128}, {"begin": 21573, "end": 21786, "idx": 129}, {"begin": 21809, "end": 22066, "idx": 130}, {"begin": 22067, "end": 22128, "idx": 131}, {"begin": 22129, "end": 22215, "idx": 132}, {"begin": 22216, "end": 22308, "idx": 133}, {"begin": 22309, "end": 22500, "idx": 134}, {"begin": 22501, "end": 22580, "idx": 135}, {"begin": 22581, "end": 22644, "idx": 136}, {"begin": 22645, "end": 22837, "idx": 137}, {"begin": 22838, "end": 22919, "idx": 138}, {"begin": 22920, "end": 23085, "idx": 139}, {"begin": 23086, "end": 23158, "idx": 140}, {"begin": 23159, "end": 23322, "idx": 141}, {"begin": 23323, "end": 23413, "idx": 142}, {"begin": 23414, "end": 23586, "idx": 143}, {"begin": 23603, "end": 23737, "idx": 144}, {"begin": 23738, "end": 23979, "idx": 145}, {"begin": 23980, "end": 24200, "idx": 146}, {"begin": 24201, "end": 24354, "idx": 147}, {"begin": 24355, "end": 24554, "idx": 148}, {"begin": 24555, "end": 24718, "idx": 149}, {"begin": 24719, "end": 24921, "idx": 150}, {"begin": 24922, "end": 25185, "idx": 151}, {"begin": 25186, "end": 25356, "idx": 152}, {"begin": 25371, "end": 25496, "idx": 153}, {"begin": 25497, "end": 25713, "idx": 154}, {"begin": 25714, "end": 25884, "idx": 155}, {"begin": 25885, "end": 26023, "idx": 156}, {"begin": 26024, "end": 26284, "idx": 157}, {"begin": 26285, "end": 26418, "idx": 158}, {"begin": 26419, "end": 26606, "idx": 159}, {"begin": 26607, "end": 26626, "idx": 160}, {"begin": 26627, "end": 26688, "idx": 161}, {"begin": 26689, "end": 26802, "idx": 162}, {"begin": 26803, "end": 27038, "idx": 163}, {"begin": 27039, "end": 27179, "idx": 164}, {"begin": 27180, "end": 27249, "idx": 165}, {"begin": 27250, "end": 27323, "idx": 166}, {"begin": 27324, "end": 27385, "idx": 167}, {"begin": 27386, "end": 27444, "idx": 168}, {"begin": 27445, "end": 27621, "idx": 169}, {"begin": 27622, "end": 27718, "idx": 170}, {"begin": 27719, "end": 27796, "idx": 171}, {"begin": 27797, "end": 27876, "idx": 172}, {"begin": 27877, "end": 27941, "idx": 173}, {"begin": 27942, "end": 28053, "idx": 174}, {"begin": 28054, "end": 28265, "idx": 175}, {"begin": 28266, "end": 28335, "idx": 176}, {"begin": 28362, "end": 28576, "idx": 177}, {"begin": 28577, "end": 28664, "idx": 178}, {"begin": 28665, "end": 28826, "idx": 179}, {"begin": 28827, "end": 28946, "idx": 180}, {"begin": 28947, "end": 29134, "idx": 181}, {"begin": 29166, "end": 29332, "idx": 182}], "ReferenceToFigure": [{"begin": 7314, "end": 7315, "target": "#fig_0", "idx": 0}], "Div": [{"begin": 89, "end": 1421, "idx": 0}, {"begin": 1424, "end": 7158, "idx": 1}, {"begin": 7160, "end": 7316, "idx": 2}, {"begin": 7318, "end": 12758, "idx": 3}, {"begin": 12760, "end": 15416, "idx": 4}, {"begin": 15418, "end": 15432, "idx": 5}, {"begin": 15434, "end": 17139, "idx": 6}, {"begin": 17141, "end": 18553, "idx": 7}, {"begin": 18555, "end": 21786, "idx": 8}, {"begin": 21788, "end": 23586, "idx": 9}, {"begin": 23588, "end": 25356, "idx": 10}, {"begin": 25358, "end": 28335, "idx": 11}, {"begin": 28337, "end": 29134, "idx": 12}, {"begin": 29136, "end": 29332, "idx": 13}], "SectionMain": [{"begin": 1421, "end": 29332, "idx": 0}]}}