{"text": "Generalization in NLI: Ways (Not) To Go Beyond Simple Heuristics\n\nAbstract:\nMuch of recent progress in NLU was shown to be due to models' learning dataset-specific heuristics. We conduct a case study of generalization in NLI (from MNLI to the adversarially constructed HANS dataset) in a range of BERT-based architectures (adapters, Siamese Transformers, HEX debiasing), as well as with subsampling the data and increasing the model size. We report 2 successful and 3 unsuccessful strategies, all providing insights into how Transformer-based models learn to generalize.\n1 Most models we used were provided by HuggingFace Transformers library. In scope of this project we ported the smaller BERT versions by Turc et al. (2019) for that library.\n2 https://github.com/prajjwal1/ generalize_lm_nli 3 https://github.com/vecto-ai/langmo 4 Since HANS contains only two labels (entailment, nonentailment), and a model trained on MNLI would have three (entailment, contradiction, neutral), a completely random model would be biased towards the \"non-entailment\". For direct comparison with MNLI we report the average accuracy for the two HANS labels, unless specified otherwise.\n\n\n1 Introduction\nMany popular NLP datasets contain spurious patterns, which get learned instead of the actual task (Gururangan et al., 2018; Belinkov et al., 2019; Rogers et al., 2020a; Gardner et al., 2021). This raises the issue of learning methods that would avoid that problem. We present a case study of generalization to adversarial data in Natural Language Inference (NLI), reporting both positive and negative results for a range of BERT-based approaches.\n\n2 Methodology\nData. NLI is a 3-class classification task: does the premise entails, contradicts, or is neutral with respect to the hypothesis? MNLI (Williams et al., 2018) is one of the most popular resources for this task, but it has been shown to suffer from both annotation artifacts (Gururangan et al., 2018; Poliak et al., 2018) and annotator bias (Geva et al., 2019). A cartography (Swayamdipta et al., 2020) map of MNLI (fig. 1) suggests that most of its examples are easy to learn, which explains why vanilla finetuning with modern models is sufficient to achieve high accuracy on MNLI benchmark.\nWe measure generalization of models fine-tuned on MNLI with HANS (McCoy et al., 2019b), a synthetic dataset targeting lexical overlap, subsequence and constituent heuristics. According to 2019b), a model trained on MNLI is likely to learn these heuristics and thus predict the \"entailment\" label for most HANS examples. E.g. it would incorrectly predict that \"The doctor was paid by the actor\" entails \"The doctor paid the actor\", simply because these sentences contain the same words. See Appendix A for more examples.\nMethodology. We experiment with variants 1 of BERT (Devlin et al., 2019), RoBERTa (Liu et al., 2019), and ALBERT (Lan et al., 2020). Our implementation 2 is based on Transformers (Wolf et al., 2019) and Pytorch (Paszke et al., 2019), and for two experiments we also report results with a custom Pytorch-Lightning trainer 3 . HANS has 30K examples used only for testing, where we report the accuracy 4 . MNLI test set is not public, and we report accuracy on the \"matched\" dev set (20K examples, 393K for training).\nThere are two main directions for solving the generalization challenge: modifying the training distribution and the model itself. For the former we experimented with subsampling ( §3.1), and for the latter -with bottlenecking with Siamese Transformers ( §3.2) and adapters ( §3.3), explicit debiasing ( §3.4), and increasing model size ( §3.5). This section presents the motivation and setup for all experiments, and all the results are shown in §4. §3.1 Subsampling the training data with cartography. Data cartography (Swayamdipta et al., 2020) characterizes training data points via the model's confidence in the true class, and the variability of this confidence across epochs. Figure 1 shows that MNLI examples form a spectrum: some are consistently \"easy\" (high-confidence) and \"hard\" (low-confidence) across epochs. \"Ambiguous\" samples have midrange confidence and high variability. If much of MNLI is \"easy\", presumably these samples are less informative.\nExperiments. We partition MNLI based on the training dynamics of RoBERTa-large and BERTbase, and train the respective models on varying amounts of \"hard\" and \"ambiguous\" examples (preceded by 25% of \"easy\" samples for 2 epochs). See appendix B for more details. §3.2 Siamese Networks. In this architecture predictions are based on a pair of inputs (Chopra et al., 2005; Koch et al., 2015). It was successful on NLI (Chen et al., 2017) and in conjunction with BERT encoders (Reimers and Gurevych, 2019). One of their properties is forcing the model to consider the relation between two sequences in a more holistic way than with cross-attention between concatenated premise+hypothesis (as in standard BERT fine-tuning). Intuitively, encoding premise and hypothesis separately could bottleneck 5 their interaction and encourage learning more abstract patterns, which is what we need here: ideally, an NLI model would learn logical rules rather than numerous lexical or syntactic patterns.\nExperiments. Our Siamese Transformer consists of a MLP and two BERT encoders which receive hypotheses and premises in a segregated manner. We used mean-pooled outputs of last transformer layer (CLS embedding yielded similar results) combined as [U, V, U −V, U * V ] as inputs to MLP classifier. We experiment with base and large BERTs, with both frozen and trainable encoders. §3.3 Adapter Networks. Intuitively, standard fine-tuning of BERT changes the amount of taskindependent linguistic knowledge that the model can store, and may corrupt it (if the supervised task has significant artifacts). Therefore, by adding separate task-specific components rather than changing the language model weights, we could expect to increase the amount of non-task-specific knowledge in the model. This could be done with adapters (Houlsby et al., 2019; Pfeiffer et al., 2020) : trainable MLPs inserted within each sub-layer of encoder. Concretely, in a transformer layer l, additional adapter parameters φ l are introduced to learn task specific parameters while keeping pretrained parameters intact. Having smaller trainable components should also bottleneck the model and encourage it to learn higher-level patterns.\nExperiments. We add adapters in each sub-layer as proposed in Houlsby et al. (2019) to BERT and RoBERTa with the configuration defined in Pfeiffer et al. (2020). The adapter consists of two linear layers (up and down) with a bottleneck of reduction factor of 16 and the ReLU non-linearity. §3.4 Explicit De-biasing. If MNLI 'teaches' to rely on superficial features, we could try to avoid them. Following Zhou and Bansal (2020), we use HEX projection (Wang et al., 2019). The system includes the main Transformer encoder and a 'naive' model learning superficial features. HEX orthogonally projects the Transformer representation into the affine space the most different from the 'naive' representation, hopefully removing the bias.\nExperiments. We extract pooled representations from our main model (BERT-base). The 'naive' model is a CBOW model with a self-attention layer (Vaswani et al., 2017) to capture co-occurrence information from the sequence with input and token embeddings. See Wang et al. (2019) for more details on the method, and Appendix C for implementation and hyperparameter details. During inference, we use logits from BERT only. §3.5 Increasing Model Size. Scaling language models to massive amounts of data has been a reliable source of success on NLP leaderboards, and yielded some interesting emergent properties (Brown et al., 2020; Raffel et al., 2020) training \"teaches\" transferable linguistic knowledge, the models absorbing more data could be expected to generalize better.\nExperiments. We perform standard fine-tuning on MNLI with variants of BERT: tiny, mini, small, medium by Turc et al. (2019), base and large by Devlin et al. (2019), as well as RoBERTa (Liu et al., 2019) and ALBERT (Lan et al., 2020). In this and the Siamese network experiment we report not only the results obtained with the HuggingFace Trainer, but also with our custom implementation based on Pytorch Lightning (also with the AdamW optimizer and with similar learning rates).\n\n4 Results and Discussion\n\n\n4.1 Negative Results\nTable 1 shows that Siamese networks and HEX debiasing perform at chance level on HANS. Adapters work better, but do not match vanilla fine-tuning of their base models. While it is impossible to prove the negative, our experience suggests that, given a reasonable amount of effort, these approaches are not the most promising for the generalization problem we considered. The paper is accompanied by code for our implementations.\nOur Siamese model would be expected to fail if high performance of vanilla BERT was largely due to cross-attention across [premise + hypothesis], enabling it to learn many specific patterns (such as negation in the hypothesis). Our bottleneck MLP would not have the capacity to do that, and it clearly also fails to find a more abstract pattern in the representations it receives. Further experiments are needed to verify this hypothesis. Whether or not overall we would like our NLI models to be able to operate with independent representations of premise and hypothesis rather than cross-attention within one representation, is an open question.\nFor HEX, Zhou and Bansal (2020) suggest that the problem might be that it has access only to the final output of BERT, which could contain more information about the predicted NLI labels than the input sequence as such. Then there would be little to debias. Our results support this hypothesis, but more qualitative research is needed to verify it.\nThe RoBERTa-large MNLI results of our adapter implementation is on par with the recent stateof-the-art Compacter adapters on T5 (Mahabadi et al., 2021), but generalization in both BERT and RoBERTa is overall worse than with vanilla finetuning. Following on the recent report of adapter efficacy in low-resource setting (He et al., 2021), we conducted an additional experiment with adapters and RoBERTa-large, where the model had to learn from a small, more informative subsample. At 1024 training examples adapters performed better when the MNLI subsample was diverse (selected with K-means-based clustering, see appendix D) rather than randomly selected: 80.7% vs 85%. But the generalization to HANS was still not very impressive: 67.8% vs 57.5%, respectively. This strategy does seem to select more informative examples for MNLI distribution, but not for HANS.\n\n4.2 (Cautiously) Positive Results\nFigure 2 shows that when trained on the \"hard\" samples, for RoBERTa-large there does exist a MNLI subsample (at about 25% training data) yielding good performance on both HANS and MNLI. Further 13% addition of biased MNLI data makes the model lose its performance on HANS. But we could not find such a sample for BERT-base, although the cartography samples were modelspecific. This also does not happen for either model when training on the \"ambiguous\" subsamples: RoBERTa initially \"learns\" HANS at 5% of training data, but \"loses\" it before reaching even 60% accuracy on MNLI (see fig. 4 in the Appendix).\nThe most encouraging results come from the increased model size with our custom trainer, as shown in fig. 3. For BERT, RoBERTa and AL-BERT, the \"large\" versions generalize consistently better than the \"base\" versions. Concurrent work (Anonymous, 2021) focusing specifically on the effect of model size on the learning of lexical overlap heuristic came to a similar conclusion.\nHowever, \"larger is better\" is not the whole story. The improvement occurs only past a certain threshold: going from BERT-tiny to BERT-medium does not help generalization. At the same time, both AL-BERTs have fewer parameters than BERT-small, but they do generalize, which suggests that their parameter sharing is truly effective. Also RoBERTabase learns to generalize more consistently than BERT-large, which may be either due to some inherent superiority of RoBERTa, or because this instance of RoBERTa happens to be better than this instance of BERT. One point that is clear is that better generalization also requires longer fine-tuning, which interestingly barely affects the core MNLI performance on the larger models, but makes a lot of difference for the smaller BERTs.\n\n5 Related work\nSeveral studies have reported successful generalization from MNLI to HANS. Among data-based strategies, it has been achieved via augmenting MNLI data with predicate-argument structures (Moosavi et al., 2020) and syntactic transformations (Min et al., 2020). Although there are many reports of syntactic knowledge in pre-trained BERT (Rogers et al., 2020b), Min et al. (2020) suggest that pre-training does not yield a strong inductive bias to use syntax in downstream tasks, and augmentation \"nudges\" the model towards that.\nTheoretically, subsampling that reduces the saliency of spurious patterns should have a similar effect, but our cartography-based subsampling did not work consistently, possibly because MNLI has little counter-evidence to spurious patterns, and the right subsample is hard to find reliably. We have additional negative results for subsampling with K-means clustering (see Appendix D for details).\nThe idea of using shallow models to identify biases before training and \"teach\" the model to treat them differently has been successfully explored by Utama et al. ( 2020), Clark et al. (2020), and Sanh et al. (2021). Our negative results with HEX debiasing after training complements these reports.\nOur results corroborate that generalization is improved by larger models (Anonymous, 2021) and longer fine-tuning (Tu et al., 2020). The latter work shows that this happens thanks to the few HANSlike samples in MNLI: they take longer to learn, and without them longer fine-tuning does not help.\nA general challenge for DL-based NLP research is variability due to extraneous factors. Generalization from MNLI to HANS may be much improved simply with a lucky fine-tuning initialization (Mc-Coy et al., 2019a). For QA Crane (2018) show that there are many other external factors (down to linear algebra library version) that also play a role, and for Transformers overall implementations make a big difference (Narang et al., 2021). Our work provides an illustration of that phenomenon in NLI. The reported HANS performance of vanilla fine-tuned BERT-base varies in the published studies from 50.0% to 62.5%. Our Pytorch-Lightning implementation at 4 epochs achieves 69% (avg. of 16 runs), not due to any architectural differences. Overall it also has higher variability between runs, possibly due to batch size differences.\n\n6 Analysis: Bias Under Low Confidence\nOur overall ratio of positive to negative results illustrates the difficulty of the spurious patterns problem.\nOnce the model learns that some pattern is a strong signal for a label, it will over-rely on it. But how much heuristic-matching evidence does it need?\nIn this experiment we fine-tune the base versions of BERT and RoBERTa for 4 epochs. We use the dataset cartography to identify the \"hard\" training samples for both models. As shown in Figure 1, the classifier has overall low confidence for the \"hard\" samples. We corrupt these \"hard \" samples by inserting extra characters randomly in 30% content words in the sequence. For example: The corrupted sequences remain relatively readable for humans, but this reduces the signal from direct lexical matches seen by the model (even with BERT tokenization). Note that the model has already seen these samples 4 times before corruption. We repeated this experiment with substituting, deleting and swapping characters.\nSince the classifier confidence for the \"hard\" examples is low, and the perturbations are random, they could be expected to just flip the predictions in random directions, equally across MNLI labels. Instead, with all corruption strategies and for both models we see the pattern shown in Table 2 : the accuracy drops significantly for contradiction (by 10-20 points), and improves significantly for entailment (by 10-30 points). For the neutral class the change is not as large (mostly gaining 5-13 points).\nThese results suggest that in low-confidence context even decreased lexical overlap still nudges the model towards entailment rather than contradiction. This runs contrary to the overall strategy shown by HANS, and it is not due to the majority class bias (as MNLI train set is balanced between entailment and contradiction). One possible explanation is that if it is non-entailment that the generalizing models slowly learn from the little supporting evidence in MNLI (Tu et al., 2020), then corruption would make that already-difficult job even harder for the model, decreasing the accuracy on non-entailment. On the other hand, even corrupted MNLI examples still have some lexical overlap, and so the model, unable to recognize any subtler patterns, might default to that. This finding has implications for high-cost-oferror applications where false positives are preferable to false negatives. If the data has spurious patterns, the model may score well on a generalization benchmark, but be still biased towards a certain label when its confidence is low. Consider e.g. most of COVID detection models are \"at high risk of bias\" due to noisy data (Wynants et al., 2020).\n\n7 Conclusion\nMost supervised datasets are biased in one way or the other, and task-independent techniques to improve NLP model generalization are crucial for further advances. We experimented with 5 strategies to improve generalization of BERT-class models for NLI task: explicit debiasing, bottlenecking the model, adapters, data subsampling, and increasing model size. We find the latter strategy the most promising, but we also report all the negative results, which contribute to the overall knowledge about generalization in BERT-based models. cartographyF A = f ([U, V ]; ξ), F G = f ([0, V ]; ξ)\nwhere F A , F G denotes both concatenated representations and zero matrix prepended with network B's representation [, ] denotes concatenation operation along the non-batch dimension.\nFollowing Vaswani et al. (2017), we project F A :F L = (I − F G (F T G F G + λI) −1 F T G )F A\nTable 4 shows hyperparameter search for λ. During inference, we use logits obtained through BERT only.\nWe follow a slight variation of Equation 2 to smoothen the process of optimization. The addition of λ hyper-parameter has been done to ensure that inverse is carried out on a non-singular matrix. The value of λ plays a significant role in determining how these representations are being learned. In our experiments, 1e − 4 worked well and was used for initializing it after which it was set as a model's parameter. We observe that pseudo-inverse of F T G F G is unstable and can make optimization  process hard, so we make U and V square matrices to obtain inverse instead. Additionally, during inference time, we directly feed outputs from the main network to the MLP layer to obtain logit vectors instead of using F L . It has been reported (Wang et al., 2019) that this doesn't have any profound impact on the logit vector and makes inference faster. We also applied L1 and L2 normalization on U and V to account for differences in scale but did not see any noticeable improvement. We found that values of λ greater than 0.0001 do not aid the network in learning.\n\nD Subsampling the Training Data with K-means clustering\nMotivation. Fundamentally, the problem is the mismatch between MNLI and HANS distributions. For a biased dataset, one solution could be to find such a subsample that would enable the model to perform well on both distributions.\nExperiments. We encode MNLI examples as BERT [CLS] embeddings and cluster them in 512 clusters using K-means. We then fine-tune BERTbase on varying amounts of MNLI data, progressively increasing the amount of training examples by 10%. The data in the sub-sample is selected (a) randomly (as a control), (b) so as to maximize the diversity of examples within the sample (Katharopoulos and Fleuret, 2018). At the smallest subsample size we sample the data from all clusters. As data size increases, smaller clusters are exhausted while the larger ones remain, so the smallest subsamples are the most diverse, and the diversity decreases as the sample size increases. The experiment is repeated with 5 random seeds.\nResults. Figure 6 shows that on MNLI, diverse sampling yields much more variation with small amounts of data than random sampling, but as the subsample approaches the full dataset the performance also becomes the same. Neither subsampling strategy improves generalization: the model still predicts \"entailment\" for most HANS examples. Thus overall the result for this strategy is negative.\n\nFootnotes:\n5: The information bottleneck idea (Tishby et al., 2000; Alemi et al., 2016) has recently been successfully adapted for BERT fine-tuning to avoid overfitting in a low-resource setting by Mahabadi et al. (2020), who propose a regularization term suppressing the learning of irrelevant information.\n6: https://github.com/allenai/\n\nReferences:\n\n- Alexander A. Alemi, Ian Fischer, Joshua V. Dillon, and Kevin Murphy. 2016. Deep Variational Information Bottleneck.- Anonymous. 2021. Largely, right for better rea- sons:lexical generalization improves with model size. (Under review).\n\n- Yonatan Belinkov, Adam Poliak, Stuart Shieber, Ben- jamin Van Durme, and Alexander Rush. 2019. Don't take the premise for granted: Mitigating ar- tifacts in natural language inference. In Proceed- ings of the 57th Annual Meeting of the Association for Computational Linguistics, pages 877-891, Flo- rence, Italy. Association for Computational Linguis- tics.\n\n- Tom Brown, Benjamin Mann, Nick Ryder, Melanie Subbiah, Jared D Kaplan, Prafulla Dhariwal, Arvind Neelakantan, Pranav Shyam, Girish Sastry, Amanda Askell, Sandhini Agarwal, Ariel Herbert- Voss, Gretchen Krueger, Tom Henighan, Rewon Child, Aditya Ramesh, Daniel Ziegler, Jeffrey Wu, Clemens Winter, Chris Hesse, Mark Chen, Eric Sigler, Mateusz Litwin, Scott Gray, Benjamin Chess, Jack Clark, Christopher Berner, Sam McCandlish, Alec Radford, Ilya Sutskever, and Dario Amodei. 2020. Language Models are Few-Shot Learners. 33:1877-1901.\n\n- Qian Chen, Xiaodan Zhu, Zhen-Hua Ling, Si Wei, Hui Jiang, and Diana Inkpen. 2017. Enhanced LSTM for natural language inference. In Proceedings of the 55th Annual Meeting of the Association for Com- putational Linguistics (Volume 1: Long Papers), pages 1657-1668, Vancouver, Canada. Association for Computational Linguistics.\n\n- Sumit Chopra, Raia Hadsell, and Yann LeCun. 2005. Learning a similarity metric discriminatively, with application to face verification. In Proceed- ings of the 2005 IEEE Computer Society Confer- ence on Computer Vision and Pattern Recognition (CVPR'05) -Volume 1 -Volume 01, CVPR '05, page 539-546, USA. IEEE Computer Society.\n\n- Christopher Clark, Mark Yatskar, and Luke Zettle- moyer. 2020. Learning to Model and Ignore Dataset Bias with Mixed Capacity Ensembles. In Findings of the Association for Computational Linguistics: EMNLP 2020, pages 3031-3045, Online. Associa- tion for Computational Linguistics.\n\n- Matt Crane. 2018. Questionable Answers in Question Answering Research: Reproducibility and Variabil- ity of Published Results. Transactions of the Associ- ation for Computational Linguistics, 6:241-252.\n\n- Jacob Devlin, Ming-Wei Chang, Kenton Lee, and Kristina Toutanova. 2019. BERT: Pre-training of deep bidirectional transformers for language under- standing. In Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 1 (Long and Short Papers), pages 4171-4186, Minneapolis, Minnesota. Associ- ation for Computational Linguistics.\n\n- Matt Gardner, William Merrill, Jesse Dodge, Matthew E. Peters, Alexis Ross, Sameer Singh, and Noah Smith. 2021. Competency Problems: On Finding and Removing Artifacts in Language Data. arXiv:2104.08646 [cs].\n\n- Mor Geva, Yoav Goldberg, and Jonathan Berant. 2019. Are We Modeling the Task or the Annotator? An In- vestigation of Annotator Bias in Natural Language Understanding Datasets. In Proceedings of the 2019 Conference on Empirical Methods in Natu- ral Language Processing and the 9th International Joint Conference on Natural Language Processing (EMNLP-IJCNLP), pages 1161-1166, Hong Kong, China. Association for Computational Linguistics.\n\n- Suchin Gururangan, Swabha Swayamdipta, Omer Levy, Roy Schwartz, Samuel Bowman, and Noah A. Smith. 2018. Annotation artifacts in natural lan- guage inference data. In Proceedings of the 2018 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 2 (Short Papers), pages 107-112, New Orleans, Louisiana. Associa- tion for Computational Linguistics.\n\n- Ruidan He, Linlin Liu, Hai Ye, Qingyu Tan, Bosheng Ding, Liying Cheng, Jiawei Low, Lidong Bing, and Luo Si. 2021. On the Effectiveness of Adapter- based Tuning for Pretrained Language Model Adap- tation. In Proceedings of the 59th Annual Meet- ing of the Association for Computational Linguistics and the 11th International Joint Conference on Nat- ural Language Processing (Volume 1: Long Papers), pages 2208-2222, Online. Association for Computa- tional Linguistics.\n\n- Neil Houlsby, Andrei Giurgiu, Stanislaw Jastrzebski, Bruna Morrone, Quentin De Laroussilhe, Andrea Gesmundo, Mona Attariyan, and Sylvain Gelly. 2019. Parameter-efficient transfer learning for NLP. In Proceedings of the 36th International Conference on Machine Learning, volume 97 of Proceedings of Machine Learning Research, pages 2790-2799, Long Beach, California, USA. PMLR.\n\n- Angelos Katharopoulos and François Fleuret. 2018. Not all samples are created equal: Deep learning with importance sampling. In Proceedings of the 35th International Conference on Machine Learning, ICML 2018, Stockholmsmässan, Stockholm, Sweden, July 10-15, 2018, volume 80 of Proceedings of Ma- chine Learning Research, pages 2530-2539. PMLR.\n\n- Gregory Koch, Richard Zemel, and Ruslan Salakhutdi- nov. 2015. Siamese neural networks for one-shot im- age recognition. In ICML deep learning workshop, volume 2. Lille.\n\n- Zhenzhong Lan, Mingda Chen, Sebastian Goodman, Kevin Gimpel, Piyush Sharma, and Radu Soricut. 2020. Albert: A lite bert for self-supervised learning of language representations. In International Con- ference on Learning Representations.\n\n- Yinhan Liu, Myle Ott, Naman Goyal, Jingfei Du, Man- dar Joshi, Danqi Chen, Omer Levy, Mike Lewis, Luke Zettlemoyer, and Veselin Stoyanov. 2019. Roberta: A robustly optimized BERT pretraining ap- proach. CoRR, abs/1907.11692.\n\n- Rabeeh Karimi Mahabadi, Yonatan Belinkov, and James Henderson. 2020. Variational Information Bottleneck for Effective Low-Resource Fine-Tuning. In International Conference on Learning Represen- tations.\n\n- Rabeeh Karimi Mahabadi, James Henderson, and Se- bastian Ruder. 2021. Compacter: Efficient low-rank hypercomplex adapter layers.\n\n- R. Thomas McCoy, Junghyun Min, and Tal Linzen. 2019a. BERTs of a feather do not general- ize together: Large variability in generalization across models with similar test set performance. arXiv:1911.02969 [cs].\n\n- Tom McCoy, Ellie Pavlick, and Tal Linzen. 2019b. Right for the wrong reasons: Diagnosing syntactic heuristics in natural language inference. In Proceed- ings of the 57th Annual Meeting of the Association for Computational Linguistics, pages 3428-3448, Florence, Italy. Association for Computational Lin- guistics.\n\n- Junghyun Min, R. Thomas McCoy, Dipanjan Das, Emily Pitler, and Tal Linzen. 2020. Syntactic data augmentation increases robustness to inference heuristics. In Proceedings of the 58th Annual Meet- ing of the Association for Computational Linguistics, pages 2339-2352, Online. Association for Computa- tional Linguistics.\n\n- Nafise Sadat Moosavi, Marcel de Boer, Prasetya Ajie Utama, and Iryna Gurevych. 2020. Improving Ro- bustness by Augmenting Training Sentences with Predicate-Argument Structures. arXiv:2010.12510 [cs].\n\n- Sharan Narang, Hyung Won Chung, Yi Tay, William Fedus, Thibault Fevry, Michael Matena, Karishma Malkan, Noah Fiedel, Noam Shazeer, Zhenzhong Lan, Yanqi Zhou, Wei Li, Nan Ding, Jake Marcus, Adam Roberts, and Colin Raffel. 2021. Do Trans- former Modifications Transfer Across Implementa- tions and Applications? arXiv:2102.11972 [cs].\n\n- Adam Paszke, Sam Gross, Francisco Massa, Adam Lerer, James Bradbury, Gregory Chanan, Trevor Killeen, Zeming Lin, Natalia Gimelshein, Luca Antiga, Alban Desmaison, Andreas Kopf, Edward Yang, Zachary DeVito, Martin Raison, Alykhan Te- jani, Sasank Chilamkurthy, Benoit Steiner, Lu Fang, Junjie Bai, and Soumith Chintala. 2019. Py- torch: An imperative style, high-performance deep learning library. In H. Wallach, H. Larochelle, A. Beygelzimer, F. d'Alché Buc, E. Fox, and R. Gar- nett, editors, Advances in Neural Information Pro- cessing Systems 32, pages 8024-8035. Curran Asso- ciates, Inc.\n\n- Jonas Pfeiffer, Aishwarya Kamath, Andreas Rücklé, Kyunghyun Cho, and Iryna Gurevych. 2020. Adapterfusion: Non-destructive task composition for transfer learning.\n\n- Adam Poliak, Jason Naradowsky, Aparajita Haldar, Rachel Rudinger, and Benjamin Van Durme. 2018. Hypothesis only baselines in natural language in- ference. In Proceedings of the Seventh Joint Con- ference on Lexical and Computational Semantics, pages 180-191, New Orleans, Louisiana. Associa- tion for Computational Linguistics.\n\n- Colin Raffel, Noam Shazeer, Adam Roberts, Kather- ine Lee, Sharan Narang, Michael Matena, Yanqi Zhou, Wei Li, and Peter J. Liu. 2020. Exploring the limits of transfer learning with a unified text-to- text transformer. Journal of Machine Learning Re- search, 21(140):1-67.\n\n- Nils Reimers and Iryna Gurevych. 2019. Sentence- BERT: Sentence embeddings using Siamese BERT- networks. In Proceedings of the 2019 Conference on Empirical Methods in Natural Language Processing and the 9th International Joint Conference on Natu- ral Language Processing (EMNLP-IJCNLP), pages 3982-3992, Hong Kong, China. Association for Computational Linguistics.\n\n- Anna Rogers, Olga Kovaleva, Matthew Downey, and Anna Rumshisky. 2020a. Getting Closer to AI Com- plete Question Answering: A Set of Prerequisite Real Tasks. In Proceedings of the AAAI Conference on Artificial Intelligence, pages 8722-8731.\n\n- Anna Rogers, Olga Kovaleva, and Anna Rumshisky. 2020b. A Primer in BERTology: What We Know About How BERT Works. Transactions of the Asso- ciation for Computational Linguistics, 8:842-866.\n\n- Victor Sanh, Thomas Wolf, Yonatan Belinkov, and Alexander M. Rush. 2021. Learning from others' mistakes: Avoiding dataset biases without modeling them. In International Conference on Learning Rep- resentations.\n\n- Swabha Swayamdipta, Roy Schwartz, Nicholas Lourie, Yizhong Wang, Hannaneh Hajishirzi, Noah A. Smith, and Yejin Choi. 2020. Dataset cartography: Mapping and diagnosing datasets with training dy- namics. In Proceedings of the 2020 Conference on Empirical Methods in Natural Language Process- ing (EMNLP), pages 9275-9293, Online. Associa- tion for Computational Linguistics.\n\n- Naftali Tishby, Fernando C. Pereira, and William Bialek. 2000. The information bottleneck method. arXiv:physics/0004057.\n\n- Lifu Tu, Garima Lalwani, Spandana Gella, and He He. 2020. An Empirical Study on Robustness to Spuri- ous Correlations using Pre-trained Language Mod- els. Transactions of the Association for Computa- tional Linguistics, 8:621-633.\n\n- Iulia Turc, Ming-Wei Chang, Kenton Lee, and Kristina Toutanova. 2019. Well-read students learn better: On the importance of pre-training compact models.\n\n- Prasetya Ajie Utama, Nafise Sadat Moosavi, and Iryna Gurevych. 2020. Towards debiasing NLU models from unknown biases. In Proceedings of the 2020 Conference on Empirical Methods in Natural Lan- guage Processing (EMNLP), pages 7597-7610, On- line. Association for Computational Linguistics.\n\n- Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N Gomez, Ł ukasz Kaiser, and Illia Polosukhin. 2017. Attention is all you need. In I. Guyon, U. V. Luxburg, S. Bengio, H. Wallach, R. Fergus, S. Vishwanathan, and R. Gar- nett, editors, Advances in Neural Information Pro- cessing Systems 30, pages 5998-6008. Curran Asso- ciates, Inc.\n\n- Haohan Wang, Zexue He, Zachary L. Lipton, and Eric P. Xing. 2019. Learning robust representations by projecting superficial statistics out. In Interna- tional Conference on Learning Representations.\n\n- Adina Williams, Nikita Nangia, and Samuel Bowman. 2018. A broad-coverage challenge corpus for sen- tence understanding through inference. In Proceed- ings of the 2018 Conference of the North American Chapter of the Association for Computational Lin- guistics: Human Language Technologies, Volume 1 (Long Papers), pages 1112-1122. Association for Computational Linguistics.\n\n- Thomas Wolf, Lysandre Debut, Victor Sanh, Julien Chaumond, Clement Delangue, Anthony Moi, Pier- ric Cistac, Tim Rault, R'emi Louf, Morgan Funtow- icz, and Jamie Brew. 2019. Huggingface's trans- formers: State-of-the-art natural language process- ing. ArXiv, abs/1910.03771.\n\n- Laure Wynants, Ben Van Calster, Gary S. Collins, Richard D. Riley, Georg Heinze, Ewoud Schuit, Marc M. J. Bonten, Darren L. Dahly, Johanna A. Damen, Thomas P. A. Debray, Valentijn M. T. de Jong, Maarten De Vos, Paula Dhiman, Maria C. Haller, Michael O. Harhay, Liesbet Henckaerts, Pauline Heus, Michael Kammer, Nina Kreuzberger, Anna Lohmann, Kim Luijken, Jie Ma, Glen P. Martin, David J. McLernon, Constanza L. Andaur Navarro, Johannes B. Reitsma, Jamie C. Sergeant, Chunhu Shi, Nicole Skoetz, Luc J. M. Smits, Kym I. E. Snell, Matthew Sperrin, René Spijker, Ewout W. Steyerberg, Toshihiko Takada, Ioanna Tzoulaki, Sander M. J. van Kuijk, Bas C. T. van Bus- sel, Iwan C. C. van der Horst, Florien S. van Royen, Jan Y. Verbakel, Christine Wallisch, Jack Wilkinson, Robert Wolff, Lotty Hooft, Karel G. M. Moons, and Maarten van Smeden. 2020. Prediction models for diagnosis and prognosis of covid-19: Systematic re- view and critical appraisal. 369:m1328.\n\n- Xiang Zhou and Mohit Bansal. 2020. Towards robusti- fying NLI models against lexical dataset biases. In Proceedings of the 58th Annual Meeting of the Asso- ciation for Computational Linguistics, pages 8759- 8771, Online. Association for Computational Lin- guistics.\n\n", "annotations": {"Abstract": [{"begin": 66, "end": 1169, "idx": 0}], "Head": [{"begin": 1172, "end": 1186, "n": "1", "idx": 0}, {"begin": 1635, "end": 1648, "n": "2", "idx": 1}, {"begin": 8418, "end": 8442, "n": "4", "idx": 2}, {"begin": 8445, "end": 8465, "n": "4.1", "idx": 3}, {"begin": 10756, "end": 10789, "n": "4.2", "idx": 4}, {"begin": 12554, "end": 12568, "n": "5", "idx": 5}, {"begin": 14913, "end": 14950, "n": "6", "idx": 6}, {"begin": 17608, "end": 17620, "n": "7", "idx": 7}, {"begin": 19661, "end": 19716, "idx": 8}], "ReferenceToBib": [{"begin": 708, "end": 726, "target": "#b36", "idx": 0}, {"begin": 1285, "end": 1310, "target": "#b11", "idx": 1}, {"begin": 1311, "end": 1333, "target": "#b2", "idx": 2}, {"begin": 1334, "end": 1355, "target": "#b30", "idx": 3}, {"begin": 1356, "end": 1377, "target": "#b9", "idx": 4}, {"begin": 1783, "end": 1806, "target": "#b40", "idx": 5}, {"begin": 1922, "end": 1947, "target": "#b11", "idx": 6}, {"begin": 1948, "end": 1968, "target": "#b27", "idx": 7}, {"begin": 1988, "end": 2007, "target": "#b10", "idx": 8}, {"begin": 2023, "end": 2049, "target": "#b33", "idx": 9}, {"begin": 2305, "end": 2326, "target": "#b21", "idx": 10}, {"begin": 2811, "end": 2832, "target": "#b8", "idx": 11}, {"begin": 2842, "end": 2860, "target": "#b17", "idx": 12}, {"begin": 2873, "end": 2891, "target": "#b16", "idx": 13}, {"begin": 2939, "end": 2958, "target": "#b41", "idx": 14}, {"begin": 2971, "end": 2992, "target": "#b25", "idx": 15}, {"begin": 3795, "end": 3821, "target": "#b33", "idx": 16}, {"begin": 4587, "end": 4608, "target": "#b5", "idx": 17}, {"begin": 4609, "end": 4627, "target": "#b15", "idx": 18}, {"begin": 4654, "end": 4673, "target": "#b4", "idx": 19}, {"begin": 4712, "end": 4740, "target": "#b29", "idx": 20}, {"begin": 6045, "end": 6067, "target": "#b13", "idx": 21}, {"begin": 6068, "end": 6090, "target": "#b26", "idx": 22}, {"begin": 6496, "end": 6517, "target": "#b13", "idx": 23}, {"begin": 6572, "end": 6594, "target": "#b26", "idx": 24}, {"begin": 6839, "end": 6861, "target": "#b43", "idx": 25}, {"begin": 6885, "end": 6904, "target": "#b39", "idx": 26}, {"begin": 7308, "end": 7330, "target": "#b38", "idx": 27}, {"begin": 7423, "end": 7441, "target": "#b39", "idx": 28}, {"begin": 7771, "end": 7791, "target": "#b3", "idx": 29}, {"begin": 7792, "end": 7812, "target": "#b28", "idx": 30}, {"begin": 8043, "end": 8061, "target": "#b36", "idx": 31}, {"begin": 8081, "end": 8101, "target": "#b8", "idx": 32}, {"begin": 8122, "end": 8140, "target": "#b17", "idx": 33}, {"begin": 8152, "end": 8170, "target": "#b16", "idx": 34}, {"begin": 9552, "end": 9574, "target": "#b43", "idx": 35}, {"begin": 10020, "end": 10043, "target": "#b19", "idx": 36}, {"begin": 10211, "end": 10228, "target": "#b12", "idx": 37}, {"begin": 12754, "end": 12776, "target": "#b23", "idx": 38}, {"begin": 12807, "end": 12825, "target": "#b22", "idx": 39}, {"begin": 12902, "end": 12924, "target": "#b31", "idx": 40}, {"begin": 12926, "end": 12943, "target": "#b22", "idx": 41}, {"begin": 13663, "end": 13687, "target": "#b6", "idx": 42}, {"begin": 13688, "end": 13706, "target": "#b32", "idx": 43}, {"begin": 13904, "end": 13921, "target": "#b35", "idx": 44}, {"begin": 14274, "end": 14296, "idx": 45}, {"begin": 14305, "end": 14317, "target": "#b7", "idx": 46}, {"begin": 14497, "end": 14518, "target": "#b24", "idx": 47}, {"begin": 16901, "end": 16918, "target": "#b35", "idx": 48}, {"begin": 17583, "end": 17605, "target": "#b42", "idx": 49}, {"begin": 18405, "end": 18426, "target": "#b38", "idx": 50}, {"begin": 19336, "end": 19355, "target": "#b39", "idx": 51}, {"begin": 20314, "end": 20347, "target": "#b14", "idx": 52}, {"begin": 21095, "end": 21116, "target": "#b34", "idx": 53}, {"begin": 21117, "end": 21136, "target": "#b0", "idx": 54}, {"begin": 21247, "end": 21269, "target": "#b18", "idx": 55}], "ReferenceToFootnote": [{"begin": 5031, "end": 5032, "target": "#foot_0", "idx": 0}], "SectionFootnote": [{"begin": 21049, "end": 21387, "idx": 0}], "ReferenceString": [{"begin": 21404, "end": 21519, "id": "b0", "idx": 0}, {"begin": 21521, "end": 21638, "id": "b1", "idx": 1}, {"begin": 21642, "end": 21999, "id": "b2", "idx": 2}, {"begin": 22003, "end": 22535, "id": "b3", "idx": 3}, {"begin": 22539, "end": 22863, "id": "b4", "idx": 4}, {"begin": 22867, "end": 23193, "id": "b5", "idx": 5}, {"begin": 23197, "end": 23476, "id": "b6", "idx": 6}, {"begin": 23480, "end": 23682, "id": "b7", "idx": 7}, {"begin": 23686, "end": 24108, "id": "b8", "idx": 8}, {"begin": 24112, "end": 24319, "id": "b9", "idx": 9}, {"begin": 24323, "end": 24758, "id": "b10", "idx": 10}, {"begin": 24762, "end": 25180, "id": "b11", "idx": 11}, {"begin": 25184, "end": 25652, "id": "b12", "idx": 12}, {"begin": 25656, "end": 26032, "id": "b13", "idx": 13}, {"begin": 26036, "end": 26379, "id": "b14", "idx": 14}, {"begin": 26383, "end": 26552, "id": "b15", "idx": 15}, {"begin": 26556, "end": 26792, "id": "b16", "idx": 16}, {"begin": 26796, "end": 27020, "id": "b17", "idx": 17}, {"begin": 27024, "end": 27226, "id": "b18", "idx": 18}, {"begin": 27230, "end": 27358, "id": "b19", "idx": 19}, {"begin": 27362, "end": 27572, "id": "b20", "idx": 20}, {"begin": 27576, "end": 27889, "id": "b21", "idx": 21}, {"begin": 27893, "end": 28211, "id": "b22", "idx": 22}, {"begin": 28215, "end": 28414, "id": "b23", "idx": 23}, {"begin": 28418, "end": 28750, "id": "b24", "idx": 24}, {"begin": 28754, "end": 29346, "id": "b25", "idx": 25}, {"begin": 29350, "end": 29511, "id": "b26", "idx": 26}, {"begin": 29515, "end": 29842, "id": "b27", "idx": 27}, {"begin": 29846, "end": 30117, "id": "b28", "idx": 28}, {"begin": 30121, "end": 30485, "id": "b29", "idx": 29}, {"begin": 30489, "end": 30728, "id": "b30", "idx": 30}, {"begin": 30732, "end": 30920, "id": "b31", "idx": 31}, {"begin": 30924, "end": 31134, "id": "b32", "idx": 32}, {"begin": 31138, "end": 31510, "id": "b33", "idx": 33}, {"begin": 31514, "end": 31634, "id": "b34", "idx": 34}, {"begin": 31638, "end": 31868, "id": "b35", "idx": 35}, {"begin": 31872, "end": 32024, "id": "b36", "idx": 36}, {"begin": 32028, "end": 32317, "id": "b37", "idx": 37}, {"begin": 32321, "end": 32684, "id": "b38", "idx": 38}, {"begin": 32688, "end": 32886, "id": "b39", "idx": 39}, {"begin": 32890, "end": 33262, "id": "b40", "idx": 40}, {"begin": 33266, "end": 33539, "id": "b41", "idx": 41}, {"begin": 33543, "end": 34497, "id": "b42", "idx": 42}, {"begin": 34501, "end": 34766, "id": "b43", "idx": 43}], "ReferenceToTable": [{"begin": 8472, "end": 8473, "target": "#tab_0", "idx": 0}, {"begin": 16218, "end": 16219, "idx": 1}, {"begin": 18496, "end": 18497, "target": "#tab_2", "idx": 2}], "Footnote": [{"begin": 21060, "end": 21356, "id": "foot_0", "n": "5", "idx": 0}, {"begin": 21357, "end": 21387, "id": "foot_1", "n": "6", "idx": 1}], "ReferenceToFormula": [{"begin": 2428, "end": 2433, "idx": 0}, {"begin": 13656, "end": 13660, "idx": 1}], "Paragraph": [{"begin": 76, "end": 570, "idx": 0}, {"begin": 571, "end": 744, "idx": 1}, {"begin": 745, "end": 1169, "idx": 2}, {"begin": 1187, "end": 1633, "idx": 3}, {"begin": 1649, "end": 2239, "idx": 4}, {"begin": 2240, "end": 2759, "idx": 5}, {"begin": 2760, "end": 3274, "idx": 6}, {"begin": 3275, "end": 4238, "idx": 7}, {"begin": 4239, "end": 5225, "idx": 8}, {"begin": 5226, "end": 6433, "idx": 9}, {"begin": 6434, "end": 7165, "idx": 10}, {"begin": 7166, "end": 7937, "idx": 11}, {"begin": 7938, "end": 8416, "idx": 12}, {"begin": 8466, "end": 8894, "idx": 13}, {"begin": 8895, "end": 9542, "idx": 14}, {"begin": 9543, "end": 9891, "idx": 15}, {"begin": 9892, "end": 10754, "idx": 16}, {"begin": 10790, "end": 11397, "idx": 17}, {"begin": 11398, "end": 11774, "idx": 18}, {"begin": 11775, "end": 12552, "idx": 19}, {"begin": 12569, "end": 13093, "idx": 20}, {"begin": 13094, "end": 13490, "idx": 21}, {"begin": 13491, "end": 13789, "idx": 22}, {"begin": 13790, "end": 14084, "idx": 23}, {"begin": 14085, "end": 14911, "idx": 24}, {"begin": 14951, "end": 15061, "idx": 25}, {"begin": 15062, "end": 15213, "idx": 26}, {"begin": 15214, "end": 15923, "idx": 27}, {"begin": 15924, "end": 16431, "idx": 28}, {"begin": 16432, "end": 17606, "idx": 29}, {"begin": 17621, "end": 18168, "idx": 30}, {"begin": 18211, "end": 18394, "idx": 31}, {"begin": 18395, "end": 18444, "idx": 32}, {"begin": 18490, "end": 18592, "idx": 33}, {"begin": 18593, "end": 19659, "idx": 34}, {"begin": 19717, "end": 19944, "idx": 35}, {"begin": 19945, "end": 20657, "idx": 36}, {"begin": 20658, "end": 21047, "idx": 37}], "SectionHeader": [{"begin": 0, "end": 1169, "idx": 0}], "SectionReference": [{"begin": 21389, "end": 34768, "idx": 0}], "Sentence": [{"begin": 76, "end": 175, "idx": 0}, {"begin": 176, "end": 438, "idx": 1}, {"begin": 439, "end": 570, "idx": 2}, {"begin": 571, "end": 643, "idx": 3}, {"begin": 644, "end": 744, "idx": 4}, {"begin": 745, "end": 776, "idx": 5}, {"begin": 777, "end": 833, "idx": 6}, {"begin": 834, "end": 1053, "idx": 7}, {"begin": 1054, "end": 1169, "idx": 8}, {"begin": 1187, "end": 1378, "idx": 9}, {"begin": 1379, "end": 1451, "idx": 10}, {"begin": 1452, "end": 1633, "idx": 11}, {"begin": 1649, "end": 1654, "idx": 12}, {"begin": 1655, "end": 1777, "idx": 13}, {"begin": 1778, "end": 2008, "idx": 14}, {"begin": 2009, "end": 2239, "idx": 15}, {"begin": 2240, "end": 2414, "idx": 16}, {"begin": 2415, "end": 2559, "idx": 17}, {"begin": 2560, "end": 2725, "idx": 18}, {"begin": 2726, "end": 2759, "idx": 19}, {"begin": 2760, "end": 2772, "idx": 20}, {"begin": 2773, "end": 2892, "idx": 21}, {"begin": 2893, "end": 3084, "idx": 22}, {"begin": 3085, "end": 3162, "idx": 23}, {"begin": 3163, "end": 3274, "idx": 24}, {"begin": 3275, "end": 3404, "idx": 25}, {"begin": 3405, "end": 3619, "idx": 26}, {"begin": 3620, "end": 3724, "idx": 27}, {"begin": 3725, "end": 3777, "idx": 28}, {"begin": 3778, "end": 3956, "idx": 29}, {"begin": 3957, "end": 4097, "idx": 30}, {"begin": 4098, "end": 4164, "idx": 31}, {"begin": 4165, "end": 4238, "idx": 32}, {"begin": 4239, "end": 4251, "idx": 33}, {"begin": 4252, "end": 4467, "idx": 34}, {"begin": 4468, "end": 4500, "idx": 35}, {"begin": 4501, "end": 4523, "idx": 36}, {"begin": 4524, "end": 4628, "idx": 37}, {"begin": 4629, "end": 4741, "idx": 38}, {"begin": 4742, "end": 4957, "idx": 39}, {"begin": 4958, "end": 5225, "idx": 40}, {"begin": 5226, "end": 5238, "idx": 41}, {"begin": 5239, "end": 5364, "idx": 42}, {"begin": 5365, "end": 5520, "idx": 43}, {"begin": 5521, "end": 5602, "idx": 44}, {"begin": 5603, "end": 5625, "idx": 45}, {"begin": 5626, "end": 5823, "idx": 46}, {"begin": 5824, "end": 6011, "idx": 47}, {"begin": 6012, "end": 6150, "idx": 48}, {"begin": 6151, "end": 6315, "idx": 49}, {"begin": 6316, "end": 6433, "idx": 50}, {"begin": 6434, "end": 6446, "idx": 51}, {"begin": 6447, "end": 6595, "idx": 52}, {"begin": 6596, "end": 6723, "idx": 53}, {"begin": 6724, "end": 6749, "idx": 54}, {"begin": 6750, "end": 6828, "idx": 55}, {"begin": 6829, "end": 6905, "idx": 56}, {"begin": 6906, "end": 7005, "idx": 57}, {"begin": 7006, "end": 7165, "idx": 58}, {"begin": 7166, "end": 7178, "idx": 59}, {"begin": 7179, "end": 7245, "idx": 60}, {"begin": 7246, "end": 7418, "idx": 61}, {"begin": 7419, "end": 7535, "idx": 62}, {"begin": 7536, "end": 7583, "idx": 63}, {"begin": 7584, "end": 7611, "idx": 64}, {"begin": 7612, "end": 7937, "idx": 65}, {"begin": 7938, "end": 7950, "idx": 66}, {"begin": 7951, "end": 8171, "idx": 67}, {"begin": 8172, "end": 8416, "idx": 68}, {"begin": 8466, "end": 8552, "idx": 69}, {"begin": 8553, "end": 8633, "idx": 70}, {"begin": 8634, "end": 8836, "idx": 71}, {"begin": 8837, "end": 8894, "idx": 72}, {"begin": 8895, "end": 9122, "idx": 73}, {"begin": 9123, "end": 9275, "idx": 74}, {"begin": 9276, "end": 9333, "idx": 75}, {"begin": 9334, "end": 9542, "idx": 76}, {"begin": 9543, "end": 9762, "idx": 77}, {"begin": 9763, "end": 9800, "idx": 78}, {"begin": 9801, "end": 9891, "idx": 79}, {"begin": 9892, "end": 10135, "idx": 80}, {"begin": 10136, "end": 10371, "idx": 81}, {"begin": 10372, "end": 10561, "idx": 82}, {"begin": 10562, "end": 10653, "idx": 83}, {"begin": 10654, "end": 10754, "idx": 84}, {"begin": 10790, "end": 10975, "idx": 85}, {"begin": 10976, "end": 11062, "idx": 86}, {"begin": 11063, "end": 11166, "idx": 87}, {"begin": 11167, "end": 11397, "idx": 88}, {"begin": 11398, "end": 11506, "idx": 89}, {"begin": 11507, "end": 11615, "idx": 90}, {"begin": 11616, "end": 11774, "idx": 91}, {"begin": 11775, "end": 11826, "idx": 92}, {"begin": 11827, "end": 11946, "idx": 93}, {"begin": 11947, "end": 12105, "idx": 94}, {"begin": 12106, "end": 12328, "idx": 95}, {"begin": 12329, "end": 12552, "idx": 96}, {"begin": 12569, "end": 12643, "idx": 97}, {"begin": 12644, "end": 12826, "idx": 98}, {"begin": 12827, "end": 13093, "idx": 99}, {"begin": 13094, "end": 13384, "idx": 100}, {"begin": 13385, "end": 13490, "idx": 101}, {"begin": 13491, "end": 13707, "idx": 102}, {"begin": 13708, "end": 13789, "idx": 103}, {"begin": 13790, "end": 13922, "idx": 104}, {"begin": 13923, "end": 14084, "idx": 105}, {"begin": 14085, "end": 14172, "idx": 106}, {"begin": 14173, "end": 14297, "idx": 107}, {"begin": 14298, "end": 14519, "idx": 108}, {"begin": 14520, "end": 14580, "idx": 109}, {"begin": 14581, "end": 14695, "idx": 110}, {"begin": 14696, "end": 14818, "idx": 111}, {"begin": 14819, "end": 14911, "idx": 112}, {"begin": 14951, "end": 15061, "idx": 113}, {"begin": 15062, "end": 15158, "idx": 114}, {"begin": 15159, "end": 15213, "idx": 115}, {"begin": 15214, "end": 15297, "idx": 116}, {"begin": 15298, "end": 15385, "idx": 117}, {"begin": 15386, "end": 15473, "idx": 118}, {"begin": 15474, "end": 15583, "idx": 119}, {"begin": 15584, "end": 15764, "idx": 120}, {"begin": 15765, "end": 15842, "idx": 121}, {"begin": 15843, "end": 15923, "idx": 122}, {"begin": 15924, "end": 16123, "idx": 123}, {"begin": 16124, "end": 16352, "idx": 124}, {"begin": 16353, "end": 16431, "idx": 125}, {"begin": 16432, "end": 16584, "idx": 126}, {"begin": 16585, "end": 16757, "idx": 127}, {"begin": 16758, "end": 17043, "idx": 128}, {"begin": 17044, "end": 17207, "idx": 129}, {"begin": 17208, "end": 17329, "idx": 130}, {"begin": 17330, "end": 17492, "idx": 131}, {"begin": 17493, "end": 17506, "idx": 132}, {"begin": 17507, "end": 17606, "idx": 133}, {"begin": 17621, "end": 17783, "idx": 134}, {"begin": 17784, "end": 17978, "idx": 135}, {"begin": 17979, "end": 18156, "idx": 136}, {"begin": 18157, "end": 18168, "idx": 137}, {"begin": 18211, "end": 18394, "idx": 138}, {"begin": 18395, "end": 18444, "idx": 139}, {"begin": 18490, "end": 18532, "idx": 140}, {"begin": 18533, "end": 18592, "idx": 141}, {"begin": 18593, "end": 18676, "idx": 142}, {"begin": 18677, "end": 18788, "idx": 143}, {"begin": 18789, "end": 18888, "idx": 144}, {"begin": 18889, "end": 19007, "idx": 145}, {"begin": 19008, "end": 19166, "idx": 146}, {"begin": 19167, "end": 19314, "idx": 147}, {"begin": 19315, "end": 19446, "idx": 148}, {"begin": 19447, "end": 19577, "idx": 149}, {"begin": 19578, "end": 19659, "idx": 150}, {"begin": 19717, "end": 19728, "idx": 151}, {"begin": 19729, "end": 19808, "idx": 152}, {"begin": 19809, "end": 19944, "idx": 153}, {"begin": 19945, "end": 19957, "idx": 154}, {"begin": 19958, "end": 20054, "idx": 155}, {"begin": 20055, "end": 20179, "idx": 156}, {"begin": 20180, "end": 20348, "idx": 157}, {"begin": 20349, "end": 20417, "idx": 158}, {"begin": 20418, "end": 20609, "idx": 159}, {"begin": 20610, "end": 20657, "idx": 160}, {"begin": 20658, "end": 20876, "idx": 161}, {"begin": 20877, "end": 20992, "idx": 162}, {"begin": 20993, "end": 21047, "idx": 163}], "ReferenceToFigure": [{"begin": 2068, "end": 2069, "target": "#fig_0", "idx": 0}, {"begin": 3964, "end": 3965, "target": "#fig_0", "idx": 1}, {"begin": 10797, "end": 10798, "target": "#fig_1", "idx": 2}, {"begin": 11378, "end": 11379, "idx": 3}, {"begin": 11504, "end": 11505, "target": "#fig_2", "idx": 4}, {"begin": 15405, "end": 15406, "target": "#fig_0", "idx": 5}, {"begin": 20674, "end": 20675, "target": "#fig_5", "idx": 6}], "Div": [{"begin": 76, "end": 1169, "idx": 0}, {"begin": 1172, "end": 1633, "idx": 1}, {"begin": 1635, "end": 8416, "idx": 2}, {"begin": 8418, "end": 8443, "idx": 3}, {"begin": 8445, "end": 10754, "idx": 4}, {"begin": 10756, "end": 12552, "idx": 5}, {"begin": 12554, "end": 14911, "idx": 6}, {"begin": 14913, "end": 17606, "idx": 7}, {"begin": 17608, "end": 19659, "idx": 8}, {"begin": 19661, "end": 21047, "idx": 9}], "SectionMain": [{"begin": 1169, "end": 21047, "idx": 0}]}}