{"text": "Predictive modeling of microbiological seawater quality classification in karst region using cascade model\n\nAbstract:\nIn this paper, an in-depth analysis of Escherichia coli seawater measurements during the bathing season in the city of Rijeka, Croatia was conducted. Submerged sources of groundwater were observed at several measurement locations which could be the cause for increased E. coli values. This specificity of karst terrain is usually not considered during the monitoring process, thus a novel measurement methodology is proposed. A cascade machine learning model is used to predict coastal water quality based on meteorological data, which improves the level of accuracy due to data imbalance resulting from rare occurrences of measurements with reduced water quality. Currently,\n\nMain:\n\n\n\n1. Introduction\nMicrobiological contamination presents a great concern in areas where water bodies are used for recreational activities since the existence of pathogens can cause serious health problems (Solo-Gabriele et al., 2016). This is especially important for tourism-oriented countries, such as Croatia, since bathing locations with high water quality can attract tourists, and maintenance of such favourable repute is one of the main priorities. Currently, the main methodology for water quality classification consists of fortnightly measurements of feacal indicator bacteria, such as Escherichia Coli or enterococci.\nUnfortunately, measurements are temporary and spatially sparse as they are expensive and time consumable. This is a considerable problem since studies observed that number of microbes has a high temporal and spatial variation (Ekklesia et al., 2015; Vukić Lušić et al., 2017). Additionally, currently in Croatia, sampling and laboratory testing take about 2.5 days, thus the information is already outdated by the time it is obtained. Therefore, methods for predicting water quality integrating meteorological data are increasingly cient dilution of wastewater in seawater.  Chahouri et al. (2021) conducted an assessment of both beach and estuary location in Agadir bay, South-West Morocco. It is noted that estuary location is influenced by effluents from untreated wastewater and agricultural activities and the tourist beach is center of human activities, where greater fecal streptococci loads were observed at the estuary location. These studies indicate need for consideration of both urban development and geographical specifics of each location.\nThe terrain of the Croatian coast is mostly of karst type and characterized by high porosity and numerous subterranean channels, which makes it very vulnerable to pollution since surface water can quickly and easily enter groundwater (Pikelj and Juračić, 2013). Investigation of E. coli pollution in karst was conducted in a number of studies (Davis et al., 2005; Laroche et al., 2010). Sources of groundwater contamination can include landfills (Kogovšek and Petrič, 2013), sewage outflows (Heinz et al., 2009; Stange and Tiehm, 2020), agricultural or urban land-use type (Reed et al., 2011; Buckerfield et al., 2019), etc. For this reason, the water quality of karst aquifers used for drinking water is regularly monitored with special care, while karst aquifers not used for drinking water are not regularly monitored due to their reduced importance.\nWith growing interest in increased protection of water surfaces, prediction modeling is being used to provide information to the general public regarding potential health risks.  He and He (2008) used Artificial Neural Network (ANN) to predict water quality regarding stormwater runoff with reported less than 10% false positive or negative rates. In de Souza et al. (2018b) and de Souza et al. (2018a) regression models for predicting fecal indicators in coastal waters are developed and optimized, where cumulative solar radiation and cumulative rainfall values were shown to greatly influence the prediction of fecal pollution.  He et al. (2019) used Multiple linear regression (MLR) model to predict pathogen contamination using environmental data collected during the storm event.  Grbčić et al. (2021) such can be used on pollution measurement datasets with sparse cases of high pollution, which are the most common. In-depth analysis of measured data indicated the potential influence of submerged coastal springs which are specific for karst soil. In previous research (Vukić Lušić et al., 2017), these springs were not considered as possible pollution sources because they predominantly dry up during the bathing season. However, during the investigation of hydrogeological data for the monitored region, it was found that some of them are active throughout the whole year. Considering these new findings further research directions are presented in the discussion section.\n\n2. Materials and methods\n\n\n2.1. Data collection\nThe city of Rijeka is located in Kvarner Bay and is the third-largest Croatian city with important industrial locations such as shipyard and port, but with the increasing tendency to become a recognized touristic location.\nThe city has Mediterranean climate, with dry and warm summers, and its surrounding is also characterized by a large amount of rainfall due to the proximity of Dinaric Alps. In the city of Rijeka precipitation is estimated at about 1540 mm per year, with 550 mm per year for period May to September. The average temperature of the warmest months (July and August) is 23.1 • C (Zaninović et al., 2008). The bathing season usually lasts from mid-May until the end of September, and in that period regular measurements of water quality are conducted. Measurements from 9 locations on the west side of the city are considered for analysis with mentioned locations spread over roughly 2 km length of the coastline. Locations of the measurement points can be observed in Figure 1. Regular measurements, with fortnightly intervals, from 2009 to 2020, are used as data inputs for the prediction model.\nSamples were taken from the boat in a short timeframe. Samples from all considered measuring points were collected, on average, within 30 minutes. Consequently, differences in atmospheric conditions are very small or nonexistent, between measurements taken on the same day. For each measurement point, samples are taken at a similar distance (20 meters) from the coast.\nDuring several months in 2012 and 2014, additional measurements were conducted every 4 hours for 5 measuring points: KBW, KBE, KW, KE, and 3M (see Figure 1). Additional measurements taken in the morning, which is the time when regular measurements are conducted, were also included in the analyzed dataset to increase the number of measurements. Additional measurements were always taken from the same location at the coast. Water temperature, salinity, and air temperature were measured in situ and E. coli value was analyzed in the laboratory from the collected sample. For E. coli enumeration membrane filtration technique was used, according to the ISO-9308-1 method for period 2009-2017 and temperature-modified ISO-9308-1 method for period 2018-2021. Cultivation was performed on CCA nutrient media (Chromogenic Coliform agar, Biolife Italiana S.r.l., Milan, Italy) for 4 h at 36 ± 2 • C followed by 20 h incubation at 44 ± 0.5 • C (Jozić and Vukić Lušić, 2018; Jozić et al., 2018). Further details on data collection and analysis are given in Vukić Lušić et al. (2017). In total, considered measurements have 1137 records. It must be noted that not all measuring points have the same number of measurements, since 5 locations (KBW, KBE, KW, KE, and 3M) have additional measurements and measurements for PNI started in 2019.\n\n2.2. Environmental parameters\nFeatures chosen for prediction modelling were meteorological data obtained during measurements: water temperature, air temperature, and salinity. Additionally, solar irradiance as current Global Horizontal Irradiance (GHI) and cumulative irradiance for the past 4 hours are also considered.\nThe chosen data was taken from Solcast (2021) database. The rainfall data was obtained from the Croatian Meteorological and Hydrological Service (DHMZ). Different combinations of cumulative rainfall values, such as previous 24 hours, previous 48 hours, etc., were also considered since in a number of previous studies influence of rainfall, especially storm events, were investigated (He et al., 2019; Weiskerger and Phanikumar, 2020). It was observed that a very small number of measurements have any rainfall from the previous several days, thus cumulative sums from 4 − 7 and 7 − 14 days are considered as a possible indication of soil saturation, which can happen if a larger amount of rain is present during a longer period of time. If soil is saturated, new rain can influence the activation of underground sources in the sea, which can increase the amount of E. coli.\n\n2.3. Data analysis and preparation\nThe considered measurement points are chosen for prediction modeling since, historically, these locations have lower water quality than other bathing locations in the city, even though only a small amount of these measurements show less than excellent water quality. EU legislation (EC, 2006) prescribe two fecal indicator bacteria, E. coli and enterococci where in Vukić Lušić et al. ( 2017) it was observed that E. coli criteria in Croatian legislation (Directive, 2008) are more stringent. Thus in this work, the prediction models are investigated considering only E. coli limits. Bathing water quality can be divided into three categories, where, by Croatian standards, excellent water quality is for E. coli measurements in the range 0-150 CFU/100 mL (in at least 95% of samples), good water quality in E. coli range 150-300 CFU/100 mL in at least 95% of samples, and sufficient quality for the range up to 300 CFU/100 mL in at least 90% of samples. EU criteria allow E. coli values up to 250 CFU/100 mL (in at least 95% of samples) for excellent water quality, good water quality in the range 250-500 CFU/100 mL (in at least 95% of samples) and sufficient water quality for E. coli values up to 500 CFU/100 mL in at least 90% of samples. If Croatian criteria is applied, and value for E. coli contamination is taken as 300 CFU/100 mL, there are 21 records in the dataset with E. coli values above that threshold. If contamination measure is taken as 150 CFU/100 mL, 122 records have E. coli value above that threshold. It can be observed that there is only 11% of less-than-excellent and only 1.8% of less-than-sufficient water quality measurements. Thus, an in-depth analysis of these cases is performed. Histogram of considered measurements can be observed in the Figure 2.\nIt was observed that greater values of E. coli can be roughly grouped in three types of pollution events. The first are unexpected and unexplained surges in E. coli concentration during the monitoring. They are followed by control measurements and are considered as an accidental event. These measurements are considered outliers since they show no correlation with meteorological data, thus it is reasonable to believe that these are singular incident events. Therefore these measurements are removed from the data set to improve the prediction model performance. After this correction, 1133 measurement remained, with 17 records having E. coli value above 300 CFU/100 mL (1.5% of measurements) and 118 records above 150 CFU/100 mL (10.4% of measurements). The second group of events are typically occurring during spring, where it was observed that water salinity is reduced in all measuring points, which can be explained by the greater amount of precipitation during the spring period which could lead to greater E. coli concentrations. The average salinity value for the period from May to mid-June was 30.6 with an average E. coli value 72.3 CFU/100 mL, and for the period from mid-June to September, average salinity was 34 with an average E. coli value 46 CFU/100 mL, which supports the presented assumption.\nThe third type of events are the occurrences where it was observed that some measuring points show higher E. coli value coupled with lower water temperature and lower water salinity than other nearby measuring points, during the same measurement period. This indicates the presence of local sources of groundwater at these measuring points. It must be noted that not all measurements with lower water quality can be put in these categories, thus prediction modelling needs to be utilized to find additional correlations.\nThe mean value of salinity was analysed for all measuring points to investigate the possible correlation with E. coli value and results are presented in Table 1. It can be observed that locations with greater average E. coli value also have smaller average salinity. This can be explained by the fact that underground water sources, which presence can be observed through reduced water salinity, collect bacteria from the watershed area and transport them into the seawater. However, this assumption needs to be further investigated.\n\n2.4. Random Forest classifier\nMachine learning algorithms are designed to find an underlying correlation or patterns between the data input and data output to provide a prediction for unseen data. Machine learning algorithms can be divided into regression and classification algorithms, where the first group of algorithms this paper, by nature of corresponding regulation, deals with water quality groups, a classifier algorithm was considered for the prediction of water quality. Prediction models were constructed with only two classes, i.e. a prediction is made whether E. coli value is above or below the considered limit.\nRandom Forest classifier implementation in the Python library Scikit-learn (Pedregosa et al., 2011) version 0.20.3 was used.\nRandom Forest classifier is an ensemble type of machine learning algorithm which was first proposed by Breiman (2001). It consists of multiple decision trees which stand as independent prediction models. The bootstrap method is used to provide a unique subset for the training of each decision tree while the aggregation method is used to count the class with the most prediction occurrences which is then considered as the prediction of the Random Forest model.\nDifferent combinations of Random Forest Classifier parameters were investigated, where best results were obtained for 100 estimators, maximum depth of 10, and the minimum number of samples required to split an internal node equal to 6. All other parameters were kept at default values.\nConsidered parameters were obtained for prediction model trained on the first group of uniformly distributed data with E. coli classification limit 150 CFU/100 mL which is Croatian criteria for excellent water quality.\n\n2.5. Prediction models and sampling methodology\nBased on different data clustering strategies, three different prediction models were created. One where all measurements were taken as inputs for a single prediction model since all measuring points are geographically near each other. The second and third models were constructed for westernmost  approach. This is because model parameters evaluation based on classification prediction accuracy only considers if classification is true or false, and does not consider model certainty regarding prediction, which is the basis for threshold approach utilisation. Ultimately, the best performance was obtained for 800 estimators, a maximum depth of 10, and the minimum number of samples required to split an internal node equal to 6. These parameters are used for all cascade models and for all stages.5\nAlthough each stage of the cascade produces imperfect predictions on whether E. coli concentration is above or below the median value, these wrong predictions are not problematic for the cascade model as a whole,\nsince ultimately what matters is whether the measurement value is above or below the chosen quality limit. Cascade model was investigated for 250 CFU/100 mL limit, which is the EU limit for excellent water quality. This results in 63 measurements (5.5% of all measurements) above the chosen limit, with datasets still having considerable bias.\n\n3. Results\n\n\n3.1. Random forest classifier -all measuring points\nResults for the first group of prediction models with all measurement data for different testing-training data splits and for different classification limits are presented in Table 2. Considered features are water salinity, water temperature, air temperature, GHI, and cumulative GHI for the previous 4 hours which were meteorological data measured during the measurement process with the addition of solar irradiance which is known to positively affect E. coli decay (Whitman et al., 2004; Berney et al., 2006; Maraccini et al., 2016). It can be observed that for the EU limit for excellent water quality (250 CFU/100 mL) all models have only 20% of measurements above the given limit correctly classified. That is expected since the number of measurements with reduced water quality is considerably smaller than the number of measurements with excellent quality, thus the prediction model's bias towards excellent quality class yields high model accuracy. When the national limit for excellent water quality (150 CFU/100 mL) was used, an increased true positive rate can be observed, albeit it is still very low due to a small number of measurements above the chosen limit. Different classification limits were investigated with the addition of median value to create a balanced split between classes. Results are presented in the Figure 4. It was observed that with a lower classification limit problem becomes more balanced and model accuracy increases while model accuracy and true positive rate become similar in proximity to the median limit. To take into account specifics of each training set, it is decided not to consider fixed classification limits, instead, a median value is chosen which always provides a balanced problem through all stages of the cascade model. For each dataset and different classification limits, the analysis of feature importance was conducted. A similar trend was observed for all considered datasets, thus results are reported only for Set1 (Table 3). It was observed that for both limits, salinity has the greatest importance, followed by GHI, water temperature air temperature, and cumulative GHI for the last 4 hours.\nInvestigation of other classification limits indicated that the prediction model is more uncertain about its decision about feature importance when a higher classification limit is chosen, which can also be observed here with greater standard deviation for features for EU (250 CFU/100 mL) limit for excellent water quality.\n\n3.2. Random forest classifier -separated models\nFurther analysis was conducted for two separated models, one with a group of measuring points with higher average E. coli value and the second is achieved for the prediction model with all measurement points and for all available data when the median value is taken as a classification limit.\nAlthough this behaviour should be investigated for other training-testing splits, in the subsequent analysis of the cascade model, a single prediction model with all measurement points will be adopted for each stage, as it is evident that the number of measurements, when compared to segregated approach, contributes more to the overall accuracy.\n\n3.4. Cascade model results\nThe cascade model was first tested on Set1 in order to calibrate the stage parameters. The overview of stage metrics for Set1 can be observed in Table 6. Gradual reduction of training inputs and increase of median value through stages can be observed. Six stages were chosen since it was decided that with further stages the size of the training dataset would be too low for prediction model training.\nThe cascade model was run 50 times, where average feature importance through stages is presented in Table 7. It can be observed that at the first stage water salinity has the greatest importance, although as prediction mod- indicates that the introduction of other features at higher level stages could be beneficial for the prediction model. sen threshold, which is chosen to be lower than the threshold for the current stage, then measurement can also be classified as below limit. This can be understood as that two weak certainties at subsequent stages can be considered as one strong certainty in the current stage. The considered threshold values were 70% for the second and third stage and 75% for the remaining stages.\nAdditionally, the influence of different features throughout the stages was also considered. Due to its small feature importance in the first three stages, the air temperature was removed as a feature and then introduced only in the last three stages. Combinations of these methods were also investigated.\nOverview of the obtained results can be seen in Table 9. It can be observed that all proposed methods increase the number of excellent quality predictions, where the combination of all three methods further increases that number. It must be noted that only one combination for each method was presented, where further investigation of more combinations could provide better results, e.g. different features, different values of increasing threshold value, etc.\nProposed improvement of the cascade model with all three adjustments was tested on different datasets and results are presented in Table 10. It can be observed that the number of correct predictions of excellent quality is\n\n4. Discussion\n\n\n4.1. Prediction modeling\nFrom the conducted analysis it can be concluded that a single prediction model for prediction of E. coli value being above or under limits 150 or 250 CFU/100 mL does not provide satisfactory results due to considerable data bias. The prediction model tends to classify all measurements as excellent quality since they make a vast majority of the measurements. Thus, a cascade model is introduced which is shown to work well as a filter of measurements with excellent quality, without removing measurements above the chosen limit. The proposed cascade model has balanced datasets at each stage since the median value is considered as a classification limit at each stage.\nHowever, different limits can also be explored to possibly further improve model accuracy. It must be noted that in general, measurements considered in this paper have overall excellent water quality, however, the presented methodology can be used for different pollution values since the cascade model is constructed to adapt to the provided data.\nIt was observed that the salinity feature has the greatest importance in single prediction models, and also for several first stages of the cascade model. However, in further stages, it was observed that salinity value is not as important. It indicates that the salinity feature has the greatest importance for predicting measurements with low E. coli value. Since the majority of measurements for the single prediction model have low E. coli value, a strong weight is put on the salinity value which is beneficial for the majority of data but is not beneficial for the right prediction of high E. coli measurements, which are in fact most important. Thus, the cascade model enables adjustment of feature importance through stages for different levels of pollution. Additionally, some features that could be important for the right prediction of higher E. coli values would decrease accuracy for low E.\ncoli values, thus different features can be included at different stages. In order to maximize the capabilities of the cascade model approach, precise feature engineering should be conducted.\nIt must be noted that RF model parameters were the same for all stages and proposed improvements for the cascade model were investigated only for one combination of parameters. Further investigation of model parameters through stages and further study of different combinations of proposed improvements should be conducted to further increase cascade model efficiency.\nCurrently, both cascade and single prediction models are constructed with measurements from multiple measurement points due to the small amount of data. However, ultimately separated prediction models could be constructed to establish a relation between E. coli value and specific processes for that measurement point.\n\n4.2. Data analysis\nFrom in-depth analysis of measurement data, it was observed that sources of groundwater are related with the greater value of E. coli. This was also corroborated by the higher importance of salinity in the first couple of stages of the cascade model. High salinity value corresponds to summer months with longer dry periods, where E. coli values are very low (as are classification limits for the first several stages), where the prediction model heavily relies on that information to consider a measurement as excellent quality. As salinity value decreases, it most often corresponds to spring months where the sea is still influenced by longer periods of rainfall, or alternatively to measurements influenced by coastal springs. For both of these occurrences, it is important to consider solar irradiation and both water and air temperature, which is supported with more evenly distributed feature importance at higher stages.\nGroundwater springs are of great interest when they can be used as a source of drinking water. Since coastal springs that are of interest in this study are brackish springs, smaller and with seasonal character there is no study of their characteristics in the literature. Additional in-field investigation of 3M location was conducted during May 2021 after a longer period of rain where a considerable number of submerged spring sources were observed (Figure 5). Although the occasional presence of springs is well known since they can be experienced as cold areas during swimming, they were not previously considered as being of strong importance and were thought to dry up during summer. However, observation of these springs is mentioned in Stražičić (1999), where two big springs which are active throughout the whole year are said to exist at the 3M location. Furthermore, another three springs are mentioned, where the eastern spring, which is closest to the bathing location, is active yearlong and the other two usually become inactive only by the end of summer. In KE location one strong spring is mentioned with the addition of the number of smaller springs throughout the coast.\nAdditionally, in the immediate vicinity of the beach 3M is greater spring Cerovice (Figure 6) which is located inside shipyard \"3. Maj\". It consists of several springs that are active throughout the whole year, but since microbiological pollution was observed that water is only used as technical water. This could explain reduced water quality for measurement locations 3M and KE, which are specific since they have a considerable amount of springs active yearlong, probably with water quality similar to spring Cerovice. Reduced water quality in KW location could be due to the influence of KE springs since wind and sea currents can cause transport of contamination. Additionally, in the study by Biondić et al. (2009) risk assesment of underground water was conducted, where it was indicated that landfills in the hinterland of city Rijeka can influence coastal springs in the area considered in this study (Figure 6).\nThese observations indicate that current data, comprising both from regular measurements taken from the boat (approximately 20 m from the coastline) and additional measurements taken from the coast, could give considerably different results under the same meteorological conditions if additional sampling is conducted in the immediate vicinity of the spring location. Both types of measurements were included to increase the teaching dataset which should lead to improved model accuracy, however with these new findings, this could in fact reduce prediction model accuracy. Thus, several directions of further research are suggested.\n\n4.3. Further research\nFirst, analysis of the coastal area should be conducted in order to investigate the number and locations of possible coastal springs. It is known that some sources are active only for some periods, where some sources are active almost all year. Thus, an investigation of the source activation period should be conducted. Observation of these sources presented in Stražičić (1999) only notes their existence and locations while activation periods and discharge values should be also known so as to assess their influence on bathing locations.\nAlso, these observations should be revised and adjusted, due to changes in city infrastructure (such as drainage and sewage systems reconstructions) conducted in the period of the last 20 years or more. Additionally, every beach location has its specific geomorphology, where the number and size of springs are different, as well as its openness to the sea. In this study, 3M location was further inspected (Figure 5) which is a closed, small port, and as such under a strong influence of the observed springs. Other locations, which are less enclosed, are expected to show a smaller influence of springs, however, this premise should be further investigated.\nThe second direction of future research should investigate rainfall influence and watershed area more extensively. Different rainfall correlations with increased microbial pollution are found through literature, e.g. previous 24 hours (Mallin et al., 2001), 48 hours (Kelsey et al., 2004), 7 days (Lipp et al., 2001), 5.5-9.5 days (de Souza et al., 2018b) and even 30 days (Pandey et al., 2012). This is a strong indication that geological specifics must be taken into consideration. Precipitation considered in this work was only from a single location for the city center of Rijeka, which can influence short-term water influx to the sea. However, during summer periods it can be expected that dry ground absorbs a great amount of rainfall. This could explain why there was no considerable correlation with cumulative sums of rainfall from several previous days in the city center. Additionally, karst groundwater is greatly influenced by precipitation from the whole watershed area. For example, tracer tests were conducted in Biondić et al. (2005) where the tracer was injected in V. Snežnik (Slovenia) where underground water connection with Kvarner Bay area was identified, including measurement locations considered in this study, indicating transboundary characteristics of the investigated area. Thus, further research should include an investigation of correlations between coastal springs' activation and wider regional area's precipitation, as these distant rainfalls are expected to possibly be more influential for coastal spring activity than local rainfall. It is also important to mention that a boundary between two watersheds is passing through the center of the city of Rijeka, thus bathing locations on the east side of the city are expected to show a different behaviour, and different locations for rainfall measurements should be considered.\nUltimately, the measurement process of E. coli could be improved on the grounds of these new observations. If a stronger influence of groundwater sources is observed for some bathing locations, and if those sources are observed to often have reduced water quality, a unique measurement method-ology should be established for these locations, where multiple locations, contrary to the current single measurement location, should be investigated to give a better description of the considered bathing location. Additionally, in Rukavina (2007) the bathing locations in the east part of Rijeka were analysed, and springs were found to have unusually and considerably greater value of E. coli then values observed at the monitoring location. Follow-up investigation led to the identification of one business located approximately 2 km upstream, with inappropriate wastewater connection as a source of pollution which was connected with observed springs. This indicates that springs are a great vulnerability of bathing locations, especially if they have a greater outflow and are influenced by greater watershed area where periodic monitoring of such springs should also be considered.\n\n5. Conclusion\nIn the presented paper, in-depth data analysis of E. coli measurements and related data was conducted and a predictive machine learning modeling strategy was proposed. Due to a very small amount of measurements with reduced water quality in the database, it was shown that a single prediction model has reduced prediction accuracy due to bias toward classifying all measurements as excellent quality. Thus, a cascade model approach is proposed which classifies measurement as excellent quality only if it is highly certain regarding its decision. Other measurements remain suspect, therefore the proposed method can be considered as a filter method, which can be fur-ther improved to be used as a standalone model. The following observations regarding the prediction model can be made:\n• Grouping of measurement points does not provide improvement in prediction model accuracy since an increased number of inputs is more beneficial.\n• Due to bias of input data it is difficult for a single prediction model to confidently predict occurrences of subpar bathing water quality.\n• Cascade model can provide a predictive data filter in which excellent water quality can be predicted with high accuracy, based on meteorological data, solar irradiation, and seawater salinity.\n• Due to the high flexibility of cascade model, multiple strategies of its improvement could possibly lead to it being eventually used as a standalone prediction model.\n• Ultimately, a separate prediction model for each measurement point could be constructed, to capture the uniqueness of each beach, which is especially important in the karst type of terrain.\nConducted study indicates a strong need for an interdisciplinary approach for the given problem. The karst type of soil with its specific underground landscape absorbs rainfall from a large watershed area, indicating not only rainfall period but also rainfall measurement locations are important. Additionally, E. coli measurements could be conducted for the number of known springs to indicate which springs contribute to the coastal seawater pollution and in which amount. Regarding E. coli measurements, the following is observed:\n• Submerged groundwater sources, active yearlong, are observed which could correlate with greater E. coli value.\n• Number of groundwater sources and their intensity should be investigated at the considered bathing locations.\n• New sampling methodology should be established to take into consideration the mixing of microbiologically contaminated submerged spring water and seawater.\n\n6. Acknowledgements\nThis research article is a part of the project Computational fluid flow, flooding, and pollution propagation modeling in rivers and coastal marine waters -KLIMOD (grant no. KK.05.1.1.020017), and is funded by the Ministry of Environment and Energy of the Republic of Croatia and the European structural and investment funds. Also, the authors acknowledge the funding of the University of Rijeka through the project Razvoj hibridnog 2D/3D modela za učinkovito modeliranje strujanja u rijekama, jezerima i morima.\nFurthermore, authors acknowledge the support of the Center of Advanced\nComputing and Modelling at the University of Rijeka for providing computing resources.\n\nFootnotes:\n\nReferences:\n\n- Agency, E.E., 2009. Bathing water profiles: Best practice and guidance. URL: https://ec.europa.eu/environment/water/water-bathing/ pdf/profiles_dec_2009.pdf. accessed: 2021-03-06.- Berney, M., Weilenmann, H.U., Simonetti, A., Egli, T., 2006. Efficacy of solar disinfection of escherichia coli, shigella flexneri, salmonella typhimurium and vibrio cholerae. Journal of applied microbiology 101, 828-836.\n\n- Biondić, R., Biondić, B., Rubinić, J., Meaški, H., Kapelj, S., Tepeš, P., 2009. Ocjena stanja i rizika cjelina podzemnih voda na krškom području u repub- lici hrvatskoj. Završno izvješće. Arhiv Geotehničkog fakulteta Sveučilišta u Zagrebu, Varaždin .\n\n- Biondić, R., Prestor, J., Kapelj, S., Dolić, S., 2005. Slovenski snežnik-visoka zona sliva izvora grada rijeke. Knjiga sažetaka-3. Hrvatski geološki kongres , 179-180.\n\n- Breiman, L., 2001. Random forests. Machine learning 45, 5-32.\n\n- Buckerfield, S.J., Quilliam, R.S., Waldron, S., Naylor, L.A., Li, S., Oliver, D.M., 2019. Rainfall-driven e. coli transfer to the stream-conduit network observed through increasing spatial scales in mixed land-use paddy farming karst terrain. Water research X 5, 100038.\n\n- Chahouri, A., El Ouahmani, N., El Azzaoui, A., Yacoubi, B., Banaoui, A., Moukrim, A., 2021. Combined assessment of bacteriological and environ- mental indicators of fecal contamination in agadir bay ecosystems (south- west morocco). International Journal of Environmental Science and Tech- nology , 1-14.\n\n- Cho, K.H., Cha, S.M., Kang, J.H., Lee, S.W., Park, Y., Kim, J.W., Kim, J.H., 2010. Meteorological effects on the levels of fecal indicator bacteria in an urban stream: a modeling approach. Water research 44, 2189-2202.\n\n- Davis, R.K., Hamilton, S., Brahana, J.V., 2005. Escherichia coli survival in mantled karst springs and streams, northwest arkansas ozarks, usa 1. JAWRA Journal of the American Water Resources Association 41, 1279- 1287.\n\n- Directive, G.o.t.R.o.C., 2008. Regulation on sea bathing water quality, gov- ernment of the republic of croatia. Official Gazette No. 73.\n\n- Dwight, R.H., Caplan, J.S., Brinks, M.V., Catlin, S.N., Buescher, G., Se- menza, J.C., 2011. Influence of variable precipitation on coastal water quality in southern california. Water Environment Research 83, 2121- 2130.\n\n- EC, 2006. European council directive 2006/7/ec of 15 february 2006 con- cerning the management of bathing water quality and repealing directive 76/160/eec. Official Journal of the European Union, L64/37.\n\n- Ekklesia, E., Shanahan, P., Chua, L.H., Eikaas, H., 2015. Temporal variation of faecal indicator bacteria in tropical urban storm drains. Water research 68, 171-181.\n\n- European Union, Copernicus Land Monitoring Service 2018, E.E.A.E., 2018. Copernicus land monitoring service. URL: https://land.copernicus. eu/.\n\n- Grbčić, L., Družeta, S., Mauša, G., Lipić, T., Lušić, D.V., Alvir, M., Lučin, I., Sikirica, A., Davidović, D., Travaš, V., et al., 2021. Coastal water quality prediction based on machine learning with feature interpretation and spatio-temporal analysis. arXiv preprint arXiv:2107.03230 .\n\n- He, L.M.L., He, Z.L., 2008. Water quality prediction of marine recreational beaches receiving watershed baseflow and stormwater runoff in southern california, usa. Water research 42, 2563-2573.\n\n- He, Y., He, Y., Sen, B., Li, H., Li, J., Zhang, Y., Zhang, J., Jiang, S.C., Wang, G., 2019. Storm runoff differentially influences the nutrient concentrations and microbial contamination at two distinct beaches in northern china. Science of The Total Environment 663, 400-407.\n\n- Heinz, B., Birk, S., Liedl, R., Geyer, T., Straub, K., Andresen, J., Bester, K., Kappler, A., 2009. Water quality deterioration at a karst spring (gal- lusquelle, germany) due to combined sewer overflow: evidence of bacterial and micro-pollutant contamination. Environmental Geology 57, 797-808.\n\n- Jozić, S., Lušić, D.V., Ordulj, M., Frlan, E., Cenov, A., Diković, S., Kau- zlarić, V., Ðurković, L.F., Totić, J.S., Ivšinović, D., et al., 2018. Perfor- mance characteristics of the temperature-modified iso 9308-1 method for the enumeration of escherichia coli in marine and inland bathing waters. Marine pollution bulletin 135, 150-158.\n\n- Jozić, S., Vukić Lušić, D., 2018. Report on validation of temperature modified iso 9308-1: 2014 method for the enumeration of escherichia coli in bathing water samples in croatia. Institute of Oceanography and Fisheries: Croatia, Balkan .\n\n- Kelsey, H., Porter, D., Scott, G., Neet, M., White, D., 2004. Using geo- graphic information systems and regression analysis to evaluate relation- ships between land use and fecal coliform bacterial pollution. Journal of experimental marine biology and ecology 298, 197-209.\n\n- Knierim, K.J., Hays, P.D., Bowman, D., 2015. Quantifying the variability in escherichia coli (e. coli) throughout storm events at a karst spring in northwestern arkansas, united states. Environmental earth sciences 74, 4607-4623.\n\n- Kogovšek, J., Petrič, M., 2013. Increase of vulnerability of karst aquifers due to leakage from landfills. Environmental earth sciences 70, 901-912.\n\n- Kucuksezgin, F., Gonul, L.T., Pazi, I., Kacar, A., 2019. Assessment of sea- sonal and spatial variation of surface water quality: Recognition of en- vironmental variables and fecal indicator bacteria of the coastal zones of izmir bay, eastern aegean. Regional Studies in Marine Science 28, 100554.\n\n- Laroche, E., Petit, F., Fournier, M., Pawlak, B., 2010. Transport of antibiotic-resistant escherichia coli in a public rural karst water supply. Journal of Hydrology 392, 12-21.\n\n- Lipp, E.K., Kurz, R., Vincent, R., Rodriguez-Palacios, C., Farrah, S.R., Rose, J.B., 2001. The effects of seasonal variability and weather on micro- bial fecal pollution and enteric pathogens in a subtropical estuary. Estu- aries 24, 266-276.\n\n- Mallin, M.A., Ensign, S.H., McIver, M.R., Shank, G.C., Fowler, P.K., 2001. Demographic, landscape, and meteorological factors controlling the micro- bial pollution of coastal waters, in: The Ecology and Etiology of Newly Emerging Marine Diseases. Springer, pp. 185-193.\n\n- Mance, D., Mance, D., Vukić Lušić, D., 2018. Environmental isotope\\(ˆ18 o\\) in coastal karst spring waters as a possible predictor of marine microbial pollution. Acta Adriatica: international journal of Marine Sciences 59, 3- 15.\n\n- Maraccini, P.A., Mattioli, M.C.M., Sassoubre, L.M., Cao, Y., Griffith, J.F., Ervin, J.S., Van De Werfhorst, L.C., Boehm, A.B., 2016. Solar inactiva- tion of enterococci and escherichia coli in natural waters: effects of water absorbance and depth. Environmental science & technology 50, 5068-5076.\n\n- Pandey, P.K., Soupir, M.L., Haddad, M., Rothwell, J.J., 2012. Assessing the impacts of watershed indexes and precipitation on spatial in-stream e. coli concentrations. Ecological indicators 23, 641-652.\n\n- Pedregosa, F., Varoquaux, G., Gramfort, A., Michel, V., Thirion, B., Grisel, O., Blondel, M., Prettenhofer, P., Weiss, R., Dubourg, V., et al., 2011. Scikit-learn: Machine learning in python. Journal of machine learning research 12, 2825-2830.\n\n- Pikelj, K., Juračić, M., 2013. Eastern adriatic coast (eac): geomorphology and coastal vulnerability of a karstic coast. Journal of coastal research 29, 944-957.\n\n- Reed, T.M., Fryar, A.E., Brion, G.M., Ward, J.W., 2011. Differences in pathogen indicators between proximal urban and rural karst springs, cen- tral kentucky, usa. Environmental Earth Sciences 64, 47-55.\n\n- Rukavina, T., 2007. Važnost monitoringa mikrobioloških indikatora u vo- dama priobalnih izvora. Zbornik radova 4. hrvatske konferencije o vodama Hrvatske vode i Europska Unija-izazovi i mogućnosti , 217-222.\n\n- Solcast, 2021. Solar irradiance data. URL: https://solcast.com. accessed: 2020-12-01.\n\n- Solo-Gabriele, H.M., Harwood, V.J., Kay, D., Fujioka, R.S., Sadowsky, M.J., Whitman, R.L., Wither, A., Caniça, M., Da Fonseca, R.C., Duarte, A., et al., 2016. Beach sand and the potential for infectious disease transmis- sion: observations and recommendations. Journal of the Marine Biological Association of the United Kingdom 96, 101-120.\n\n- de Souza, R.V., Campos, C.J., Garbossa, L.H., Seiffert, W.Q., 2018a. De- veloping, cross-validating and applying regression models to predict the concentrations of faecal indicator organisms in coastal waters under dif- ferent environmental scenarios. Science of The Total Environment 630, 20-31.\n\n- Souza, R.V., de Campos, C.J.A., Garbossa, L.H.P., de Novaes Vianna, L.F., Seiffert, W.Q., 2018b. Optimising statistical models to predict faecal pollution in coastal areas based on geographic and meteorological param- eters. Marine pollution bulletin 129, 284-292.\n\n- Stange, C., Tiehm, A., 2020. Occurrence of antibiotic resistance genes and microbial source tracking markers in the water of a karst spring in germany. Science of The Total Environment 742, 140529.\n\n- Stražičić, N., 1999. Riječki izvori i vodotoci. Izdavački centar Rijeka, Rijeka.\n\n- Verga, R.N., Tolosano, J.A., Cazzaniga, N.J., Gil, D.G., 2020. Assessment of seawater quality and bacteriological pollution of rocky shores in the central coast of san jorge gulf (patagonia, argentina). Marine pollution bulletin 150, 110749.\n\n- Viau, E.J., Goodwin, K.D., Yamahara, K.M., Layton, B.A., Sassoubre, L.M., Burns, S.L., Tong, H.I., Wong, S.H., Lu, Y., Boehm, A.B., 2011. Bacterial pathogens in hawaiian coastal streams-associations with fecal indicators, land cover, and water quality. Water research 45, 3279-3290.\n\n- Vukić Lušić, D., Kranjčević, L., Maćešić, S., Lušić, D., Jozić, S., Linšak, Ž., Bilajac, L., Grbčić, L., Bilajac, N., 2017. Temporal variations analyses and predictive modeling of microbiological seawater quality. Water research 119, 160-170.\n\n- Weiskerger, C.J., Phanikumar, M.S., 2020. Numerical modeling of microbial fate and transport in natural waters: Review and implications for normal and extreme storm events. Water 12, 1876.\n\n- Whitman, R.L., Nevers, M.B., Korinek, G.C., Byappanahalli, M.N., 2004. Solar and temporal effects on escherichia coli concentration at a lake michi- gan swimming beach. Applied and environmental microbiology 70, 4276- 4285.\n\n- Zaninović, K., Gajić-Čapka, M., Perčec Tadić, M., Vučetić, M., Milković, J., Bajić, A., Cindrić, K., Cvitan, L., Katušin, Z., Kaučić, D., et al., 2008. Klimatski atlas hrvatske. Državni hidrometeorološki zavod, Zagreb 172.\n\n", "annotations": {"ReferenceToTable": [{"begin": 12701, "end": 12702, "target": "#tab_0", "idx": 0}, {"begin": 16453, "end": 16454, "target": "#tab_2", "idx": 1}, {"begin": 18259, "end": 18260, "target": "#tab_3", "idx": 2}, {"begin": 19625, "end": 19626, "target": "#tab_6", "idx": 3}, {"begin": 19982, "end": 19983, "target": "#tab_7", "idx": 4}, {"begin": 20963, "end": 20964, "target": "#tab_9", "idx": 5}, {"begin": 21507, "end": 21509, "target": "#tab_10", "idx": 6}], "SectionMain": [{"begin": 801, "end": 35660, "idx": 0}], "ReferenceToFormula": [{"begin": 9309, "end": 9313, "idx": 0}], "SectionReference": [{"begin": 35674, "end": 46091, "idx": 0}], "SectionHeader": [{"begin": 0, "end": 801, "idx": 0}], "Div": [{"begin": 118, "end": 793, "idx": 0}, {"begin": 804, "end": 4822, "idx": 1}, {"begin": 4824, "end": 4849, "idx": 2}, {"begin": 4851, "end": 7688, "idx": 3}, {"begin": 7690, "end": 8885, "idx": 4}, {"begin": 8887, "end": 13075, "idx": 5}, {"begin": 13077, "end": 14797, "idx": 6}, {"begin": 14799, "end": 16205, "idx": 7}, {"begin": 16207, "end": 16218, "idx": 8}, {"begin": 16220, "end": 18756, "idx": 9}, {"begin": 18758, "end": 19445, "idx": 10}, {"begin": 19447, "end": 21592, "idx": 11}, {"begin": 21594, "end": 21608, "idx": 12}, {"begin": 21610, "end": 24437, "idx": 13}, {"begin": 24439, "end": 28133, "idx": 14}, {"begin": 28135, "end": 32406, "idx": 15}, {"begin": 32408, "end": 34969, "idx": 16}, {"begin": 34971, "end": 35660, "idx": 17}], "Head": [{"begin": 804, "end": 819, "n": "1.", "idx": 0}, {"begin": 4824, "end": 4848, "n": "2.", "idx": 1}, {"begin": 4851, "end": 4871, "n": "2.1.", "idx": 2}, {"begin": 7690, "end": 7719, "n": "2.2.", "idx": 3}, {"begin": 8887, "end": 8921, "n": "2.3.", "idx": 4}, {"begin": 13077, "end": 13106, "n": "2.4.", "idx": 5}, {"begin": 14799, "end": 14846, "n": "2.5.", "idx": 6}, {"begin": 16207, "end": 16217, "n": "3.", "idx": 7}, {"begin": 16220, "end": 16271, "n": "3.1.", "idx": 8}, {"begin": 18758, "end": 18805, "n": "3.2.", "idx": 9}, {"begin": 19447, "end": 19473, "n": "3.4.", "idx": 10}, {"begin": 21594, "end": 21607, "n": "4.", "idx": 11}, {"begin": 21610, "end": 21634, "n": "4.1.", "idx": 12}, {"begin": 24439, "end": 24457, "n": "4.2.", "idx": 13}, {"begin": 28135, "end": 28156, "n": "4.3.", "idx": 14}, {"begin": 32408, "end": 32421, "n": "5.", "idx": 15}, {"begin": 34971, "end": 34990, "n": "6.", "idx": 16}], "Paragraph": [{"begin": 118, "end": 793, "idx": 0}, {"begin": 820, "end": 1430, "idx": 1}, {"begin": 1431, "end": 2485, "idx": 2}, {"begin": 2486, "end": 3339, "idx": 3}, {"begin": 3340, "end": 4822, "idx": 4}, {"begin": 4872, "end": 5094, "idx": 5}, {"begin": 5095, "end": 5987, "idx": 6}, {"begin": 5988, "end": 6357, "idx": 7}, {"begin": 6358, "end": 7688, "idx": 8}, {"begin": 7720, "end": 8010, "idx": 9}, {"begin": 8011, "end": 8885, "idx": 10}, {"begin": 8922, "end": 10703, "idx": 11}, {"begin": 10704, "end": 12020, "idx": 12}, {"begin": 12021, "end": 12541, "idx": 13}, {"begin": 12542, "end": 13075, "idx": 14}, {"begin": 13107, "end": 13704, "idx": 15}, {"begin": 13705, "end": 13829, "idx": 16}, {"begin": 13830, "end": 14292, "idx": 17}, {"begin": 14293, "end": 14578, "idx": 18}, {"begin": 14579, "end": 14797, "idx": 19}, {"begin": 14847, "end": 15647, "idx": 20}, {"begin": 15649, "end": 15861, "idx": 21}, {"begin": 15862, "end": 16205, "idx": 22}, {"begin": 16272, "end": 18431, "idx": 23}, {"begin": 18432, "end": 18756, "idx": 24}, {"begin": 18806, "end": 19098, "idx": 25}, {"begin": 19099, "end": 19445, "idx": 26}, {"begin": 19474, "end": 19875, "idx": 27}, {"begin": 19876, "end": 20602, "idx": 28}, {"begin": 20603, "end": 20908, "idx": 29}, {"begin": 20909, "end": 21369, "idx": 30}, {"begin": 21370, "end": 21592, "idx": 31}, {"begin": 21635, "end": 22305, "idx": 32}, {"begin": 22306, "end": 22654, "idx": 33}, {"begin": 22655, "end": 23557, "idx": 34}, {"begin": 23558, "end": 23749, "idx": 35}, {"begin": 23750, "end": 24118, "idx": 36}, {"begin": 24119, "end": 24437, "idx": 37}, {"begin": 24458, "end": 25386, "idx": 38}, {"begin": 25387, "end": 26576, "idx": 39}, {"begin": 26577, "end": 27499, "idx": 40}, {"begin": 27500, "end": 28133, "idx": 41}, {"begin": 28157, "end": 28698, "idx": 42}, {"begin": 28699, "end": 29358, "idx": 43}, {"begin": 29359, "end": 31224, "idx": 44}, {"begin": 31225, "end": 32406, "idx": 45}, {"begin": 32422, "end": 33207, "idx": 46}, {"begin": 33208, "end": 33354, "idx": 47}, {"begin": 33355, "end": 33496, "idx": 48}, {"begin": 33497, "end": 33691, "idx": 49}, {"begin": 33692, "end": 33860, "idx": 50}, {"begin": 33861, "end": 34052, "idx": 51}, {"begin": 34053, "end": 34586, "idx": 52}, {"begin": 34587, "end": 34699, "idx": 53}, {"begin": 34700, "end": 34811, "idx": 54}, {"begin": 34812, "end": 34969, "idx": 55}, {"begin": 34991, "end": 35502, "idx": 56}, {"begin": 35503, "end": 35573, "idx": 57}, {"begin": 35574, "end": 35660, "idx": 58}], "ReferenceToBib": [{"begin": 1007, "end": 1035, "target": "#b35", "idx": 0}, {"begin": 1657, "end": 1680, "target": "#b12", "idx": 1}, {"begin": 1681, "end": 1706, "target": "#b42", "idx": 2}, {"begin": 2006, "end": 2028, "target": "#b6", "idx": 3}, {"begin": 2720, "end": 2746, "target": "#b31", "idx": 4}, {"begin": 2829, "end": 2849, "target": "#b8", "idx": 5}, {"begin": 2850, "end": 2871, "target": "#b24", "idx": 6}, {"begin": 2932, "end": 2959, "target": "#b22", "idx": 7}, {"begin": 2977, "end": 2997, "target": "#b17", "idx": 8}, {"begin": 2998, "end": 3021, "target": "#b38", "idx": 9}, {"begin": 3059, "end": 3078, "target": "#b32", "idx": 10}, {"begin": 3079, "end": 3104, "target": "#b5", "idx": 11}, {"begin": 3519, "end": 3535, "target": "#b15", "idx": 12}, {"begin": 3691, "end": 3714, "target": "#b37", "idx": 13}, {"begin": 3719, "end": 3742, "target": "#b36", "idx": 14}, {"begin": 3972, "end": 3988, "target": "#b16", "idx": 15}, {"begin": 4127, "end": 4147, "target": "#b14", "idx": 16}, {"begin": 4417, "end": 4443, "target": "#b42", "idx": 17}, {"begin": 5470, "end": 5494, "target": "#b45", "idx": 18}, {"begin": 7163, "end": 7229, "idx": 19}, {"begin": 7296, "end": 7325, "target": "#b19", "idx": 20}, {"begin": 7326, "end": 7345, "idx": 21}, {"begin": 7414, "end": 7433, "target": "#b42", "idx": 22}, {"begin": 8042, "end": 8056, "target": "#b34", "idx": 23}, {"begin": 8395, "end": 8412, "target": "#b16", "idx": 24}, {"begin": 8413, "end": 8445, "target": "#b43", "idx": 25}, {"begin": 9204, "end": 9214, "target": "#b11", "idx": 26}, {"begin": 9377, "end": 9394, "target": "#b9", "idx": 27}, {"begin": 13780, "end": 13804, "target": "#b30", "idx": 28}, {"begin": 13933, "end": 13947, "target": "#b4", "idx": 29}, {"begin": 16740, "end": 16762, "target": "#b44", "idx": 30}, {"begin": 16763, "end": 16783, "target": "#b1", "idx": 31}, {"begin": 16784, "end": 16807, "target": "#b28", "idx": 32}, {"begin": 26131, "end": 26147, "target": "#b39", "idx": 33}, {"begin": 27277, "end": 27298, "target": "#b2", "idx": 34}, {"begin": 28520, "end": 28536, "target": "#b39", "idx": 35}, {"begin": 29594, "end": 29615, "target": "#b26", "idx": 36}, {"begin": 29626, "end": 29647, "target": "#b20", "idx": 37}, {"begin": 29656, "end": 29675, "target": "#b25", "idx": 38}, {"begin": 29690, "end": 29714, "target": "#b37", "idx": 39}, {"begin": 29732, "end": 29753, "target": "#b29", "idx": 40}, {"begin": 30389, "end": 30410, "target": "#b3", "idx": 41}, {"begin": 31751, "end": 31766, "target": "#b33", "idx": 42}], "Sentence": [{"begin": 118, "end": 267, "idx": 0}, {"begin": 268, "end": 402, "idx": 1}, {"begin": 403, "end": 543, "idx": 2}, {"begin": 544, "end": 782, "idx": 3}, {"begin": 783, "end": 793, "idx": 4}, {"begin": 820, "end": 1036, "idx": 5}, {"begin": 1037, "end": 1257, "idx": 6}, {"begin": 1258, "end": 1430, "idx": 7}, {"begin": 1431, "end": 1536, "idx": 8}, {"begin": 1537, "end": 1707, "idx": 9}, {"begin": 1708, "end": 1865, "idx": 10}, {"begin": 1866, "end": 2004, "idx": 11}, {"begin": 2005, "end": 2122, "idx": 12}, {"begin": 2123, "end": 2368, "idx": 13}, {"begin": 2369, "end": 2485, "idx": 14}, {"begin": 2486, "end": 2747, "idx": 15}, {"begin": 2748, "end": 2872, "idx": 16}, {"begin": 2873, "end": 3110, "idx": 17}, {"begin": 3111, "end": 3339, "idx": 18}, {"begin": 3340, "end": 3517, "idx": 19}, {"begin": 3518, "end": 3687, "idx": 20}, {"begin": 3688, "end": 3970, "idx": 21}, {"begin": 3971, "end": 4125, "idx": 22}, {"begin": 4126, "end": 4262, "idx": 23}, {"begin": 4263, "end": 4395, "idx": 24}, {"begin": 4396, "end": 4569, "idx": 25}, {"begin": 4570, "end": 4722, "idx": 26}, {"begin": 4723, "end": 4822, "idx": 27}, {"begin": 4872, "end": 5094, "idx": 28}, {"begin": 5095, "end": 5267, "idx": 29}, {"begin": 5268, "end": 5393, "idx": 30}, {"begin": 5394, "end": 5495, "idx": 31}, {"begin": 5496, "end": 5641, "idx": 32}, {"begin": 5642, "end": 5803, "idx": 33}, {"begin": 5804, "end": 5868, "idx": 34}, {"begin": 5869, "end": 5987, "idx": 35}, {"begin": 5988, "end": 6042, "idx": 36}, {"begin": 6043, "end": 6134, "idx": 37}, {"begin": 6135, "end": 6261, "idx": 38}, {"begin": 6262, "end": 6357, "idx": 39}, {"begin": 6358, "end": 6515, "idx": 40}, {"begin": 6516, "end": 6703, "idx": 41}, {"begin": 6704, "end": 6782, "idx": 42}, {"begin": 6783, "end": 6929, "idx": 43}, {"begin": 6930, "end": 7114, "idx": 44}, {"begin": 7115, "end": 7346, "idx": 45}, {"begin": 7347, "end": 7434, "idx": 46}, {"begin": 7435, "end": 7487, "idx": 47}, {"begin": 7488, "end": 7688, "idx": 48}, {"begin": 7720, "end": 7865, "idx": 49}, {"begin": 7866, "end": 8010, "idx": 50}, {"begin": 8011, "end": 8066, "idx": 51}, {"begin": 8067, "end": 8163, "idx": 52}, {"begin": 8164, "end": 8446, "idx": 53}, {"begin": 8447, "end": 8748, "idx": 54}, {"begin": 8749, "end": 8885, "idx": 55}, {"begin": 8922, "end": 9188, "idx": 56}, {"begin": 9189, "end": 9414, "idx": 57}, {"begin": 9415, "end": 9505, "idx": 58}, {"begin": 9506, "end": 9876, "idx": 59}, {"begin": 9877, "end": 10165, "idx": 60}, {"begin": 10166, "end": 10340, "idx": 61}, {"begin": 10341, "end": 10446, "idx": 62}, {"begin": 10447, "end": 10577, "idx": 63}, {"begin": 10578, "end": 10633, "idx": 64}, {"begin": 10634, "end": 10703, "idx": 65}, {"begin": 10704, "end": 10809, "idx": 66}, {"begin": 10810, "end": 10905, "idx": 67}, {"begin": 10906, "end": 10990, "idx": 68}, {"begin": 10991, "end": 11164, "idx": 69}, {"begin": 11165, "end": 11268, "idx": 70}, {"begin": 11269, "end": 11461, "idx": 71}, {"begin": 11462, "end": 11744, "idx": 72}, {"begin": 11745, "end": 12020, "idx": 73}, {"begin": 12021, "end": 12274, "idx": 74}, {"begin": 12275, "end": 12361, "idx": 75}, {"begin": 12362, "end": 12541, "idx": 76}, {"begin": 12542, "end": 12703, "idx": 77}, {"begin": 12704, "end": 12808, "idx": 78}, {"begin": 12809, "end": 13016, "idx": 79}, {"begin": 13017, "end": 13075, "idx": 80}, {"begin": 13107, "end": 13273, "idx": 81}, {"begin": 13274, "end": 13558, "idx": 82}, {"begin": 13559, "end": 13704, "idx": 83}, {"begin": 13705, "end": 13829, "idx": 84}, {"begin": 13830, "end": 13948, "idx": 85}, {"begin": 13949, "end": 14033, "idx": 86}, {"begin": 14034, "end": 14292, "idx": 87}, {"begin": 14293, "end": 14528, "idx": 88}, {"begin": 14529, "end": 14578, "idx": 89}, {"begin": 14579, "end": 14797, "idx": 90}, {"begin": 14847, "end": 14941, "idx": 91}, {"begin": 14942, "end": 15082, "idx": 92}, {"begin": 15083, "end": 15154, "idx": 93}, {"begin": 15155, "end": 15408, "idx": 94}, {"begin": 15409, "end": 15578, "idx": 95}, {"begin": 15579, "end": 15647, "idx": 96}, {"begin": 15649, "end": 15861, "idx": 97}, {"begin": 15862, "end": 15968, "idx": 98}, {"begin": 15969, "end": 16076, "idx": 99}, {"begin": 16077, "end": 16205, "idx": 100}, {"begin": 16272, "end": 16808, "idx": 101}, {"begin": 16809, "end": 16979, "idx": 102}, {"begin": 16980, "end": 17229, "idx": 103}, {"begin": 17230, "end": 17447, "idx": 104}, {"begin": 17448, "end": 17575, "idx": 105}, {"begin": 17576, "end": 17614, "idx": 106}, {"begin": 17615, "end": 17821, "idx": 107}, {"begin": 17822, "end": 18049, "idx": 108}, {"begin": 18050, "end": 18153, "idx": 109}, {"begin": 18154, "end": 18262, "idx": 110}, {"begin": 18263, "end": 18431, "idx": 111}, {"begin": 18432, "end": 18756, "idx": 112}, {"begin": 18806, "end": 19098, "idx": 113}, {"begin": 19099, "end": 19445, "idx": 114}, {"begin": 19474, "end": 19560, "idx": 115}, {"begin": 19561, "end": 19627, "idx": 116}, {"begin": 19628, "end": 19725, "idx": 117}, {"begin": 19726, "end": 19875, "idx": 118}, {"begin": 19876, "end": 19984, "idx": 119}, {"begin": 19985, "end": 20218, "idx": 120}, {"begin": 20219, "end": 20359, "idx": 121}, {"begin": 20360, "end": 20496, "idx": 122}, {"begin": 20497, "end": 20602, "idx": 123}, {"begin": 20603, "end": 20695, "idx": 124}, {"begin": 20696, "end": 20854, "idx": 125}, {"begin": 20855, "end": 20908, "idx": 126}, {"begin": 20909, "end": 20965, "idx": 127}, {"begin": 20966, "end": 21138, "idx": 128}, {"begin": 21139, "end": 21296, "idx": 129}, {"begin": 21297, "end": 21369, "idx": 130}, {"begin": 21370, "end": 21510, "idx": 131}, {"begin": 21511, "end": 21592, "idx": 132}, {"begin": 21635, "end": 21864, "idx": 133}, {"begin": 21865, "end": 21994, "idx": 134}, {"begin": 21995, "end": 22164, "idx": 135}, {"begin": 22165, "end": 22305, "idx": 136}, {"begin": 22306, "end": 22396, "idx": 137}, {"begin": 22397, "end": 22654, "idx": 138}, {"begin": 22655, "end": 22809, "idx": 139}, {"begin": 22810, "end": 22894, "idx": 140}, {"begin": 22895, "end": 23013, "idx": 141}, {"begin": 23014, "end": 23305, "idx": 142}, {"begin": 23306, "end": 23420, "idx": 143}, {"begin": 23421, "end": 23557, "idx": 144}, {"begin": 23558, "end": 23631, "idx": 145}, {"begin": 23632, "end": 23749, "idx": 146}, {"begin": 23750, "end": 23926, "idx": 147}, {"begin": 23927, "end": 24118, "idx": 148}, {"begin": 24119, "end": 24271, "idx": 149}, {"begin": 24272, "end": 24437, "idx": 150}, {"begin": 24458, "end": 24592, "idx": 151}, {"begin": 24593, "end": 24708, "idx": 152}, {"begin": 24709, "end": 24987, "idx": 153}, {"begin": 24988, "end": 25188, "idx": 154}, {"begin": 25189, "end": 25386, "idx": 155}, {"begin": 25387, "end": 25481, "idx": 156}, {"begin": 25482, "end": 25658, "idx": 157}, {"begin": 25659, "end": 25849, "idx": 158}, {"begin": 25850, "end": 26076, "idx": 159}, {"begin": 26077, "end": 26251, "idx": 160}, {"begin": 26252, "end": 26457, "idx": 161}, {"begin": 26458, "end": 26576, "idx": 162}, {"begin": 26577, "end": 26707, "idx": 163}, {"begin": 26708, "end": 26713, "idx": 164}, {"begin": 26714, "end": 26880, "idx": 165}, {"begin": 26881, "end": 27099, "idx": 166}, {"begin": 27100, "end": 27246, "idx": 167}, {"begin": 27247, "end": 27499, "idx": 168}, {"begin": 27500, "end": 27867, "idx": 169}, {"begin": 27868, "end": 28073, "idx": 170}, {"begin": 28074, "end": 28133, "idx": 171}, {"begin": 28157, "end": 28290, "idx": 172}, {"begin": 28291, "end": 28401, "idx": 173}, {"begin": 28402, "end": 28477, "idx": 174}, {"begin": 28478, "end": 28698, "idx": 175}, {"begin": 28699, "end": 28901, "idx": 176}, {"begin": 28902, "end": 29056, "idx": 177}, {"begin": 29057, "end": 29209, "idx": 178}, {"begin": 29210, "end": 29358, "idx": 179}, {"begin": 29359, "end": 29473, "idx": 180}, {"begin": 29474, "end": 29575, "idx": 181}, {"begin": 29576, "end": 29754, "idx": 182}, {"begin": 29755, "end": 29842, "idx": 183}, {"begin": 29843, "end": 29999, "idx": 184}, {"begin": 30000, "end": 30101, "idx": 185}, {"begin": 30102, "end": 30242, "idx": 186}, {"begin": 30243, "end": 30344, "idx": 187}, {"begin": 30345, "end": 30663, "idx": 188}, {"begin": 30664, "end": 30932, "idx": 189}, {"begin": 30933, "end": 31224, "idx": 190}, {"begin": 31225, "end": 31331, "idx": 191}, {"begin": 31332, "end": 31733, "idx": 192}, {"begin": 31734, "end": 31962, "idx": 193}, {"begin": 31963, "end": 32174, "idx": 194}, {"begin": 32175, "end": 32406, "idx": 195}, {"begin": 32422, "end": 32589, "idx": 196}, {"begin": 32590, "end": 32822, "idx": 197}, {"begin": 32823, "end": 32968, "idx": 198}, {"begin": 32969, "end": 33136, "idx": 199}, {"begin": 33137, "end": 33207, "idx": 200}, {"begin": 33208, "end": 33354, "idx": 201}, {"begin": 33355, "end": 33496, "idx": 202}, {"begin": 33497, "end": 33691, "idx": 203}, {"begin": 33692, "end": 33860, "idx": 204}, {"begin": 33861, "end": 34052, "idx": 205}, {"begin": 34053, "end": 34149, "idx": 206}, {"begin": 34150, "end": 34349, "idx": 207}, {"begin": 34350, "end": 34527, "idx": 208}, {"begin": 34528, "end": 34586, "idx": 209}, {"begin": 34587, "end": 34699, "idx": 210}, {"begin": 34700, "end": 34811, "idx": 211}, {"begin": 34812, "end": 34969, "idx": 212}, {"begin": 34991, "end": 35163, "idx": 213}, {"begin": 35164, "end": 35182, "idx": 214}, {"begin": 35183, "end": 35315, "idx": 215}, {"begin": 35316, "end": 35502, "idx": 216}, {"begin": 35503, "end": 35573, "idx": 217}, {"begin": 35574, "end": 35660, "idx": 218}], "ReferenceToFigure": [{"begin": 5866, "end": 5867, "target": "#fig_1", "idx": 0}, {"begin": 6512, "end": 6513, "target": "#fig_1", "idx": 1}, {"begin": 10701, "end": 10702, "target": "#fig_2", "idx": 2}, {"begin": 17612, "end": 17613, "target": "#fig_4", "idx": 3}, {"begin": 25846, "end": 25847, "target": "#fig_5", "idx": 4}, {"begin": 26668, "end": 26669, "target": "#fig_6", "idx": 5}, {"begin": 27496, "end": 27497, "target": "#fig_6", "idx": 6}, {"begin": 29114, "end": 29115, "target": "#fig_5", "idx": 7}], "Abstract": [{"begin": 108, "end": 793, "idx": 0}], "SectionFootnote": [{"begin": 35662, "end": 35672, "idx": 0}], "ReferenceString": [{"begin": 35689, "end": 35868, "id": "b0", "idx": 0}, {"begin": 35870, "end": 36091, "id": "b1", "idx": 1}, {"begin": 36095, "end": 36345, "id": "b2", "idx": 2}, {"begin": 36349, "end": 36516, "id": "b3", "idx": 3}, {"begin": 36520, "end": 36581, "id": "b4", "idx": 4}, {"begin": 36585, "end": 36855, "id": "b5", "idx": 5}, {"begin": 36859, "end": 37163, "id": "b6", "idx": 6}, {"begin": 37167, "end": 37385, "id": "b7", "idx": 7}, {"begin": 37389, "end": 37608, "id": "b8", "idx": 8}, {"begin": 37612, "end": 37749, "id": "b9", "idx": 9}, {"begin": 37753, "end": 37973, "id": "b10", "idx": 10}, {"begin": 37977, "end": 38180, "id": "b11", "idx": 11}, {"begin": 38184, "end": 38349, "id": "b12", "idx": 12}, {"begin": 38353, "end": 38496, "id": "b13", "idx": 13}, {"begin": 38500, "end": 38787, "id": "b14", "idx": 14}, {"begin": 38791, "end": 38984, "id": "b15", "idx": 15}, {"begin": 38988, "end": 39264, "id": "b16", "idx": 16}, {"begin": 39268, "end": 39563, "id": "b17", "idx": 17}, {"begin": 39567, "end": 39905, "id": "b18", "idx": 18}, {"begin": 39909, "end": 40147, "id": "b19", "idx": 19}, {"begin": 40151, "end": 40425, "id": "b20", "idx": 20}, {"begin": 40429, "end": 40658, "id": "b21", "idx": 21}, {"begin": 40662, "end": 40810, "id": "b22", "idx": 22}, {"begin": 40814, "end": 41111, "id": "b23", "idx": 23}, {"begin": 41115, "end": 41292, "id": "b24", "idx": 24}, {"begin": 41296, "end": 41538, "id": "b25", "idx": 25}, {"begin": 41542, "end": 41811, "id": "b26", "idx": 26}, {"begin": 41815, "end": 42044, "id": "b27", "idx": 27}, {"begin": 42048, "end": 42345, "id": "b28", "idx": 28}, {"begin": 42349, "end": 42551, "id": "b29", "idx": 29}, {"begin": 42555, "end": 42798, "id": "b30", "idx": 30}, {"begin": 42802, "end": 42963, "id": "b31", "idx": 31}, {"begin": 42967, "end": 43170, "id": "b32", "idx": 32}, {"begin": 43174, "end": 43381, "id": "b33", "idx": 33}, {"begin": 43385, "end": 43470, "id": "b34", "idx": 34}, {"begin": 43474, "end": 43814, "id": "b35", "idx": 35}, {"begin": 43818, "end": 44114, "id": "b36", "idx": 36}, {"begin": 44118, "end": 44382, "id": "b37", "idx": 37}, {"begin": 44386, "end": 44583, "id": "b38", "idx": 38}, {"begin": 44587, "end": 44667, "id": "b39", "idx": 39}, {"begin": 44671, "end": 44912, "id": "b40", "idx": 40}, {"begin": 44916, "end": 45198, "id": "b41", "idx": 41}, {"begin": 45202, "end": 45444, "id": "b42", "idx": 42}, {"begin": 45448, "end": 45636, "id": "b43", "idx": 43}, {"begin": 45640, "end": 45863, "id": "b44", "idx": 44}, {"begin": 45867, "end": 46089, "id": "b45", "idx": 45}]}}