{"text": "ClassiNet -Predicting Missing Features for Short-Text Classification\n\nAbstract:\nShort and sparse texts such as tweets, search engine snippets, product reviews, chat messages are abundant on the Web. Classifying such shorttexts into a pre-defined set of categories is a common problem that arises in various contexts, such as sentiment classification, spam detection, and information recommendation. The fundamental problem in short-text classification is feature sparseness -the lack of feature overlap between a trained model and a test instance to be classified. We propose ClassiNet -a network of classifiers trained for predicting missing features in a given instance, to overcome the feature sparseness problem. Using a set of unlabeled training instances, we first learn binary classifiers as feature predictors for predicting whether a particular feature occurs in a given instance. Next, each feature predictor is represented as a vertex vi in the ClassiNet where a one-to-one correspondence exists between feature predictors and vertices. The weight of the directed edge eij connecting a vertex vi to a vertex vj represents the conditional probability that given vi exists in an instance, vj also exists in the same instance.\nWe show that ClassiNets generalize word co-occurrence graphs by considering implicit co-occurrences between features. We extract numerous features from the trained ClassiNet to overcome feature sparseness. In particular, for a given instance x, we find similar features from ClassiNet that did not appear in x, and append those features in the representation of x. Moreover, we propose a method based on graph propagation to find features that are indirectly related to a given short-text. We evaluate ClassiNets on several benchmark datasets for short-text classification. Our experimental results show that by using ClassiNet, we can statistically significantly improve the accuracy in short-text classification tasks, without having to use any external resources such as thesauri for finding related features.\n\nMain:\n\n\n\n1 Introduction\nShort-texts are abundant on the Web and appear in various different formats. For example, in Twitter, users are constrained to a 140 character upper limit when posting their tweets (Kwak et al., 2010). Even when there are no strict upper limits, users tend to provide brief answers in QA forums, review sites, SMS, email, and chat messages (Cong et al., 2008; Thelwall et al., 2010). Unlike lengthy responses that take time to both compose and to read, short responses have gained popularity particularly in social media contexts. Considering the steady growth of mobile devices that are physically restricted to compact keyboards, which are suboptimal for entering lengthy text inputs, it is safe to predict that the amount of short-texts will continue to grow in the future. Considering the importance and the quantity of the short-texts in various web-related tasks, such as text classification (dos Santos and Gatti, 2014; kun Wang et al., 2012), and event prediction (Sakaki et al., 2010), it is important to be able to accurately represent and classify short-texts.\nCompared to performing text mining on longer texts (Guan et al., 2009; Su et al., 2011; Yogatama and Smith, 2014), for which dense and diverse feature representations can be created relatively easily, handling of shorter texts poses several challenges. First, the number of features that are actually present in a short-text will be a small fraction of the set of all features that exist in all of the train instances. Although this feature sparseness is problematic even for longer texts, it is critical for shorter texts. In particular, when the diversity of the feature space increases as with longer n-gram lexical features, (a) the number of occurrences of a feature in a given instance (i.e., term frequency), as well as (b) the number of instances in which a particular feature occurs (i.e., document frequency), will be small. Therefore, it is difficult to reliably estimate the salience of a feature in a particular class in supervised learning tasks.\nSecond, the shorter length means that there is less redundancy in terms of the features that exist in a short-text. Consequently, most of the related words of a particular word might be missing in a short-text. For example, consider a review on iPhone 6 that says \"I liked the larger screen size of iPhone 6 compared to that of its predecessor \". Although iPhone 6 plus, a product similar to iPhone 6, has also a larger screen compared to its predecessors, this information is not included in this short review. On the other hand, we might observe such positive sentiments associated with iPhone 6 plus but not with iPhone 6 in other train instances, which will result in a high positive score for iPhone 6 plus in a classifier trained from those train reviews. Unfortunately, we will not be able to infer that this particular user would also likely be satisfied with iPhone 6 plus, thereby not recommending iPhone 6 plus for this user.\nTo overcome the above-mentioned challenges encountered when handling short-texts, we propose a feature expansion method analogous to the query expansion methods used in information retrieval (IR) (Salton and Buckley, 1983) to improve the agreement between search queries input by the users and documents indexed by the search engine (Carpineto and Romano, 2012). We assume short-texts are already represented using some feature vectors, which we refer to as instances in this paper. Lexical features such as unigrams or bigrams of words, part-of-speech (POS) tag sequences, and dependency relations have been frequently used in prior work on text classification. Our proposed method does not assume any particular type of features, and can be used with any discrete feature set. First, we train binary classifiers which we call feature predictors for predicting whether a particular feature v i occurs in a given instance x. For example, given the previously discussed short review, we would like to predict whether iPhone 6 plus is likely to occur in this review.\nThe training instances required to learn feature predictors are automatically selected from unlabeled texts. Specifically, given a feature v i , we select texts in which v i occurs as the positive training instances for learning a feature predictor for v i . On the other hand, negative training instances for learning the feature predictor for v i are randomly sampled from the unlabeled texts, where v i does not occur. Using those positive and negative training instances we learn a binary classifier to predict whether v i occurs in a given instance. Any binary classification algorithm, such as support vector machines, logistic regression, naive Bayes classifier etc. can be used for this purpose, and it is not limited to linear classifiers. We define ClassiNet as a directed weighted graph G(V, E, W) of feature predictors, where each vertex v i ∈ V corresponds to a feature predictor. The directed edge e ij ∈ E from v i to v j is assigned the weight 1 ≥ w ij ≥ 0, which is the conditional probability that given v i is predicted for a particular instance, v j is also predicted for the same instance.\nIt is noteworthy that we obtain both positive and negative instances for learning feature predictors from unlabeled data, and do not require any labeled data for the target task. For example, consider the case that we are creating a ClassiNet to find missing features in sentiment classification. In this case, the target task is sentiment classification. However, we do not require any labeled data for the target task such as sentiment annotated reviews when creating the ClassiNet that we are subsequently going to use for finding missing features. Therefore, the training of ClassiNets can be conducted in a purely unsupervised manner, without requiring any manually labeled data for the target task. Moreover, the decoupling of ClassiNet training from the target task enables us to use the same ClassiNet to expand feature vectors for different target tasks. As we discuss later in Section 3.4, ClassiNets can be seen as a generalized version of the word co-occurrence graphs that have been well-studied in the NLP community (Mihalcea and Radev, 2011). However, ClassiNets consider both explicit as well as implicit co-occurrences of words in some context, whereas word co-occurrence graphs are limited to explicit co-occurrences.\nGiven a ClassiNet created from unlabeled data as described above, we propose several strategies for finding related features for a given instance that do not occur in the original instance. Specifically, we compare both local feature expansion methods that consider the nearest neighbours of a particular feature in an instance (Section 4.1), as well as global feature expansion methods that propagate the features that exist in an instance over the entire set of vertices in ClassiNet (Section 4.2). We evaluate the performance of the proposed feature expansion methods on short-text classification benchmark datasets. Our experimental results show that the proposed global feature expansion method significantly outperforms several local feature expansion methods\" and several sentence-level embedding methods on multiple benchmark datasets proposed for evaluating short-text classification methods. Considering that (a) ClassiNets can be created using unlabeled data, (b) the same ClassiNet can be used in principle for predicting features for different target tasks, (c) arbitrary features could be used in the feature predictors, not limited to lexical features, we believe that ClassiNets can be applied to a broad-range of machine learning tasks, not limited to short-text classification.\nOur contributions in this paper can be summarised as follows:\n• We propose a method for learning a network of feature predictors that can predict missing features in feature vectors. The proposed network, which we refer to as the ClassiNet, can be learnt in an unsupervised manner, without requiring any labeled data for the target task in which we are going to apply the ClassiNet to expand features (Section 3.2).\n• We propose an efficient method to learn ClassiNets from large datasets. Specifically, we show that the edge-weights of ClassiNets can be computed efficiently using locality sensitive hashing (Section 3.3).\n• Having proposed ClassiNets, we describe its relationship to word co-occurrence graphs that have a long history in the NLP community. We show that ClassiNets can be considered as a generalised version of word co-occurrence graphs (Section 3.4).\n• We propose several methods for finding related features for a given instance using the created ClassiNet. In particular, we consider both local methods (Section 4.1) that consider the nearest neighbours in ClassiNet of the features that exist in an instance, as well as global methods (Section 4.2) that consider all vertices in the ClassiNet.\n\n2 Related Work\nFeature sparseness is a common problem that is encountered in various text mining tasks. Two main approaches for overcoming the feature sparseness problem in short-texts can be identified in the literature: (a) embedding the train/test instances in a dense, lower-dimensional feature space thereby reducing the number of zero-valued features in the instances, and (b) predicting the values of the missing features. Next, we discuss prior work that belong to each of those two approaches.\nAn effective technique frequently used in prior work on short-texts to overcome the feature sparseness problem is to represent the texts in some lowerdimensional dense space, thereby reducing the feature sparseness. Several methods have been used to obtain such lower-dimensional representations such as topic-models (kun Wang et al., 2012; Yan et al., 2013; Yang et al., 2015), clustering (Dai et al., 2013; Rangrej et al., 2011), and dimensionality reduction (Blitzer et al., 2006; Pan et al., 2010).  Wang et al. (kun Wang et al., 2012) used latent dirichlet allocation (LDA) to identify features that are useful for identifying a particular class. Higher weights are assigned to the identified features, thereby increasing their contribution towards the classification decision. However, applying LDA at sentence-level is problematic because the number of words in a sentence is much smaller than that in a document. Consequently, Yan et al. (Yan et al., 2013) proposed the bi-term topic model that models the co-occurrence patterns between words accumulated over the entire corpus. An alternative solution that uses an external knowledge-base in the form of a phrase list is propsed by Yang et al. (Yang et al., 2015) to overcome the feature sparseness problem when learning topics from short-texts. The phrase list is automatically extracted from the entire collection of short-texts in a pre-processing step.\nCluster-based methods have been proposed for representing documents to overcome the feature sparseness problem. First, some clustering algorithm is used to cluster the documents into a group of clusters. Next, each document is represented by the clusters to which it belongs.  Dai et al. (Dai et al., 2013) used a hierarchical clustering algorithm with purity control to generate a set of clusters, and use the similarity between a document and each of the clusters as augmented features to enrich the document representation. Their method significantly improves the classification accuracy for short web snippets in a support vector machine classifier. Feature mismatch is a fundamental problem in domain adaptation, where we must learn a classifier using labeled data from a source domain and apply it to predict labels for the test instances in a different target domain.  Pan et al. (Pan et al., 2010) proposed Spectral Feature Alignment (SFA), a method to overcome the feature mismatch problem in cross-domain sentiment classification. They created a bi-partite graph between domain-specific and domain-independent features, and then used a spectral clustering method to obtain a domain-independent lower-dimensional embedding.\nIn structural correspondence learning (SCL) (Blitzer et al., 2007 (Blitzer et al., , 2006)), a set of features that are common to both source and the target domains, referred to as pivots, is identified using mutual information with the sentiment label. Next, linear classifiers that can predict those pivots are learnt from unlabeled reviews. The weight vectors corresponding to the learnt linear classifiers are arranged as rows in a matrix, on which subsequently singular value decomposition is applied to compute a lower-dimensional projection. Feature vectors representing train source reviews are projected into this lower-dimensional space, in which a binary sentiment classifier is trained. During test time, feature vectors representing test target reviews are also projected to the same lower-dimensional space and the trained binary classifier is used to predict the sentiment labels. However, domain adaptation methods such as SCL and SFA require data from at least two (source vs. target) different domains (e.g. reviews on products in different categories) to overcome the missing feature problem, whereas in this work we assume the availability of data from one domain only.\nInstead of representing documents using lexical features, which often results in high-dimensional and sparse feature vectors, by embedding documents in low-dimensional dense spaces we can effectively overcome the feature sparseness problem (dos Santos and Gatti, 2014; Le and Mikolov, 2014; Lu and Li, 2013). These methods jointly learn character-level or word-level embeddings as well as document-level embeddings (Hill et al., 2016a; Kiros et al., 2015) such that the learnt embeddings capture the similarity constraints satisfied by a collection of short-texts. First, each word in the vocabulary is assigned a fixed dimensional word vector. We can initialize the word vectors randomly or using pre-trained word representations. Next, the word vectors are updated such that we can accurately predict the co-occurrences of words in some context, such as a window of tokens, a sentence, a paragraph, or a document. Different loss functions encoding different co-occurrence measures have been proposed for this purpose (Mikolov et al., 2013; Pennington et al., 2014). As shown later in Section 6.2, ClassiNets perform competitively against sentence-level embedding methods on several short-text classification tasks.\nA single word can have multiple senses. For example, the word bank could mean a financial institution or a river bank. Therefore, it is inadequate to represent different senses of a word using a single embedding (Camacho-Collados et al., 2015; Hu et al., 2016; Iacobacci et al., 2015a; Johansson and Nieto Piña, 2015; Li and Jurafsky, 2015; Reisinger and Mooney, 2010; Song et al., 2016). Several solutions have been proposed in the literature to overcome this limitation and learn sense embeddings, which capture the sense related information of words. For example, Reisinger and Mooney (2010) proposed a method for learning sense-specific high dimensional distributional vector representations of words, which was later extended by Huang et al. (2012) using global and local context to learn multiple sense embeddings for an ambiguous word.  Neelakantan et al. (2014) proposed a multi sense skip-gram (MSSG), an online cluster-based sense-specific word representations learning method, by extending Skip-Gram with Negative Sampling (SGNG) (Mikolov et al., 2013). Unlike SGNG, which updates the gradient of the word vector according to the context, MSSG predicts the nearest sense first, and then updates the gradient of the sense vector.\nAforementioned methods apply a form of word sense discrimination by clustering a word contexts, before learning sense-specific word embeddings based on the induced clusters to learn a fixed number of sense embeddings for each word. In contrast, a nonparametric version of MSSG (NP-MSSG) (Neelakantan et al., 2014) estimates the number of senses per word and learn the corresponding sense embeddings. On the other hand, Iacobacci et al. (2015b) used a Word Sense Disambiguation (WSD) tool to sense annotate a large text corpus and then used an existing prediction-based word embeddings learning method to learn sense and word embeddings with the help of sense information obtained from the Babel-Net (Iacobacci et al., 2015b) sense inventory. Similarly, Camacho-Collados et al. (2015) used the knowledge in two different lexical resources: WordNet (Miller, 1995) and Wikipedia. They use the contextual information of a particular concept from Wikipedia and WordNet synsets prior to learning two separate vector representations for each concept.\nA single word can be related to multiple different topics, without necessarily corresponding to different senses of the word. Revisiting our previous example, we might have a collection of documents about retail banks, commercial banks, investment banks and central banks. All these different banks are related to the financial sense of the word bank. However, in a particular task (eg. classifying documents related to the different types of financial banks), we might require different embeddings for the different topics in which the word bank appears.  Liu et al. (2015a) proposed three methods for learning topical word embeddings, where they first cluster words into different topics using LDA (Blei et al., 2003) and then learn word embeddings using SGNS.  Liu et al. (2015b) modelled the interactions among topics, contexts and words using a tensor and obtained topical word embeddings via tensor factorisation. Instead of clustering words prior to embedding learning, Shi et al. (2017) proposed a method to jointly learn both words and topics, thereby considering the correlations between multiple senses of different words that occur in different topics. TopicVec (Li et al., 2016a) learns vector representations for topics in a document by modelling the co-occurrence between a target word and a context word considering both words' word embeddings as well as the topic embedding of the context word.\nOur proposed methods for feature expansion using ClassiNet can be seen as an explicit feature prediction method, whereas methods that learn lowerdimensional dense embeddings of texts can be seen as implicit feature prediction methods. For example, if we use lexical features such as unigrams or bigrams to create a ClassiNet, then the features predicted by that ClassiNet will also be lexicalised features, which are easier to interpret than dimensions in a latent embedded space. Although for text classification purposes it is sufficient to represent short-texts in implicit feature spaces, there are numerous tasks that require explicit interpretable predictions such as query suggestion in information retrieval (Carpineto and Romano, 2012), reverse dictionary mapping (Hill et al., 2016b), and hashtag suggestion in social media (Weston et al., 2014). Therefore, the potential applications of ClassiNets as an explicit feature expansion method goes beyond short-text classificaion. It would be an interesting future research direction to combine implicit and explicit feature expansion methods to construct better representations for texts.\nRecently there has been several methods proposed for learning embeddings (lower-dimensional implicit feature representations) for the vertices of undirected or directed (and weighted) graphs (Li et al., 2016b; Perozzi et al., 2014; Tang et al., 2015). For example, in language graphs (Tang et al., 2015), the vertices can correspond to words and the weight of the edge between two vertices represent the strength of the co-occurrences between two words in a corpus. Alternatively, in a co-author network, the vertices correspond to authors and the edges represent the number of papers two people have co-authored. Deep-Walk (Perozzi et al., 2014) performs a random walk over an undirected graph to generate a pseudo-corpus, which is then used to learn word (vertex) embeddings using skip-gram with negative sampling (SGNS) (Mikolov et al., 2013).  Li et al. (Li et al., 2016b) proposed a discriminative version of DeepWalk by including a discriminative supervised loss that evaluates how well the learnt vertex embeddings perform on some supervised tasks.  Tang et al. (Tang et al., 2015) used both first-order and second-order co-occurrences in a graph to learn separate vertex embeddings, which were subsequently concatenated to create a single vertex embedding. Although in this paper we consider graphs where vertices correspond to words, the objective of creating ClassiNets is fundamentally different from the above-mentioned vertex embedding methods. In graph (vertex) embedding, we are given a graph and a goal is to learn embeddings for the vertices such that structural information of the graph is preserved in the learnt embeddings. On the other hand, in ClassiNets, we learn feature predictors which can be used to predict whether a particular feature is missing in a given context. The connection between co-occurrence graphs and ClassiNets is further discussed in Section 3.4. Moreover, in Section 4, we propose and evaluate several methods for expanding feature vectors using the ClassiNets we create, which is not relevant for vertex embedding methods.\n\n3 ClassiNets\n\n\n3.1 Overview\nOur proposed method for classifying short-texts consists of two steps. First, we create a network of classifiers which we refer to as the ClassiNet in this paper. In Section 3.2, we describe the details of the method we propose to create ClassiNets. In Section 4, we describe several methods for using the learnt ClassiNet to expand feature vectors to overcome the feature sparseness problem.\nWe define a ClassiNet as a directed weighted graph G(V, E, W), in which a vertex v i ∈ V = {v 1 , . . . , v n } corresponds to a binary classifier (feature predictor) h i that predicts the occurrence of a feature v i in an instance. We assume that each train/test instance x is already represented by a d-dimensional vector x = (x 1 , x 2 , . . . , x d ) , in which the i-th dimension corresponds to the value x i of the i-th feature representing the instance x. The label predicted by h i for an instance x is denoted by h i (x) ∈ {0, 1}. The weight w ij associated with the edge e ij connecting the vertex v i to v j represents the conditional probability, p(h j (x) = 1|h i (x) = 1), that v j is predicted to occur in x, given that v i is also predicted to occur in x.\nSeveral remarks can be made about the ClassiNets. First, there is a oneto-one correspondence between the vertices v i in the ClassiNet and the feature predictors h i . Therefore, a ClassiNet can be seen as a network of binary classifiers, as is implied by its name. In general, the set of features S that we use for representing instances x (hence for learning feature predictors), and the set of vertices V in ClassiNet need not be the same. As we discuss later, vertices in the ClassiNet are used as expansion features to augment instances x, thereby overcoming the feature sparseness problem in short-text classification. Therefore, we are free to select a subset of features from all the features used for representing instances as the vertices in ClassiNet. For example, we might use the most frequent features in the train data as vertices in ClassiNet thereby setting V ⊂ S (n < d). Alternatively, we could use all the features in the feature space of the instances as vertices in the ClassiNet, where we have V = S (and n = d). In the remainder of the paper, we consider the general case where we have V ⊆ S (n ≤ d).\nSecond, as we discuss later in Section 3.2, we do not require labeled data for the target task when creating ClassiNets. For example, let us consider binary sentiment classification of product reviews as the target task. We might have both sentiment rated reviews (labeled instances), and reviews without sentiment ratings (unlabeled instances) at our disposal. We can use both those types of reviews, and ignore the label information when computing the ClassiNet. This is particularly attractive for two reasons: (a) obtaining unlabeled instances is often easier for most tasks compared to obtaining labeled instances, (b) because a ClassiNet created from a particular corpus is independent of the label information unique to a target task, in principle, the same ClassiNet can be used to expand features for different target tasks. The second property is attractive in multi-task learning settings, where we must perform different tasks on the same data. For example, consider the two tasks: (a) predicting whether a given tweet is positive or negative in sentiment, and (b) predicting whether a given tweet would get favorited or not. Both those tasks can be seen as binary classification tasks. We could learn two binary classifiers -one for predicting the sentiment and the other for predicting whether a tweet would get favorited. However, to overcome the feature sparseness problem in both those tasks, we can use the same ClassiNet.\nAs long as an instance (for example a sentence or a document) is represented using any bag-of-features (unigrams, bigrams, trigrams, dependency paths, syntactic paths, POS sequences, semantic roles, frames etc.) we can use the proposed method to create a ClassiNet. The first step in creating a ClassiNet is to learn feature predictors (Section 3.2). The feature predictors use the features available in an instance to as features to train a binary classifier. Therefore, it does not matter whether these features are n-grams or more complex types of features as listed above. The remainder of the steps in the proposed method (measuring the correlations between feature predictors to build the ClassiNet, applying feature expansion) use only the learnt feature predictors. Therefore, our proposed method can be used with any feature representation of instances, not limiting to lexical n-gram features.\n\n3.2 Learning ClassiNets\nLet us assume that we are given a set D u = {x (k) } N k=1 of unlabeled feature vectors x (k) ∈ R d representing N short-texts. Given D u we construct a ClassiNet in two steps: (a) learn feature predictors h i for each vertex v i ∈ V, and (b) compute the conditional probabilities p(h j (x) = 1|h i (x) = 1) using the labels predicted by the feature predictors h i and h j for an instance x. As positive training instances for learning a binary feature predictor for a feature v i , we randomly select a setD (+) i ⊂ D u of N (+) i\ninstances where v i occurs, and remove v i from those selected instances. Likewise, we randomly select a setD (−) i ⊂ D u of N (−) i\ninstances where v i does not occur. Instances that have few features are not informative for learning accurate feature predictors. Therefore, we select instances that have more non-zero features than the average number of nonzero features in an instance in D u . We found that, on average, there are ca. 15 features in an instance.\nTable 1 : Confusion matrix for the labels predicted by the feature predictors learnt for two features v i and v j .h j (x) = 1 h j (x) = 0 h i (x) = 1 M 11 M 10 h i (x) = 0 M 01 M 00\nCompared to the number of instances containing a particular feature v i in the dataset, the number of instances that do not contain v i is significantly larger. Considering that we are randomly sampling negative instances from a larger set of instances, it is likely that those selected negative instances are not very informative about why v i is missing in a given instance. In other words, the randomly sampled negative instances might already be further from the decision hyperplane, therefore do not provide sufficient specialization in the hypothesis space. Consequently, it has shown in prior work that use pseudo-negative instances for training classifiers (Bollegala et al., 2007) that it is effective to select a larger number of pseudo-negative instances than that of positive instances (i.e., N(+) i < N (−) i\n). We note that it is possible to set the number of positive and negative train instances dynamically for each feature v i . For example, some features might be popular in the dataset resulting in a larger positive sample than the others. For simplicity, in this paper, we select all instances in which a particular feature occurs as the positive training instances for that feature, and select twice that number of negative instances from the remainder of the instances (i.e., N (−) i = 2N (+) ). An extensive study of different sampling methods andN (−) i /N (+) i\nratios is beyond the scope of the current paper. Once we have selected D (+) i , and D (−) i as described above, we train a binary classifier to predict whether v i occurs in a given instance. We note that any binary classification algorithm, not limited to linear classifiers, can be used for this purpose. In our experiments, we use 2 regularized logistic regression for its simplicity. We tune the regularization coefficient in each feature predictor using 5-fold cross-validation. Being a probabilistic discriminative classifier, it is possible to obtain not only the predicted labels but also the class conditional probabilities from the trained logistic regression classifier. However, we only require the predicted labels for constructing the edge weights in ClassiNets as we describe next. Therefore, in theory, we can use even binary classifiers that do not produce confidence scores for creating ClassiNets, which extends the applicability of ClassiNets to wider contexts.\nLet us denote the label predicted by the feature predictor h i for an instance x by h i (x) ∈ {0, 1}. For two features v i and v j , we compute the confusion matrix M shown in Table 1. Here, M ab denotes the number of instances x for which h i (x) = a and h j (x) = b. In particular, M 11 is the number of instances where both v i and v j are predicted to be co-occurring by the learnt feature predictors.\nGiven the counts in Table 1, w ij is computed as follows:w ij = M 11 M 11 + M 10 (1)\nSeveral practical issues must be considered when estimating the edge-weights using (1). First, the set of instances we use for predicting labels when computing the confusion matrix in Table 1 must contain at least some instances in which v i or v j occur (i.e., M 11 + M 10 > 0, and M 11 + M 01 > 0). Otherwise, even if the feature predictors h i , h j are accurately learnt, we will still get unreliable sparse counts for M 11 and M 10 . Therefore, we randomly sample a set of instances D (i,j) ⊆ D u such that there exist equal numbers of instances containing v i , and v j .\nLet the total number of elements in D (i,j) be d . We use those d instances when computing the values in the confusion matrix shown in Table 1. We ensure that there is no overlap between the test instances D (i,j) and the train instances we use to learn feature predictors. This is important because if the feature predictors are overfitting we will not get accurate predictions using the ClassiNet during test time. Using non-overlapping train and test instance sets, we can check whether the learnt feature predictors are overfitting. Although we use a ratio of one-third when sampling D (i,j) above, we can use different ratios for sampling as long as both v i and v j are sufficiently represented in D (i,j) .\n\n3.3 Efficient Computation of ClassiNets\nClassiNets can be learnt offline during the training stage, prior to expanding test instances. Therefore, we are allowed to perform more computationally intensive processing steps compared to what we are allowed at test time, which is required to be real-time for most tasks that involve short-texts such as tweet classification. Nevertheless, we propose several methods to speed-up the the construction process when the number of vertices n in the ClassiNet grows.\nCompared to learning feature predictors for the vertices we use in the ClassiNet, which is linear in the number of vertices n in the ClassiNet, to compute weights w ij we must consider all pairwise combinations between the vertices in the ClassiNet. If we assume that the cost of learning a binary classifier for a vertex to be a constant c and is independent of the feature, then the overall computational complexity of creating a ClassiNet can be estimated as O(cn+ N n 2 d).\nThe first term is simply the complexity of computing n feature predictors at the constant cost of c. This operation can be easily parallelised because each feature predictor can be learnt independently of the others. Moreover, it is linear in the number of vertices in ClassiNet. Therefore, the first term can be ignored in most practical scenarios.\nIn cases where computational cost of the linear predictors is non-negligible, we can use several techniques to speed up this computation. First, we could resort to more computationally efficient liner classifiers such as the perceptron. Perceptrons can be trained in an online manner, without having to load the entire training dataset to the memory. Second, note that only the features v j that co-occur with a particular vertex v i in any train instance will be useful for predicting the occurrence of v i . Therefore, we can limit the features that we use in the predictor for v i to be the set of features v j that occur at least once in the training data. We can efficiently compute such feature co-occurrences by building an inverted search index. We can further speed up this computation by resorting to approximate methods where we require a context feature v j to co-occur a predefined minimum number of times with the target feature v i for which we must compute a predictor. Setting this cut-off threshold to higher values will result in smaller, sparser and less noisier feature spaces and speed up the predictor computation. However, larger cut-off thresholds are likely to remove important contextual features, thereby decreasing the accuracy of the feature predictors. The optimal cut-off threshold could be determined using cross-validation or held-out data.\nOn the other hand, the second term corresponds to learning edge-weights, and involves three factors: (a) n 2 , the number of pairwise comparisons we must perform between the n vertices in the ClassiNet, (b) N , the maximum number of instances for which we must predict labels for each pair of feature predictors when we compute the confusion matrices as shown in Table 1, and (c) d, the number of features we must consider when computing the label of a predictor. For example, if we use linear classifiers as feature predictors, during test time we must compute the inner-product between the weight vector of the classifier and the feature vector of the instance to be classified, both of which are ddimensional. The dimensionality d of the vectors that represent instances will depend on the type of features we use. For example, if we limit to lexical features from the short-text, then the number of non-zero features in any given instance will be small. However, if we use dense features such as word embeddings, then the number of non-zero features in an instance might be large.\nHowever, the factors (a) and (b) require careful consideration. First, we must compare all pairs of predictors, which is quadratic in the number of vertices in the ClassiNet. Second, to obtain the label for an instance we must classify that instance using the learnt prediction model. For example, in the case of linear classifiers we must compute the inner-product between two d-dimensional vectors: feature vector representing the instance to be classified, and the weight vector corresponding to the feature predictor. For nonliner classifiers such as the ones that use polynomial kernels, the number of feature combinations can grow exponentially resulting in slower prediction times for large batches of test instances.\nAs a solution to this problem, we first represent each feature predictor h i by a d (< d) dimensional vector h i (D (i,j) ), where each element corresponds to the label predicted for a particular instance x ∈ D (i,j) . We randomly sample D (i,j) ⊆ D u following the procedure detailed in Section 3.2, where we include equal numbers of instances that contain v i , v j , and neither of those two. Therefore, h i (D (i,j) ) ∈ I d and I d is the d -dimensional simplex. We name h i (D (i,j) ) as the label vector because it is a vector of predicted labels for all the instances in D (i,j) by h i , the feature predictor learnt for the feature v i . We can explicitly compute the label vector for the i-th feature predictor as follows:h i (D (i,j) ) = (h i (x 1 ), . . . , h i (x d ))\nIn practice, d N because only a small number of instances in D u will contain v i , or v j , and we select equal proportions of instances that do not contain both instances. The following theorem states the relationship between neighbouring feature predictors in the original d-dimensional space and the projected d -dimensional space.\nTheorem 1. Consider two (possibly nonlinear) feature predictors h i (x) = σ(µ i x), and h j (x) = σ(µ j x), parametrized by µ i , µ j ∈ R d , and a transformation function σ(•) ∈ {1, 0}. Let θ(µ i , µ j ) be the angle between µ i and µ j . The following relation holds between θ(µ i , µ j ) and the probability of agreementp h i (D (i,j) ) = h j (D (i,j) ) , θ(µ i , µ j ) = π 1 − p h i (D (i,j) ) = h j (D (i,j) ) 1/d .\nThe proof of Theorem 1 is given below, and follows from the properties of locality sensitive hashing (LSH) (Andoni and Indyk, 2008; He and Niyogi, 2003; Indyk and Motwani, 1998).\n\nProof of Theorem 1\nLet us consider the agreement of the feature predictors h i and h j on the k-th instance x k ∈ D (i,j) . The probability of agreement can be written as,p (h i (x k ) = h j (x k )) = 1 − p (h i (x k ) = h j (x k )) .\n(3)\nFrom the symmetry in the half-plane, the disagreement probability on the right side in (3) can be written as twice the probability of one parameter vector being projected positive and the other negative, given by:p (h i (x k ) = h j (x k )) = 2p µ i x k ≥ 0, µ j x k < 0 (4)\nHowever, the vector x k must exist inside the dyhedral angle θ(µ i , µ j ) formed by the intersection of the two half-panes spanned by µ i and µ j . Therefore, the probability in (4) can be estimated as the ratio between angles given by,p µ i x k ≥ 0, µ j x k < 0 = θ(µ i , µ j ) 2π .\nFrom ( 3), (4), and (5), we obtain,p (h i (x k ) = h j (x k )) = 1 − θ(µ i , µ j ) π .\nIf we assume that the instances in D (i,j) are i.i.d., then the agreement of the entire two d -dimensional label vectors can be computed as the product of agreement probabilities of each dimension, given by,p h i (D (i,j) ) = h j (D (i,j) ) = d k=1 p (h i (x k ) = h j (x k )) = 1 − θ(µ i , µ j ) π d .\nFrom ( 7) it follows that,θ(µ i , µ j ) = π 1 − p h i (D (i,j) ) = h j (D (i,j) ) 1/d\nTheorem 1 states that we can measure the agreement between labels predicted by two feature predictors using the angle between their corresponding parameter vectors. More importantly, Theorem 1 provides us with a heuristic to approximately find the nearest neighbours of each vertex without having to compute the confusion matrices for all pairs of vertices in the ClassiNet. We compute the nearest neighbours for each feature predictor in the d -dimensional space. Computation of p h i (D (i,j) ) = h j (D (i,j) ) is closely related to the calculation of hamming distance between the label vectors h i (D (i,j) ) and h j (D (i,j) ). The Point Location in Equal Balls (PLEB) algorithm (Indyk and Motwani, 1998) can be used to compute the hamming distance in an efficient manner. This algorithm considers random permutations of the bit streams and their sorting to find the vector with the closest hamming distance (Charikar, 2002). We use the variant of this algorithm proposed by Ravichandran and Hovy (Ravichandran et al., 2005) that extends the original algorithm to find the k-nearest neighbours. Specifically, we use this algorithm to find the k-nearest neighbours for each feature v i , and compute edge-weights w ij for each v i and its nearest neighbours v j using the contingency table. Note that although we find the nearest neighbours using the approximate method described above, the edge-weights computed between the selected neighbours are precise because they are based on the confusion matrix.\nTo estimate the size of the neighbourhood k that we must select in order to obtain a reliable approximation of the neighbours that we would have in the original d-dimensional space, we use the following procedure. First, we randomly select a small number α( N ) of vertices from the trained ClassiNet, and compute the confusion matrices with each of those α vertices and the remainder of the vertices in the ClassiNet. We then compute the weights w ij of the edges that connect the selected α vertices to the rest of the vertices in the ClassiNet. Following this procedure we compute the nearest neighbours of each vertex in α without using the projection trick described above. Second, we apply the projection method described above for all the vertices in the ClassiNet, and compute the nearest neighbours of the α vertices that we selected. We then compare the overlap between the two sets of neighbourhoods. In our preliminary experiments, we found that setting the neighbourhood size k = 10 to be an admissible trade-off between the accuracy of the neighbourhood computation and the speed. Therefore, all experiments described in the paper use edgeweights computed with this k value.\n\n3.4 ClassiNets vs. Co-occurrence Graphs\nBefore we describe how to use the trained ClassiNets to classify short-texts, it is worth discussing the connection between word co-occurrence graphs and ClassiNets. Representing the association between words using co-occurrence graphs has a long history in NLP (Mihalcea and Radev, 2011). Word cooccurrences could be measured using symmetric measures, such as the Pointwise Mutual Information (PMI), Log-Likelihood Ratio (LLR), or asymmetric measures such as KL-divergence, or conditional probability (Manning and Schutze, 1999). In a co-occurrence graph, vertices correspond to words, and the weight of the edge connecting two vertices represents the strength of association between the corresponding two words. However, in a co-occurrence graph, two words v i and v j to be connected by an edge, v i and v j must explicitly co-occur within the same context.\nOn the other hand, in ClassiNets, we have edges between vertices not only for the words that co-occur within the same context, but also if they are predicted for the same instance even though none of those features might actually be occurring in that instance. For example, for an instance x where x i = x j = 0, we might still have h i (x) = h j (x) = 1. Therefore, ClassiNets consider implicit occurrences of features which would not be captured by co-occurrence graphs. In fact, ClassiNets can be thought to be a generalized version of co-occurrence graphs that subsumes explicit co-occurrences. To see this, let us define feature predictors h i and h j as follows:h i (x) = 1[x i = 0] (8) h j (x) = 1[x j = 0]\nHere, 1 is the indicator function defined as follows:1(δ) = 1 δ = TRUE 0 δ = FALSE (10)\nThen, M 11 in Table 1 can be written as,M 11 = x∈D (i,j) 1[x i = 0]1[x j = 0],\nwhich is the number of instances in which both features v i and v j would co-occur. Therefore, ClassiNet reduces to co-occurrence graphs when the feature predictor is simply the indicator function for a single feature. However, in general, feature predictors would consider not just a single feature but a combination (potentially non-linear) of multiple features, thereby capturing broader information than in a word co-occurrence graph.\n\n4 Feature Expansion\nIn this Section, we describe several methods to use the ClassiNets created in Section 3 for predicting missing features in instances, thereby overcoming the feature sparseness problem. We refer to this operation as feature expansion.\nGiven a train or a test instance x = (x 1 , . . . , x d ) , we use the non-zero features, x i = 0 in x and find similar vertices v j ∈ V from the created ClassiNet. In Section 4.1, we describe local feature expansion methods that consider only the nearest neighbours of the vertices in the ClassiNet that correspond to nonzero features in an instance, whereas in Section 4.2 we propose a global feature expansion method that propagates the original features across the ClassiNet to predict the related features.\n\n4.1 Local Feature Expansion\nGiven a ClassiNet, we propose several feature expansion methods that consider the local neighbourhood of the non-zero features that occur in an instance. We refer to such methods collectively as local feature expansion methods.\n\n4.1.1 Independent Expansion\nThe first local feature expansion method we propose expands each feature in an instance independently of the others. Specifically, we predict whether v i occurs in a given instance x using the feature predictor h i we trained from the unlabeled instances. If h i (x) = 1, then we append v i as an expansion feature to x, otherwise we ignore v i . We repeat this process for all the vertices v i ∈ V and append the positively predicted vertices to the original instance x.\nIf the i-th feature x i already appears in x and also predicted by h i (x) then we set its feature value to x i + h i (x). In the case where we have binary feature representations we will have x i ∈ {0, 1}. Therefore, in the binary feature setting if a feature that already exists in an instance is predicted, then it will result in doubling the feature weight (∵ x i + h i (x) = 1 + 1 = 2). Moreover, instead of predicting the label, in a probabilistic classifier, such as the logistic regression, we can use the posterior probability instead of the predicted label as h i (x) to compute feature values for the expansion features.\n\n4.1.2 Local Path Expansion\nThis method extends the independent expansion method described in Section 4.1.1 by including all the vertices along the shortest paths that connect predicted features to the original features over the ClassiNet. For example, let us assume that a feature x i = 0 in an instance x. If h i (x) = 1, we will append v i as well as all the vertices along the shortest paths that connect v i to each feature x j = 0 that exists in the instance x. Because all expanded features are connected to the original non-zero features that exist in the instance via some local path, we refer to this approach as the local path expansion. By construction, the set of expansion candidates produced by the local path expansion method subsumes that of the independent expansion method.\n\n4.1.3 All Neighbour Expansion\nIn this expansion method, first, we use edge-weights to find the k-nearest neighbours of each vertex v i , and connect all the neighbours for each vertex to create a k-nearest neighbour graph from the trained ClassiNet. The k-nearest neighbour graph that we create from the ClassiNet in this manner is a subgraph of the ClassiNet. Two vertices v i and v j are connected by an edge in this k-nearest neighbour graph if and only if v i is among the top k most similar vertices to v j as well as v j is among the top k most similar vertices to v i . The weights of all the edges in this k-nearest neighbour graph are set to 1.\nNext, for each non-zero feature in an instance x, we use its nearest neighbours as expansion features. This method ignores the absolute values of the edge-weights in the ClassiNet, and considers only their relative strengths. If we increase the value of k, we will have a larger set of candidate expansion features. However, it will also result in considering less relevant features to the original features. Therefore, there exists a trade-off between the number of expansion candidates we can use for feature vector expansion, and the relevancy of the expansion features to the original features. Using development data, we constructed k-nearest neighbour graphs for varying k values, and found that k > 4 settings often result in noisy neighbourhoods. Consequently, when using neighbour expansion, we set k = 4.\n\n4.1.4 Mutual Neighbour Expansion\nThe mutual neighbour expansion method also uses the same k-nearest neighbour graph as used by the all neighbour expansion method described in Section 4.1.3. The mutual neighbour expansion method selects a vertex v j in ClassiNet as an expansion candidate, if there exists at least two distinct vertices v i , v k in the ClassiNet for which x i = 0, and x k = 0 in the instance x to be expanded. This method can be seen as a conservative version of the all neighbour expansion method described in Section 4.1.3 because, we would ignore vertices v j that are nearest neighbours of only a single feature in the original feature vector. The mutual neighbour expansion method addresses the issue associated with previously proposed local feature expansion methods, which select expansion candidates separately for each non-zero feature in the feature vector to be expanded, ignoring the fact that the feature vector represents a single coherent short-text. However, this conservative expansion candidate selection strategy of the mutual neighbour expansion method means that we will have a smaller set of expansion candidates in comparison to, for example, the all neighbour expansion method.\n\n4.2 Global Feature Expansion\nThe local feature expansion methods described in Section 4.1 consider only the vertices in the ClassiNet that are directly connected to a feature in an instance as expansion candidates. Even in the case of local path expansion (Section 4.1.2), the expansion candidates are limited to the local neighbours of the original features and the predicted features. Considering that ClassiNet is a directed graph, we can perform label propagation on ClassiNet to find features that are not directly connected nor appearing in the local neighbourhood of a feature in a short-text but still relevant.\nFor example, assume that Google and Microsoft are not local neighbours in a ClassiNet. Consequently none of the local neighbour expansion methods will be able to predict Microsoft as a relevant feature for expanding a short-text containing Google. However, if Bing, a Web search engine similar to Google, appears in the local neighbourhood of Google in the ClassiNet, and if we can propagate from Bing to its parent company Microsoft via the ClassiNet, then we will be able to predict Microsoft as a relevant feature for Google. The propagation might be over multiple hops, thereby reaching beyond the local neighbourhood of a feature.\nPropagation over ClassiNet can also help to reduce the ambiguity in feature expansion. For example, consider the sentence \"Microsoft and Apple are competing for the tablet computer market.\". If we do not perform word sense disambiguation prior to feature expansion, and we expand each feature independently of the others, then it is likely that we might incorrectly expand apple by other types of fruits such as banana or orange. Such phenomena are observed in prior work on set expansion and is referred to as semantic drift (Kozareva and Hovy, 2010). However, if we find the expansion candidates jointly, such that they are relevant to all the features (words) in the sentence, then they must be relevant to both Microsoft as well as Apple, which encourages other IT companies, such as Google or Yahoo for example. All local feature expansion methods described in Section 4.1 except the independent expansion method address this issue by ranking expansion candidates depending on how well they are related to all the features in a short-text. Label propagation can solve this ambiguity problem in a more systematic manner by converging multiple random walks initiated at different features that exist in a short text. Next, we describe a global feature expansion method based on propagation over ClassiNet.\nFirst, let us describe the proposed global feature expansion method using the ClassiNet shown in Figure 6. Here, we consider expanding an instance x = (x 1 , x 2 ) with two non-zero features v 1 = x 1 and v 2 = x 2 (x 1 = 0, and x 2 = 0). We would like to compute the likelihood p(v * |x) of a vertex v * as an expansion candidate for the instance x. From Figure 6 we see that there are two possible paths reaching v * starting from the original features x 1 and x 2 . Assuming that the two paths are independent, we compute p(v * |x) as follows:p(v * |x) = p(x 1 )p(v 3 |x 1 )p(v * |v 3 ) + p(x 2 )p(v 4 |x 2 )p(v * |v 4 )\nThe computation described in Figure 6 can be generalized for an arbitraryv ₁ =x ₁ v ₂ =x ₂ v ₃ v ₄ v*\nFigure 1 : Computing the feature value of an expansion feature v * for an instance that has v 1 = x 1 and v 2 = x 2 as non-zero features.\nClassiNet G(V, E, W), and an instance x = (x 1 , . . . , x d ) . For this purpose, let us define the set of non-cyclic paths connecting two vertices v i , v j in G to be Γ(v i , v j ). For the example shown in Figure 6 we have the two pathsx 1 → v 3 → v * , and x 2 → v 4 → v * .\nWe compute the likelihood p(v * |x) of a vertex v * ∈ V being an expansion candidate of x as follows:p(v * |x) = d k=1   x k p(x k = v k ) (a,b)∈Γ(x k ,v * ) p(b|a)   ()\nIf a feature x k = 0, then the likelihoods corresponding to paths starting from x k will be ignored in the computation of ( 13). The prior probabilities of features p(x k ) can be estimated from train data by dividing the number of instances that contain x k by the total number of instances. Alternatively, we could set a uniform prior for p(x k ) thereby considering all the words that occur in an instance equally. We follow the latter approach in our experiments. The sum-product computation over paths can be efficiently computed by observing that it can be modeled as a label propagation problem over a directed weighted graph, where an instance x is the initial state vector and the transition probabilities are given by the weight matrix W. Vertices that can be reached after q hops are given by q i=1 W i x. Neighbours that are distantly located in the ClassiNet are less reliable as expansion candidates. To reduce the noise due to distant (and potentially irrelevant) vertices during the propagation, we introduce a damping factor 0 < γ ≤ 1 in the summation, q i=1 γ i W i x. In Section 6.4, we experimentally study the effect of the level of damping on the classification accuracy of short-text classification.\nThe feature expansion methods we described above are used to predict missing features for both train and test instances. We expand feature vectors representing the train/test instances, and assign unique identifiers to the expansion features, thereby distinguishing between the original features and the expanded features. For example, given the positive sentiment labeled train sentence \"I love dogs\", we can represent it using the feature vector, [(I, 1), (love, 1), (dog, 1)]. Here, we assume that lemmatization has been conducted on the input and the feature dogs has been converted to its singular form dog. Let us further assume that from the trained ClassiNet we were able to predict that cat is a related feature for dog, and the candidate score p(cat|dog) = 0.8. Next, we add the feature (EXP=cat, 0.8) to the feature vector representing this train instance, where the prefix EXP= indicates that it is a feature introduced by the expansion method and not a feature that existed in the original train instance. Distinguishing original vs. expansion features is useful when we would like to learn different weights for the same feature depending on whether it is expanded or not. For example, if a particular feature is not very useful as an expansion feature, it will be assigned a lower weight thereby effectively pruning that feature out from the model learnt by the classifier.\nThe first step of learning a ClassiNet is learning the feature predictors. In this regard, any word embedding learning method can be used for the purpose of learning feature predictors. Once the feature predictors are learnt, we can create a ClassiNet in the same manner as we propose in this paper and use the ClassiNet created to perform feature expansion using local/global feature expansion methods we propose in the paper. This view of ClassiNets illustrates the general applicability of the proposed method.\n\n5 A Theoretical Analysis of ClassiNets\nBefore we empirically evaluate the performance of the proposed ClassiNets for feature expansion in short-text classification, let us analyze some interesting properties of ClassiNets. To simplify the analysis, let us assume that we are using a ClassiNet for learning a linear classifier φ ∈ R d for a binary classification task. Specifically, let us assume that we are given a train dataset {(x (k) , y (k) )} N k=1 consisting of N instances, where each train instance k is represented by a feature vector x (k) ∈ R d . The binary target label assigned to the k-th train instance is denoted by y (k) ∈ {1, −1}. For correctly classified train instances x (k) we have, y (k) φ x (k) > 0.\nWe use the trained linear classifier φ, and predict the label ŷ of an unseen test instance x as follows:ŷ = 1 if φ x > 0 −1 otherwise (14)\nLet us assume that we have learnt a feature predictor h i that predicts whether the i-th feature exists in a given instance. As described in Section 3.1, we can use any classification algorithm to learn the feature predictors. However, as a concrete case, let us consider linear classifiers in this analysis. In the case of linear classifiers, we can represent the feature predictor learnt for the i-th feature by the vector µ i . Following the notation introduced in Section 3.1, we can write the feature predictor h i as follows:h i (x) = 1 if µ i x > 0 −1 otherwise (15)\nIn the ClassiNets described in the paper so far, we used the predicted discrete labels as the values of the predicted features during feature expansion. However, in this analysis let us consider the more general case where we use the actual prediction score, µ i x as the contribution of the feature expansion towards the i-th feature.\nWe can construct the expanded feature vector, x * ∈ R d , of the feature vector x ∈ R d considering the inner-product between x and each of the feature predictors µ i as in ( 16).x * = [(x 1 + µ i x), . . . , (x i + µ i x), . . . , (x d + µ d x)]\nHere, we denote the i-th dimension of the feature vector x by x i . We can transform the given train dataset {(x (k) , y (k) )} N k=1 by expanding each feature vector separately using ( 16), and use the expanded feature vectors to train a binary linear classifier φ * . Following ( 14), we can use φ * to predict the label for a test instance x * based on the prediction score given byφ * x * = d i=1 φ * i x i + µ i x = d i=1 φ * i x i + d i=1 φ * i µ i x = φ * x + φ * Lx (17) = φ * (I + L) x (18)\nHere, I ∈ R d×d is a unit matrix, and L ∈ R d×d is the matrix formed by arranging the feature predictors µ i in rows. In other words,L = [µ 1 . . . µ d ] .\nThe first term in (17) corresponds to classifying the non-expanded (original) instance x using the classifier trained using the expanded train dataset. The second term in (17) represents the prediction score due to feature expansion. From (18) we see that performing feature expansion on a feature vector x is equivalent to multiplying the matrix (I + L) into x. Therefore, local feature expansion methods described in Section 4.1 can be seen as projecting the train feature vectors into the same d-dimensional feature space spanned by the features that exist in the train instances. As a special case, we see that when we do not learn feature predictors we have L = 0, for which (17) reduces to the prediction score φ * x of the binary linear classifier trained using non-expanded train instances.\n\n5.1 Edge weights of ClassiNets\nRecall that, w ij the weight of the edge connecting the vertex i to vertex j in a ClassiNet was defined by (1). In the case of binary linear feature predictors µ i and µ j we considered in the previous section, let us estimate the value of w ij . Using the indicator function 1 defined by (10), we compute M 11 and (M 11 +M 10 ) in (1) as follows:M11 = N k=1 1[(y (k) x (k) µ i >0) ∧ (y (k) x (k) µ j >0)]M11 + M10 = N k=1 1[(y (k) x (k) µ i > 0)]\nLet us assume that we sample instances x from the train dataset randomly according to the distribution p(x). Then the expected counts in M11 and M10 in ( 19) and ( 20) can be expressed using the expected number of the correct classifications made by the feature predictors µ i and µ j as follows:M11 = E p(x) 1[(yx µ i > 0) ∧ (yx µ j > 0)]M11 + M10 = E p(x) 1[(yx µ i > 0)]\nUsing the expected counts given by ( 21) and ( 22) we can compute the approximate value of the edge weight ŵij as follows:ŵij = E p(x) 1[(yx µ i > 0) ∧ (yx µ j > 0)] E p(x) [1[(yx µ i > 0)]]\nIf we have a sufficiently large train dataset, then (23) provides an alternative procedure for estimating the edge weights. We could randomly select samples from the train dataset, predict the features i and j for those samples, and compute the expectations as ratio counts. We can repeat this procedure many times to obtain better approximations for the edge weights. Although this is a theoretically feasible procedure for approximately computing the edge weights, it can be slow in practice and might require many samples before we obtain a reliable approximation for the edge weights. Therefore, the edge weight computation method described in Section 3.3 is more appropriate for practical purposes.\n\n5.2 Analysis of the Global Feature Expansion Method\nWe already showed in (18) that local feature expansion methods can be considered as feature vector transformation methods by a matrix (I + L). However, an important strength of ClassiNet is that we can propagate the predicted features over the network using the global feature expansion method described in Section 4.2.\nLet us denote the edge-weight matrix of the ClassiNet G by W. The (i, j)th element of W is denoted by w ij . The connection between edge weights w ij and the feature predictors µ i and µ j is given by (23). In the global feature expansion method, we repeatedly propagate the predicted features across the network, which can be seen as a repeated multiplication using γW, where γ is the damping factor described in Section 4.2. Observing this connection, we can derive the prediction score under the global feature expansion method similar to (18) as follows:φ * x * = φ * (I + γW + . . . + γ q W q ) x = φ * (I − γW) −1 (I − γ (q+1) W (q+1) )x\nFor the summation shown in (24) to hold, and the matrix (I − γW) to be invertible, for all eigenvalues λ r of W we require γ|λ r | < 1. This requirement can be met in practice by a sufficiently small damping factor. For example, we could set γ = 1/(1 + |λ max ||), where |λ max | is the eigenvalue of W with the maximum absolute value. As a special case where we propagate the features without truncating, we have q → ∞, for which we obtain the prediction score given in (25).φ * x * = φ * (I − γW) −1 x\nFrom ( 25), we see that, similar to the local feature expansion methods, the global feature expansion method can also be seen as projecting the input feature vector x using the matrix (I − γW) − 1.\n\n6 Experiments\nWe create a ClassiNet using 257,306 unlabeled sentences from the Large Movie Review dataset 1 . Each word in this dataset is uniquely represented by a vertex in the ClassiNet. We learn linear predictor for each feature using automatically selected positive (reviews where the target feature appears) and negative (reviews where the target feature does not appear) training instances. The ClassiNet created from this dataset contains 489, 000 vertices. This ClassiNet is used in all the experiments described in the remainder of this paper.\nFor evaluation purposes we use four binary classification datasets: the Stanford sentiment treebank (TR) 2 (903 positive test instances and 903 negative test instances), movie reviews dataset (MR) (Pang and Lee, 2005) (5331 positive instances and 5331 negative instances), customer reviews dataset (CR) (Hu and Liu, 2004) (925 positive instances and 569 negative instances), and subjectivity dataset (SUBJ) (Pang and Lee, 2004) (5000 positive instances and 5000 negative instances). We perform five-fold cross-validation in all datasets, except in the Stanford sentiment treebank where there exists a pre-defined test and train split. In each dataset, we use the train portion to learn a binary classifier. Next, we use the trained ClassiNet to expand the feature vectors for the test instances. We then measure the classification accuracy of the binary classifier on the expanded test instances. If high classification accuracies are obtained using a particular feature expansion method, then that feature expansion method is considered superior.\nWe use a CPU server containing 48 cores of 2.5GHz Intel Xeon CPU and 512GB RAM in our experiments. The entire training pipeline of training feature predictors, building the ClassiNet and expanding training instances using Global feature expansion method takes approximately 1.5 hours. The testing phase is significantly faster because we can use the created ClassiNet to expand test instances and use the trained model to make predictions. For example, for the SUBJ dataset, which is the largest among all datasets used in our experiments, it takes only 5 minutes to both expand (using Global feature expansion) and predict (using logistic regression).\n\n6.1 Binary Classification of Short-Texts\nDirect evaluation of the features predicted by the ClassiNet is difficult because there is no gold standard for feature expansion. Instead, we perform an extrinsic evaluation of the created ClassiNet by using it to expand feature vectors representing sentences in several binary text classification tasks. If we can observe any increase (or decrease) in classification accuracy for the target classification task when we use the features predicted by the ClassiNet, then it can be directly associated with the effectiveness of the ClassiNet. For the purpose of training a binary classifier, we represent a sentence by a real-valued vector, in which elements correspond to the unigrams extracted from that sentence. The feature values are computed using the tfidf measure. We train a binary logistic regression model, where the L 2 regularisation coefficient is tuned using development data selected from the Stanford sentiment treebank dataset.\nWe use classification accuracy, which is defined as the ratio between the correctly classified test sentences and the total number of test sentences in the Stanford sentiment treebank. In addition to reporting the overall classification accuracies, we report classification accuracies separately for the positively labeled instances and the negatively labeled sentences. Because this is a binary classification task, a random classifier would obtain an accuracy of 50%. There are 903 positive and 908 negative sentiment labeled test sentences in the Stanford sentiment treebank test dataset. Therefore, a baseline that assigns the majority label would obtain an accuracy of 50.13% on this dataset.\nTable 2 compares the sentiment classification accuracies obtained by the following methods:\nNo Expansion: This baseline does not perform any feature expansions. It trains a binary logistic regression classifier using the train sentences, and applies it to classify sentiment of the test sentences. This baseline demonstrates the level of performance we would obtain if we had not performed any feature expansion. It can be seen as a lower-baseline for this task.\nIndependent Expansion: This method is described in Section 4.1.1.\nLocal Path Expansion: This method is described in Section 4.1.2. All neighbour Expansion: This method is described in Section 4.1.3. Mutual neighbour Expansion: This method is described in Section 4.1.4. WordNet: Using lexical resources such as thesauri to find related words is a popular technique used in query expansion (Fang, 2008; Gong et al., 2005).\nTo simulate the performance that we would obtain if we had used an external resource such as the WordNet to find the expansion candidates, we implement the following baseline. In the WordNet, words that are semantically related are grouped into clusters called synsets. For each feature in a test instance, we search the WordNet for that feature, and use all words listed in synsets for that feature as its expansion candidates. We consider all synonyms in a synset to be equally relevant as expansion candidates of a feature.\nSCL: Domain adaptation methods attempt to overcome the feature mismatch between source and target domains by predicting missing features and/or learning a lower-dimensional embedding common to the two domains. Although we do not have two domains in our setting, we can still apply domain adaptation methods such as the structural correspondence learning (SCL) proposed by Blitzer et al. (Blitzer et al., 2006) to predict missing features in a given short-text. SCL was described in detail in Section 2. Specifically, we train SCL using the same set of vertices as used by the ClassiNet as pivots. This enables us to conduct a fair comparison between SCL and methods that use ClassiNet because the performance between SCL and methods that use ClassiNet can be directly attributable to the projection method used in SCL and not due to any differences of the expansion set. We then train linear predictors for those pivots using logistic regression. We arrange the trained linear predictors as rows in a matrix, on which we subsequently perform singular value decomposition to obtain a lower-dimensional projection. Following the recommendations in (Blitzer et al., 2006), we set the dimensionality of the projection to 50. Both train and test instances are first projected to this lower-dimensional space and we append the projected features to the original feature vectors. Next, we train a binary sentiment classifier using logistic regression with 2 regularisation. The regularisation coefficient is set using a held-out set of review sentences.\nFTS: FTS is the frequent term sets method proposed by Man (Man, 2014). First, co-occurrence and class-orientation relations are defined among features (terms). Next, terms that are frequent in those relations more than a predefined threshold (support) are selected as expansion candidates. Finally, for each feature in a short text, the frequent term sets containing this feature are appended as expansion features to the original feature vector representing the short-text. FTS can be considered as a method that uses clusters of features induced from the data instances to overcome the feature sparseness problem.\nCBOW: To compare the explicit feature expansion approach used by ClassiNets against implicit text representation methods, we use pre-trained word embeddings to represent a short-text in a lower-dimensional space. Specifically, we create 300 dimensional word embeddings using the same corpus used by ClassiNets to create continuous bag-of-words (CBOW) (Mikolov et al., 2013) embeddings, and add the word embedding vectors for all the words in a short text to create a 300 dimensional vector that represents the given short-text.\nGlobal Feature Expansion: This method propagates the original features across the trained ClassiNet, and is described in Section 4.2. It is the main method proposed in this paper.\nWe summarise the classification accuracies obtained with different approaches 2. For each dataset we indicate the best performing method using boldface font, whereas an asterisk indicates if the best performance reported is statistically significantly better than the second best method on the same dataset according to a two-tailed paired t-test under 0.01 confidence level. From Table 2, we see that the proposed Global Feature Expansion method obtains the best performance in all four datasets. Moreover, in MR and CR datasets its performance is significantly better than the second best methods (respectively SCL and All Neigbour Expansion) on those two datasets . Among the four local expansion methods, All neighbour Expansion reports the best performance in TR and CR datasets, whereas the Mutual neighbour Expansion reports the best performance in MR and SUBJ datasets. Independent Expansion method performs worse than the No Expansion baseline in TR, CR, and SUBJ datasets indicating that by individually expanding each feature in a short-text we introduce a significant level of noise into the short-text. This result shows the importance for a feature expansion methods to consider all the features in an instance when adding related features to an instance. None of the local feature expansion methods are able to outperform the global feature expansion method in any of the datasets. In particular, in the SUBJ dataset we see that none of the local feature expansion methods outperform the No Expansion baseline. This result implies that it is not sufficient to simply create a ClassiNet, but it is also important to use an appropriate feature expansion method on the built ClassiNet to find expansion features to overcome the feature sparseness problem in short-text classification.\nFTS method performs poorly in all our experiments. This indicates that the frequency of a feature is not a good indicator of its effectiveness as an expansion candidate. On the other hand, WordNet method that uses synsets as expansion candidates performs much better than FTS method. Not surprisingly, this result shows that synonyms are useful as expansion candidates. However, a prerequisite of this approach is the availability of a thesauri that are either manually or semi-automatically created. Such linguistic resources might not be available or incomplete for some languages. On the other hand, our proposed method does not require such linguistic resources.\nCBOW and SCL methods perform competitively with the Global Feature Expansion method in all datasets. Given that both CBOW and SCL are using word-level embeddings to compute a representation for a short text, this result shows the effectiveness of word-level embeddings as a method to overcome feature sparseness in short-text classification tasks. We compare non-compositional sentence-level embedding methods against the proposed Global Feature Expansion method later in Section 6.2.\n\n6.2 Comparisons against sentence-level embeddings\nAn alternative direction for representing short-texts is to project the entire text directly to a lower-dimensional space, without applying any compositional operators to word-level embeddings. The expectation is that the overlap between short-texts in the projected space will be higher than that in the original space such as a bag-of-word representation of a short-text. Skip-thought vectors (Kiros et al., 2015), FastSent (Hill et al., 2016a), and Paragraph2Vec (Le and Mikolov, 2014) are popular sentence-level embedding methods that have reported stateof-the-art performance on text classification tasks. In contrast to our proposed method which explicitly append features to the original feature vectors to overcome the feature sparseness problem, sentence-level embedding methods can be seen as an implicit feature representation method.\nIn Table 3, we compare the proposed method against the state-of-the-art sentence-level embedding methods. We use the published results in (Kiros et al., 2015) on MR, CR, and SUBJ datasets for Skip-thought, FastSent, and Para-graph2Vec, without re-training those methods. All three methods are trained on the Toronto books corpus (Zhu et al., 2015). Performance of these methods on the TR dataset were not available. As a multiclass classification setting, we used the TREC question-type classification dataset. In this dataset, each question is manually classified to 6 question types depending on the information asked in the question such as abbreviation, entity, description, human, location and numeric. We use the same classinet as we used in the binary classification tasks to predict features for 5500 train and 500 test questions. A multiclass logistic regression classifier is trained on feature vectors with missing features predicted and tested on the feature vectors for the test questions with missing features predicted.\nNext, we briefly describe the methods compared in Table 3. Skip-thought (Kiros et al., 2015) is a sequence-to-sequence model that encodes sentences using a Recurrent Neural Network (RNN) with Gated Recurrent Units (GRUs) (Cho et al., 2014). FastSent (Hill et al., 2016a) is similar to Skip-thought in that both models predict the words in the next and previous sentences given the current sentence. However, unlike Skip-though which considers the word-order in a sentence, FastSent models a sentence as a bag-of-words. Paragraph2Vec (Le and Mikolov, 2014) learns a vector for every short-text (eg. a sentence) in a corpus jointly with word embeddings for every word in that corpus such that the word embeddings are shared across all short-texts in the corpus. Sequential Denoising Autoencoder (SDAE) (Hill et al., 2016a) is an encoder-decoder model with a Long Short-Term Memory (LSTM) (Hochreiter and Schmidhuber, 1997) unit. We use the SDAE version that uses pre-trained CBOW embeddings to initialise the word embeddings because of its superior performance over the SDAE version that uses randomly initialised word embeddings.\nWe use Convolutional Neural Networks (CNN) for creating sentence-level embeddings as a baseline. For this purpose, we follow the model architecture proposed by Kim (2014). Specifically, each word v i in a sentence is represented by a d-dimensional word embedding v i ∈ R d , and the word embeddings are concatenated to create a fixed-length sentence embedding. The maximum length n of a sentence is used to determine the length of this initial sentence-level embedding, where sentences with words less than this maximum length are padded using null vectors. Next, a convolution operator defined by a filter w ∈ R hd is applied on windows of consecutive h tokens in sentences to produce new feature vectors for the sentences. We use several convolutional filters by varying the window size. Next, max-over-time pooling (Collobert et al., 2011) is applied on this feature map to select the maximum value corresponding to a particular feature. This operation produces a sentence-level embedding that is independent of the length of the sentence. Finally, a fully connected layer with dropout (Srivastava et al., 2014) and a softmax output unit is applied on top of this sentence representation that can predict the class label of a sentence. Pre-trained CBOW embeddings are used in the CNN-based sentence encoder as well.\nFrom Table 3 we see that the proposed Global Feature Expansion method obtains best classification accuracies on MR and CR datasets with statistically significant improvements over the corresponding second-best methods, whereas Skip-thought reports the best results on the SUBJ and TREC datasets. However, unlike Skip-thought that is trained for two weeks on a GPU cluster, ClassiNets can be trained in less than 6 hours end-to-end on a single core CPU. The computational efficiency of ClassiNets is particularly attractive when continuously classifying large amounts of short-texts such as, for example, sentiment classification of tweets coming in as a continuous data stream.\n\n6.3 Qualitative evaluation\nIn Table 4, we show the expansion candidates predicted by the proposed Global Feature Expansion method for some randomly selected short-reviews. The gold standard sentiment labels associated with each short review in the test dataset are shown within brackets. All the reviews shown in Table 4 are misclassified if we had used only the features in the original review. However, by appending the expansion features found from the ClassiNet, we can correctly predict the sentiment for those short reviews. From Table 4, we see that many poor, slow, awful, dull, scary, boring, stupid, bad, silly. semantically related features are found by the proposed method.\nFigure 2 shows an extract from the ClassiNet we create from the Large Movie Review dataset. To avoid cluttering of edges, we show only the edges for a sparse k = 4 mutual neighbour graph created from the original densely connected ClassiNet. First, for each vertex v i in the ClassiNet we compute its top k similar vertices according to the edge weights. Next, we connect a vertex v i to a vertex v j in the k-mutual neighbour graph if v j is among the top k similar vertices of v i , and v i is among the top k similar vertices of v j . We see that synonyms, such as awful, and horrible are connected by high weighted edges in Figure 2. It is interesting to see that antonyms, such as good, and bad are also among the mutual nearest neighbours because those terms frequently occur in similar contexts (e.g., good movie vs. bad movie). Moreover, Figure 2 shows the importance of propagating over the ClassiNet, instead of simply considering the directly connected vertices as the expansion candidates. For example, although being highly related features, there is no direct connection from horrible to boring in the ClassiNet. However, if we consider two-hop connections then we can find a path through awful.\n\n6.4 Effect of the Damping Factor\nTo empirically study the effect of the damping factor on the classification accuracy of short-texts under the Global Feature Expansion method, we randomly select 1000 positive and 1000 negative sentiment labeled sentences from the Large Movie Review dataset as validation data, and evaluate the sentiment classification accuracy of the Global Feature Expansion method with different γ values. The result is shown in Figure 3. Note that smaller γ values will reduce the propagation than larger γ values, restricting the expansion candidates to a smaller local neighbourhood surrounding the original features. From Figure 3 we see that initially when increasing γ the classification accuracy increases and reaches a peak at γ = 0.85. This shows that it is indeed important to find expansion neighbours by propagating over the ClassiNet as done by the global feature expansion method. However, setting γ > 0.85 results in a drop of classification accuracy, which is due to distant and potentially irrelevant expansion candidates. Interestingly, γ = 0.85 has been found to be the optimal value for different graph-based propagation tasks such as the PageRank (Page et al., 1999).\n\n6.5 Number of Expansion Features\nIn this Section we analyse the number of feature appended to train/test instances by the different feature expansion methods using a fixed ClassiNet. Recall that none of the feature expansion methods we proposed has any predefined number of expansion features. In contrast, the number of expansion features depends on several factors: (a) the number of features in the original (prior to expansion) feature vector, (b) the size and the connectivity of the ClassiNet and (c) the feature expansion method. For example, if a particular feature vector has n features, which are all present in the ClassiNet, then on average under the All Neighbour Expansion method, we will append dn number of features to this instance where d is the out degree of the ClassiNet. More precisely, the actual number of expansion features will be different from dn due to several reasons. First, some vertices in ClassiNet might have different numbers of neighbours, not necessarily equal to the out degree. Second, the out degree considers the weight of the edges and not simply the different number of vertices connected via outbound edges. Third, some of the expansion features might already be in the original feature vector, thereby not increasing the number of features. Finally, the same expansion feature might be suggested by different vertices, therefore doubly counting the number of expansion features.\nTo empirically analyse the number of expansion features, we build a ClassiNet containing 700 vertices and count the number of features expanded on the SUBJ train dataset. The out degree d is given by (26).d = 1 N i j∈N (vi) w ij (26)\nHere, N is the total number of vertices in the ClassiNet, N (v i ) is the set of neighbours connected to v i by an out bound link, and w ij is the weight of the edge connecting vertex v i to v j .\nFigure 4 shows the degree distribution for the ClassiNet with degree d = 263.35. We see that most vertices are connected to 240 − 300 other vertices in the ClassiNet. Given that this ClassiNet contains 700 vertices, this is a tightly connected, dense graph. For each train instance in the SUBJ dataset, we compute the expansion ration, ratio between the number of features after and before feature expansion, for the All Neighbour Expansion (Figure 5) and Global Feature Expansion (Figure 6). We see that the expansion ratio is higher for the global feature expansion (ca. 25-30) compared to that for all neighbour expansion (ca. 1.5-2.5). Given that the global feature expansion considers a broader neighbourhood surrounding the initial features in an instance this is not surprising. Moreover, it provides an explanation for the superior performance of the global feature expansion. Although expanding too much using not only relevant nearby features but also potentially irrelevant broader neighbourhoods is likely to degrade performance, we see that at the level of expansions done by the global feature expansion this is not an issue. Therefore, we conclude that under the global feature expansion method, we do not need to impose any predefined limitations to the number of expansion features.\n\n7 Conclusion\nWe proposed ClassiNet, a network of binary classifiers for predicting missing features to overcome the feature sparseness problem observed in short-text classification. We select positive and negative training instances for learning the feature predictors using unlabeled data. In ClassiNets, the weight of the edge connecting the vertex v i to v j represents the probability that given v i is predicted to occur in an instance, v j is also predicted to occur in the same instance. We proposed an efficient method using locality sensitive hashing to approximately compute the neighbourhood of a vertex, thereby avoiding allpair computation of confusion matrices. We propose local and global methods for feature expansion using ClassiNets. Our experimental results show that the global feature expansion method significantly improves the classification accuracy of a sentence-level sentiment classification tasks outperforming previously proposed methods such as structural correspondence learning (SCL), and frequent term sets (FTS), Skip-thought vectors, FastSent, and Paragraph2Vec on multiple datasets. Moreover, close inspection of the expanded feature vectors show that features that are related to an instance are found as expansion candidates for that instance. In the future, we plan to apply ClassiNets to other tasks that require missing feature prediction such as recommendation systems.\n\nFootnotes:\n1: http://ai.stanford.edu/~amaas/data/sentiment/\n2: http://nlp.stanford.edu/sentiment/treebank.html\n\nReferences:\n\n- Alexandr Andoni and Piotr Indyk. 2008. Near-Optimal Hashing Algorithms for Approximate Nearest Neighbor in High Dimensions. Commun. ACM 51, 1 (2008), 117 -122.- David M. Blei, Andrew Y. Ng, and Michael I. Jordan. 2003. Latent Dirichlet Allocation. Journal of Machine Learning Research 3 (2003), 993-1022.\n\n- John Blitzer, Mark Dredze, and Fernando Pereira. 2007. Biographies, Bolly- wood, Boom-boxes and Blenders: Domain Adaptation for Sentiment Classi- fication. In ACL 2007. 440-447.\n\n- D. Bollegala, Y. Matsuo, and M. Ishizuka. 2007. Measuring semantic similarity between words using web search engines. In Proc. of WWW '07. 757-766.\n\n- José Camacho-Collados, Mohammad Taher Pilehvar, and Roberto Navigli. 2015. NASARI: a Novel Approach to a Semantically-Aware Representation of Items. In Proceedings of the 2015 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies. Association for Computational Linguistics, Denver, Colorado, 567-577. http: //www.aclweb.org/anthology/N15-1059\n\n- Claudio Carpineto and Giovanni Romano. 2012. A Survey of Automatic Query Expansion in Information Retrieval. Journal of ACL Computing Surveys 44, 1 (2012), 1 -50.\n\n- Moses Charikar. 2002. Similarity Estimation Techniques from Rounding Algo- rithms. In Proc. of STOC. 380 -388.\n\n- Kyunghyun Cho, Bart van Merriënboer, Dzmitry Bahadanau, and Yoshua Ben- gio. 2014. On the Properties of Neural Machine Translation: Encoder-Decoder Approaches. In Proc. of SSST-8, Eighth Workshop on Syntax, Semantics and Structure in Statistical Translation. 103 -111.\n\n- Ronan Collobert, Jason Weston, Leon Bottou, Michael Karlen, Koray Kavukcuoglu, and Pavel Kuska. 2011. Natural Language Processing (almost) from Scratch. Journal of Machine Learning Research 12 (2011), 2493 -2537.\n\n- Gao Cong, Long Wang, Chin-Yew Lin, Young-In Song, and Yueheng Sun. 2008. Finding Question-answer Pairs from Online Forums. In Proc. of SIGIR. 467- 474. https://doi.org/10.1145/1390334.1390415\n\n- Zichao Dai, Aixin Sun, and Xu-Ying Liu. 2013. CREST: Cluster-based Repre- sentation Enrichment for Short Text Classification. In Advances in Knowledge Discovery and Data Mining. 256 -267.\n\n- Cicero dos Santos and Maira Gatti. 2014. Deep Convolutional Neural Networks for Sentiment Analysis of Short Texts. In Proc. of COLING. 69-78. http: //www.aclweb.org/anthology/C14-1008\n\n- Hui Fang. 2008. A Re-examination of Query Expansion Using Lexical Resources. In Proc. of ACL. 139-147.\n\n- Zhiguo Gong, Chan Wa Cheang, and Leong Hou U. 2005. Web Query Expansion by WordNet. In Proc. of DEXA. 166 -175.\n\n- Hu Guan, Jinguy Zhou, and Minyi Guo. 2009. A Class-Feature-Centroid Clas- sifier for Text Categorization. In Proc. of WWW. 201 -210.\n\n- Xiaofei He and Partha Niyogi. 2003. Locality Preserving Projections. In Proc. of NIPS. 153 -160.\n\n- Felix Hill, Kyunghyun Cho, and Anna Korhonen. 2016a. Learning Disributed Representations of Sentences from Unlabelled Data. In Proc. of NAACL-HLT. 1367-1377.\n\n- Felix Hill, KyungHyun Cho, Anna Korhonen, and Yoshua Bengio. 2016b. Learning to Understand Phrases by Embedding the Dictionary. Trans- actions of the Association for Computational Linguistics 4 (2016), 17-30. https://tacl2013.cs.columbia.edu/ojs/index.php/tacl/article/view/711\n\n- Sepp Hochreiter and Jürgen Schmidhuber. 1997. Long Short-Term Memory. Neural Computation 9, 8 (1997), 1735 -1780.\n\n- Minqing Hu and Bing Liu. 2004. Mining and Summarizing Customer Reviews. In KDD 2004. 168-177.\n\n- Wenpeng Hu, Jiajun Zhang, and Nan Zheng. 2016. Different Contexts Lead to Different Word Embeddings. In Proceedings of COLING 2016, the 26th International Conference on Computational Linguistics: Technical Papers. The COLING 2016 Organizing Committee, Osaka, Japan, 762-771. http: //aclweb.org/anthology/C16-1073\n\n- Eric H. Huang, Richard Socher, Christopher D. Manning, and Andrew Y. Ng. 2012. Improving Word Representations via Global Context and Multiple Word Prototypes. In ACL'12. 873 -882.\n\n- Ignacio Iacobacci, Mohammed Taher Pilehvar, and Roberto Navigli. 2015a. SenseEmbed: Learning Sense Embeddings for Word and Relational Similarty. In Proc. of ACL. 95-105.\n\n- Ignacio Iacobacci, Mohammad Taher Pilehvar, and Roberto Navigli. 2015b. SensEmbed: Learning Sense Embeddings for Word and Relational Similarity. In Proceedings of the 53rd Annual Meeting of the Association for Compu- tational Linguistics and the 7th International Joint Conference on Natural Language Processing (Volume 1: Long Papers). Association for Computa- tional Linguistics, Beijing, China, 95-105. http://www.aclweb.org/anthology/ P15-1010\n\n- Piotr Indyk and Rajeev Motwani. 1998. Approximate Nearest Neighbors: to- wards removing the curse of dimensionality. In Proc. of STOC. 604 -613.\n\n- Richard Johansson and Luis Nieto Piña. 2015. Embedding a Semantic Network in a Word Space. In Proceedings of the 2015 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies. Association for Computational Linguistics, Denver, Colorado, 1428-1433. http://www.aclweb.org/anthology/N15-1164\n\n- Yoon Kim. 2014. Convolutional Neural Networks for Sentence Classification. In Proceedings of the 2014 Conference on Empirical Methods in Natural Language Processing (EMNLP). Association for Computational Linguistics, Doha, Qatar, 1746-1751. http://www.aclweb.org/anthology/D14-1181\n\n- Ryan Kiros, Yukun Zhu, Ruslan Salakhutdinov, Richard S. Zemel, Antonio Torralba, Raquel Urtasun, and Sanja Fidler. 2015. Skip-Thought Vectors. In Proc. of Advances in Neural Information Processing Systems (NIPS). 3276- 3284.\n\n- Zornista Kozareva and Eduard Hovy. 2010. Not All Seeds Are Equal: Measuring the Quality of Text Mining Seeds. In Proc. of NAACL-HLT. 618 -626.\n\n- Bing kun Wang, Yong feng Huang, Wan xia Yang, and Xing Li. 2012. Short text classification based on strong feature thesaurus. Journal of Zhejiang University-SCIENCE C (Computers and Electronics) 13, 9 (2012), 649 -659.\n\n- Haewoon Kwak, Changhyun Lee, Hosung Park, and Sue Moon. 2010. What is Twitter, a Social Network or a News Media?. In Proc. of WWW. 591-600. https://doi.org/10.1145/1772690.1772751\n\n- Quoc Le and Tomas Mikolov. 2014. Distributed Representations of Sentences and Documents. In Proc. of ICML. 1188 -1196.\n\n- Jiwei Li and Dan Jurafsky. 2015. Do Multi-Sense Embeddings Improve Nat- ural Language Understanding?. In Proceedings of the 2015 Conference on Empirical Methods in Natural Language Processing. Association for Com- putational Linguistics, Lisbon, Portugal, 1722-1732. http://aclweb.org/ anthology/D15-1200\n\n- Juzheng Li, Jun Zhu, and Bo Zhang. 2016b. Discriminative Deep Random Walk for Network Classification. In Proceedings of the 54th Annual Meet- ing of the Association for Computational Linguistics (Volume 1: Long Pa- pers). Association for Computational Linguistics, Berlin, Germany, 1004- 1013. http://www.aclweb.org/anthology/P16-1095\n\n- Shaohua Li, Tat-Seng Chua, Jun Zhu, and Chunyan Miao. 2016a. Generative Topic Embedding: a Continuous Representation of Documents. In Proc. of ACL. 666-675.\n\n- Pengfei Liu, Xipeng Qiu, and Xuangjing 2015b. Learning Context- Sensitive Word Embeddings with Neural Tensor Skip-Gram Model. In Proc. of IJCAI. 1284-1290.\n\n- Yang Liu, Zhiyuan Liu, Tat-Seng Chua, and Maosong Sun. 2015a. Topical Word Embeddings. In Proc. of AAAI. 2418-2424.\n\n- Zhengdong Lu and Hang Li. 2013. A Deep Architecture for Matching Short Texts. In Proc. of NIPS. 1367 -1375.\n\n- Yuan Man. 2014. Feature Extension for Short Text Categorization Using Fre- quent Term Sets. In Proc. Int'l Conf. on Information Technology and Quan- titative Management. 663 -670.\n\n- Christopher D. Manning and Hinrich Schutze. 1999. Foundations of Statistical Natural Language Processing. MIT Press, Cambridge, Massachusetts.\n\n- Rada Mihalcea and Dragomir Radev. 2011. Graph-based Natural Language Pro- cessing and Information Retrieval. Cambridge University Press.\n\n- Tomas Mikolov, Kai Chen, and Jeffrey Dean. 2013. Efficient estimation of word representation in vector space, In Proc. of International Conference on Learning Representations. CoRR.\n\n- George A. Miller. 1995. WordNet: A Lexical Database for English. Commun. ACM 38, 11 (November 1995), 39 -41.\n\n- Arvind Neelakantan, Jeevan Shankar, Alexandre Passos, and Andrew McCal- lum. 2014. Efficient Non-parametric Estimation of Multiple Embeddings per Word in Vector Space. In Proceedings of the 2014 Conference on Empirical Methods in Natural Language Processing (EMNLP). Association for Com- putational Linguistics, Doha, Qatar, 1059-1069. https://www.youtube.com/ watch?v=EeBj4TyW8B8&feature=youtu.be\n\n- Lawrence Page, Sergey Brin, Rajeev Motwani, and Terry Winograd. 1999. The PageRank Citation Ranking: Bringing Order to the Web. Technical Report SIDL-WP-1999-0120. Stanford InfoLab.\n\n- Sinno Jialin Pan, Xiaochuan Ni, Jian-Tao Sun, Qiang Yang, and Zheng Chen. 2010. Cross-Domain Sentiment Classification via Spectral Feature Alignment. In Proc. of WWW. 751 -760.\n\n- Bo Pang and Lillian Lee. 2004. A Sentimental Education: Sentiment Analysis Using Subjectivity Summarization Based on Minimum Cuts. In Proceedings of the ACL.\n\n- Bo Pang and Lillian Lee. 2005. Seeing stars: Exploiting class relationships for sentiment categorization with respect to rating scales. In ACL 2005. 115-124.\n\n- Jeffery Pennington, Richard Socher, and Christopher D. Manning. 2014. GloVe: global vectors for word representation. In Proc. of EMNLP. 1532 -1543.\n\n- Bryan Perozzi, Rami Al-Rfou, and Steven Skiena. 2014. DeepWalk: On- line Learning of Social Representations. In Proceedings of the 20th ACM SIGKDD International Conference on Knowledge Discovery and Data Min- ing (KDD '14). ACM, New York, NY, USA, 701-710. https://doi.org/10. 1145/2623330.2623732\n\n- Aniket Rangrej, Sayali Kulkarni, and Ashish V. Tendulkar. 2011. Comparative Study of Clustering Techniques for Short Text Documents. In Proc. of WWW. 111 -112.\n\n- Deepak Ravichandran, Patrick Pantel, and Eduard Hovy. 2005. Randomized algorithms and NLP: using locality sensitive hash functions for high speed noun clustering. In ACL'05. 622 -629.\n\n- Joseph Reisinger and Raymond J. Mooney. 2010. Multi-Prototype Vector-Space Models of Word Meaning. In Proc. of HLT-NAACL. 109-117.\n\n- Takeshi Sakaki, Makoto Okazaki, and Yutaka Matsuo. 2010. Earthquake Shakes Twitter Uers: Real-time Event Detection by Social Sensors. In Proc. of WWW. 851-860.\n\n- G. Salton and C. Buckley. 1983. Introduction to Modern Information Retreival. McGraw-Hill Book Company.\n\n- Bei Shi, Wai Lam, Shoaib Jameel, Steven Schockaert, and Kwun Ping Lai. 2017. Jointly Learning Word Embeddings and Latent Topics. In Proc. of SIGIR. 375-384.\n\n- Linfeng Song, Zhiguo Wang, Haitao Mi, and Daniel Gildea. 2016. Sense Em- bedding Learning for Word Sense Induction. arXiv (2016).\n\n- Nitish Srivastava, Geoffrey Hinton, Alex Krizhevsky, Ilya Sutskever, and Ruslan Salakhutdinov. 2014. Dropout: A Simple Way to Prevent Neural Network from Overfitting. Journal of Machine Learning Research 15 (2014), 1929 - 1958.\n\n- Jiang Su, Jelber Sayyad-Shirabad, and Stan Matwin. 2011. Large Scale Text Classification using Semi-supervised Multinomial Naive Bayes. In Proc. of ICML.\n\n- Jian Tang, Meng Qu, Mingzhe Wang, Ming Zhang, Jun Yan, and Qiaozhu Mei. 2015. LINE: Large-scale Information Network Embedding. In Proc. of the 24th International Conference on World Wide Web. 1067-1077.\n\n- Mike Thelwall, Kevan Buckley, Georgios Paltoglou, Di Cai, and Arvind Kappas. 2010. Sentiment strength detection in short informal text. Journal of the American Society for Information Science and Technology 61, 12 (December 2010), 2544 -2558.\n\n- Jason Weston, Sumit Chopra, and Keith Adams. 2014. #TagSpace: Seman- tic Embeddings from Hashtags. In Proceedings of the 2014 Conference on Empirical Methods in Natural Language Processing (EMNLP). Association for Computational Linguistics, Doha, Qatar, 1822-1827. http://www.aclweb. org/anthology/D14-1194\n\n- Xiaohui Yan, Jiafeng Guo, Yanyan Lan, and Xueqi Cheng. 2013. A Biterm Topic Model for Short Texts. In Proc. of WWW. 1445 -1456.\n\n- Shansong Yang, Weiming Lu, Dezhi Yang, Liang Yao, and Baogang Wei. 2015. Short Text Understanding by Leveraging Knowledge into Topic Model. In Proc. of NAACL-HLT. Association for Computational Linguistics, 1232- 1237.\n\n- Dani Yogatama and Noah A. Smith. 2014. Making the Most of Bag of Words: Sentence Regularization with Alternating Direction Method of Multipliers. In Proc. of ICML. 656 -664.\n\n- Yukun Zhu, Ryan Kiros, Richard Zemel, Ruslan Salakhutdinov, Raquel Urta- sun, Antonio Torralba, and Sanja Fidler. 2015. Aligning Books and Movies: Towards Story-like Visual Explanations by Watching Movies and Reading Books. In arXiv preprint arXiv:1506.06724.\n\n", "annotations": {"ReferenceToTable": [{"begin": 29130, "end": 29131, "idx": 0}, {"begin": 31861, "end": 31862, "idx": 1}, {"begin": 32111, "end": 32112, "idx": 2}, {"begin": 32360, "end": 32361, "idx": 3}, {"begin": 32889, "end": 32890, "idx": 4}, {"begin": 36541, "end": 36542, "idx": 5}, {"begin": 45397, "end": 45398, "idx": 6}, {"begin": 69439, "end": 69440, "target": "#tab_0", "idx": 7}, {"begin": 73794, "end": 73795, "target": "#tab_0", "idx": 8}, {"begin": 74103, "end": 74104, "target": "#tab_0", "idx": 9}, {"begin": 77571, "end": 77572, "target": "#tab_1", "idx": 10}, {"begin": 78653, "end": 78654, "target": "#tab_1", "idx": 11}, {"begin": 81056, "end": 81057, "target": "#tab_1", "idx": 12}, {"begin": 81760, "end": 81761, "target": "#tab_2", "idx": 13}, {"begin": 82043, "end": 82044, "target": "#tab_2", "idx": 14}, {"begin": 82266, "end": 82267, "target": "#tab_2", "idx": 15}], "ReferenceToFootnote": [{"begin": 65489, "end": 65490, "target": "#foot_0", "idx": 0}, {"begin": 66152, "end": 66153, "target": "#foot_1", "idx": 1}], "SectionMain": [{"begin": 2055, "end": 89399, "idx": 0}], "ReferenceToFormula": [{"begin": 40506, "end": 40507, "idx": 0}, {"begin": 40896, "end": 40897, "target": "#formula_13", "idx": 1}, {"begin": 55545, "end": 55547, "target": "#formula_21", "idx": 2}, {"begin": 60497, "end": 60499, "target": "#formula_25", "idx": 3}, {"begin": 60755, "end": 60757, "target": "#formula_25", "idx": 4}, {"begin": 60851, "end": 60853, "idx": 5}, {"begin": 62658, "end": 62660, "target": "#formula_28", "idx": 6}, {"begin": 62668, "end": 62670, "target": "#formula_29", "idx": 7}, {"begin": 62915, "end": 62917, "target": "#formula_30", "idx": 8}, {"begin": 62925, "end": 62927, "target": "#formula_31", "idx": 9}, {"begin": 65301, "end": 65303, "target": "#formula_34", "idx": 10}], "SectionReference": [{"begin": 89513, "end": 102332, "idx": 0}], "SectionHeader": [{"begin": 0, "end": 2055, "idx": 0}], "Div": [{"begin": 80, "end": 2047, "idx": 0}, {"begin": 2058, "end": 10966, "idx": 1}, {"begin": 10968, "end": 23437, "idx": 2}, {"begin": 23439, "end": 23452, "idx": 3}, {"begin": 23454, "end": 28101, "idx": 4}, {"begin": 28103, "end": 33461, "idx": 5}, {"begin": 33463, "end": 39698, "idx": 6}, {"begin": 39700, "end": 43672, "idx": 7}, {"begin": 43674, "end": 45894, "idx": 8}, {"begin": 45896, "end": 46661, "idx": 9}, {"begin": 46663, "end": 46918, "idx": 10}, {"begin": 46920, "end": 48051, "idx": 11}, {"begin": 48053, "end": 48844, "idx": 12}, {"begin": 48846, "end": 50314, "idx": 13}, {"begin": 50316, "end": 51536, "idx": 14}, {"begin": 51538, "end": 58546, "idx": 15}, {"begin": 58548, "end": 62023, "idx": 16}, {"begin": 62025, "end": 63772, "idx": 17}, {"begin": 63774, "end": 65491, "idx": 18}, {"begin": 65493, "end": 67747, "idx": 19}, {"begin": 67749, "end": 76664, "idx": 20}, {"begin": 76666, "end": 81722, "idx": 21}, {"begin": 81724, "end": 83619, "idx": 22}, {"begin": 83621, "end": 84829, "idx": 23}, {"begin": 84831, "end": 87986, "idx": 24}, {"begin": 87988, "end": 89399, "idx": 25}], "Head": [{"begin": 2058, "end": 2072, "n": "1", "idx": 0}, {"begin": 10968, "end": 10982, "n": "2", "idx": 1}, {"begin": 23439, "end": 23451, "n": "3", "idx": 2}, {"begin": 23454, "end": 23466, "n": "3.1", "idx": 3}, {"begin": 28103, "end": 28126, "n": "3.2", "idx": 4}, {"begin": 33463, "end": 33502, "n": "3.3", "idx": 5}, {"begin": 39700, "end": 39718, "idx": 6}, {"begin": 43674, "end": 43713, "n": "3.4", "idx": 7}, {"begin": 45896, "end": 45915, "n": "4", "idx": 8}, {"begin": 46663, "end": 46690, "n": "4.1", "idx": 9}, {"begin": 46920, "end": 46947, "n": "4.1.1", "idx": 10}, {"begin": 48053, "end": 48079, "n": "4.1.2", "idx": 11}, {"begin": 48846, "end": 48875, "n": "4.1.3", "idx": 12}, {"begin": 50316, "end": 50348, "n": "4.1.4", "idx": 13}, {"begin": 51538, "end": 51566, "n": "4.2", "idx": 14}, {"begin": 58548, "end": 58586, "n": "5", "idx": 15}, {"begin": 62025, "end": 62055, "n": "5.1", "idx": 16}, {"begin": 63774, "end": 63825, "n": "5.2", "idx": 17}, {"begin": 65493, "end": 65506, "n": "6", "idx": 18}, {"begin": 67749, "end": 67789, "n": "6.1", "idx": 19}, {"begin": 76666, "end": 76715, "n": "6.2", "idx": 20}, {"begin": 81724, "end": 81750, "n": "6.3", "idx": 21}, {"begin": 83621, "end": 83653, "n": "6.4", "idx": 22}, {"begin": 84831, "end": 84863, "n": "6.5", "idx": 23}, {"begin": 87988, "end": 88000, "n": "7", "idx": 24}], "Paragraph": [{"begin": 80, "end": 1234, "idx": 0}, {"begin": 1235, "end": 2047, "idx": 1}, {"begin": 2073, "end": 3144, "idx": 2}, {"begin": 3145, "end": 4105, "idx": 3}, {"begin": 4106, "end": 5042, "idx": 4}, {"begin": 5043, "end": 6107, "idx": 5}, {"begin": 6108, "end": 7218, "idx": 6}, {"begin": 7219, "end": 8454, "idx": 7}, {"begin": 8455, "end": 9750, "idx": 8}, {"begin": 9751, "end": 9812, "idx": 9}, {"begin": 9813, "end": 10166, "idx": 10}, {"begin": 10167, "end": 10374, "idx": 11}, {"begin": 10375, "end": 10620, "idx": 12}, {"begin": 10621, "end": 10966, "idx": 13}, {"begin": 10983, "end": 11470, "idx": 14}, {"begin": 11471, "end": 12886, "idx": 15}, {"begin": 12887, "end": 14119, "idx": 16}, {"begin": 14120, "end": 15309, "idx": 17}, {"begin": 15310, "end": 16526, "idx": 18}, {"begin": 16527, "end": 17766, "idx": 19}, {"begin": 17767, "end": 18810, "idx": 20}, {"begin": 18811, "end": 20222, "idx": 21}, {"begin": 20223, "end": 21368, "idx": 22}, {"begin": 21369, "end": 23437, "idx": 23}, {"begin": 23467, "end": 23859, "idx": 24}, {"begin": 23860, "end": 24631, "idx": 25}, {"begin": 24632, "end": 25756, "idx": 26}, {"begin": 25757, "end": 27197, "idx": 27}, {"begin": 27198, "end": 28101, "idx": 28}, {"begin": 28127, "end": 28634, "idx": 29}, {"begin": 28659, "end": 28767, "idx": 30}, {"begin": 28792, "end": 29123, "idx": 31}, {"begin": 29124, "end": 29239, "idx": 32}, {"begin": 29307, "end": 30113, "idx": 33}, {"begin": 30129, "end": 30679, "idx": 34}, {"begin": 30696, "end": 31678, "idx": 35}, {"begin": 31679, "end": 32084, "idx": 36}, {"begin": 32085, "end": 32142, "idx": 37}, {"begin": 32170, "end": 32747, "idx": 38}, {"begin": 32748, "end": 33461, "idx": 39}, {"begin": 33503, "end": 33968, "idx": 40}, {"begin": 33969, "end": 34435, "idx": 41}, {"begin": 34447, "end": 34796, "idx": 42}, {"begin": 34797, "end": 36171, "idx": 43}, {"begin": 36172, "end": 37256, "idx": 44}, {"begin": 37257, "end": 37981, "idx": 45}, {"begin": 37982, "end": 38713, "idx": 46}, {"begin": 38763, "end": 39098, "idx": 47}, {"begin": 39099, "end": 39422, "idx": 48}, {"begin": 39520, "end": 39698, "idx": 49}, {"begin": 39719, "end": 39871, "idx": 50}, {"begin": 39935, "end": 39938, "idx": 51}, {"begin": 39939, "end": 40152, "idx": 52}, {"begin": 40214, "end": 40451, "idx": 53}, {"begin": 40499, "end": 40534, "idx": 54}, {"begin": 40586, "end": 40793, "idx": 55}, {"begin": 40889, "end": 40915, "idx": 56}, {"begin": 40975, "end": 42483, "idx": 57}, {"begin": 42484, "end": 43672, "idx": 58}, {"begin": 43714, "end": 44574, "idx": 59}, {"begin": 44575, "end": 45243, "idx": 60}, {"begin": 45289, "end": 45342, "idx": 61}, {"begin": 45377, "end": 45417, "idx": 62}, {"begin": 45456, "end": 45894, "idx": 63}, {"begin": 45916, "end": 46149, "idx": 64}, {"begin": 46150, "end": 46661, "idx": 65}, {"begin": 46691, "end": 46918, "idx": 66}, {"begin": 46948, "end": 47419, "idx": 67}, {"begin": 47420, "end": 48051, "idx": 68}, {"begin": 48080, "end": 48844, "idx": 69}, {"begin": 48876, "end": 49499, "idx": 70}, {"begin": 49500, "end": 50314, "idx": 71}, {"begin": 50349, "end": 51536, "idx": 72}, {"begin": 51567, "end": 52157, "idx": 73}, {"begin": 52158, "end": 52793, "idx": 74}, {"begin": 52794, "end": 54102, "idx": 75}, {"begin": 54103, "end": 54649, "idx": 76}, {"begin": 54727, "end": 54800, "idx": 77}, {"begin": 54829, "end": 54966, "idx": 78}, {"begin": 54967, "end": 55207, "idx": 79}, {"begin": 55247, "end": 55348, "idx": 80}, {"begin": 55421, "end": 56643, "idx": 81}, {"begin": 56644, "end": 58032, "idx": 82}, {"begin": 58033, "end": 58546, "idx": 83}, {"begin": 58587, "end": 59272, "idx": 84}, {"begin": 59273, "end": 59377, "idx": 85}, {"begin": 59412, "end": 59943, "idx": 86}, {"begin": 59986, "end": 60321, "idx": 87}, {"begin": 60322, "end": 60501, "idx": 88}, {"begin": 60569, "end": 60954, "idx": 89}, {"begin": 61069, "end": 61202, "idx": 90}, {"begin": 61225, "end": 62023, "idx": 91}, {"begin": 62056, "end": 62403, "idx": 92}, {"begin": 62504, "end": 62800, "idx": 93}, {"begin": 62878, "end": 63000, "idx": 94}, {"begin": 63069, "end": 63772, "idx": 95}, {"begin": 63826, "end": 64145, "idx": 96}, {"begin": 64146, "end": 64704, "idx": 97}, {"begin": 64790, "end": 65266, "idx": 98}, {"begin": 65294, "end": 65491, "idx": 99}, {"begin": 65507, "end": 66046, "idx": 100}, {"begin": 66047, "end": 67094, "idx": 101}, {"begin": 67095, "end": 67747, "idx": 102}, {"begin": 67790, "end": 68734, "idx": 103}, {"begin": 68735, "end": 69432, "idx": 104}, {"begin": 69433, "end": 69524, "idx": 105}, {"begin": 69525, "end": 69895, "idx": 106}, {"begin": 69896, "end": 69961, "idx": 107}, {"begin": 69962, "end": 70317, "idx": 108}, {"begin": 70318, "end": 70844, "idx": 109}, {"begin": 70845, "end": 72391, "idx": 110}, {"begin": 72392, "end": 73007, "idx": 111}, {"begin": 73008, "end": 73535, "idx": 112}, {"begin": 73536, "end": 73715, "idx": 113}, {"begin": 73716, "end": 75512, "idx": 114}, {"begin": 75513, "end": 76179, "idx": 115}, {"begin": 76180, "end": 76664, "idx": 116}, {"begin": 76716, "end": 77561, "idx": 117}, {"begin": 77562, "end": 78596, "idx": 118}, {"begin": 78597, "end": 79725, "idx": 119}, {"begin": 79726, "end": 81044, "idx": 120}, {"begin": 81045, "end": 81722, "idx": 121}, {"begin": 81751, "end": 82409, "idx": 122}, {"begin": 82410, "end": 83619, "idx": 123}, {"begin": 83654, "end": 84829, "idx": 124}, {"begin": 84864, "end": 86255, "idx": 125}, {"begin": 86256, "end": 86461, "idx": 126}, {"begin": 86490, "end": 86686, "idx": 127}, {"begin": 86687, "end": 87986, "idx": 128}, {"begin": 88001, "end": 89399, "idx": 129}], "ReferenceToBib": [{"begin": 2254, "end": 2273, "target": "#b30", "idx": 0}, {"begin": 2413, "end": 2432, "target": "#b9", "idx": 1}, {"begin": 2433, "end": 2455, "target": "#b60", "idx": 2}, {"begin": 2971, "end": 2999, "target": "#b11", "idx": 3}, {"begin": 3000, "end": 3022, "target": "#b29", "idx": 4}, {"begin": 3045, "end": 3066, "target": "#b53", "idx": 5}, {"begin": 3196, "end": 3215, "target": "#b14", "idx": 6}, {"begin": 3216, "end": 3232, "target": "#b58", "idx": 7}, {"begin": 3233, "end": 3258, "target": "#b64", "idx": 8}, {"begin": 5239, "end": 5265, "target": "#b54", "idx": 9}, {"begin": 5376, "end": 5404, "target": "#b5", "idx": 10}, {"begin": 8249, "end": 8275, "target": "#b40", "idx": 11}, {"begin": 11788, "end": 11811, "target": "#b29", "idx": 12}, {"begin": 11812, "end": 11829, "target": "#b62", "idx": 13}, {"begin": 11830, "end": 11848, "target": "#b63", "idx": 14}, {"begin": 11861, "end": 11879, "target": "#b10", "idx": 15}, {"begin": 11880, "end": 11901, "target": "#b50", "idx": 16}, {"begin": 11932, "end": 11954, "idx": 17}, {"begin": 11955, "end": 11972, "target": "#b45", "idx": 18}, {"begin": 11975, "end": 12010, "target": "#b29", "idx": 19}, {"begin": 12417, "end": 12435, "target": "#b62", "idx": 20}, {"begin": 12662, "end": 12693, "target": "#b63", "idx": 21}, {"begin": 13164, "end": 13193, "target": "#b10", "idx": 22}, {"begin": 13763, "end": 13792, "target": "#b45", "idx": 23}, {"begin": 14164, "end": 14185, "target": "#b2", "idx": 24}, {"begin": 14186, "end": 14211, "idx": 25}, {"begin": 15550, "end": 15578, "target": "#b11", "idx": 26}, {"begin": 15579, "end": 15600, "target": "#b31", "idx": 27}, {"begin": 15601, "end": 15617, "target": "#b37", "idx": 28}, {"begin": 15725, "end": 15745, "target": "#b16", "idx": 29}, {"begin": 15746, "end": 15765, "target": "#b27", "idx": 30}, {"begin": 16329, "end": 16351, "target": "#b41", "idx": 31}, {"begin": 16352, "end": 16376, "target": "#b48", "idx": 32}, {"begin": 16739, "end": 16770, "target": "#b4", "idx": 33}, {"begin": 16771, "end": 16787, "target": "#b20", "idx": 34}, {"begin": 16788, "end": 16812, "target": "#b22", "idx": 35}, {"begin": 16813, "end": 16844, "target": "#b25", "idx": 36}, {"begin": 16845, "end": 16867, "target": "#b32", "idx": 37}, {"begin": 16868, "end": 16895, "target": "#b52", "idx": 38}, {"begin": 16896, "end": 16914, "target": "#b56", "idx": 39}, {"begin": 17094, "end": 17121, "target": "#b52", "idx": 40}, {"begin": 17261, "end": 17280, "target": "#b21", "idx": 41}, {"begin": 17371, "end": 17396, "target": "#b43", "idx": 42}, {"begin": 17568, "end": 17590, "target": "#b41", "idx": 43}, {"begin": 18054, "end": 18080, "target": "#b43", "idx": 44}, {"begin": 18186, "end": 18210, "target": "#b23", "idx": 45}, {"begin": 18466, "end": 18491, "target": "#b23", "idx": 46}, {"begin": 18520, "end": 18550, "target": "#b4", "idx": 47}, {"begin": 18614, "end": 18628, "target": "#b42", "idx": 48}, {"begin": 19368, "end": 19386, "target": "#b36", "idx": 49}, {"begin": 19511, "end": 19530, "target": "#b1", "idx": 50}, {"begin": 19575, "end": 19593, "target": "#b35", "idx": 51}, {"begin": 19788, "end": 19805, "target": "#b55", "idx": 52}, {"begin": 19985, "end": 20003, "target": "#b34", "idx": 53}, {"begin": 20939, "end": 20967, "target": "#b5", "idx": 54}, {"begin": 20996, "end": 21016, "target": "#b17", "idx": 55}, {"begin": 21057, "end": 21078, "target": "#b61", "idx": 56}, {"begin": 21560, "end": 21578, "target": "#b33", "idx": 57}, {"begin": 21579, "end": 21600, "target": "#b49", "idx": 58}, {"begin": 21601, "end": 21619, "target": "#b59", "idx": 59}, {"begin": 21653, "end": 21672, "target": "#b59", "idx": 60}, {"begin": 21993, "end": 22014, "target": "#b49", "idx": 61}, {"begin": 22192, "end": 22214, "target": "#b41", "idx": 62}, {"begin": 22217, "end": 22245, "target": "#b33", "idx": 63}, {"begin": 22426, "end": 22457, "target": "#b59", "idx": 64}, {"begin": 29972, "end": 29996, "target": "#b3", "idx": 65}, {"begin": 39627, "end": 39651, "target": "#b0", "idx": 66}, {"begin": 39652, "end": 39672, "target": "#b15", "idx": 67}, {"begin": 39673, "end": 39697, "target": "#b24", "idx": 68}, {"begin": 41659, "end": 41684, "target": "#b24", "idx": 69}, {"begin": 41888, "end": 41904, "target": "#b6", "idx": 70}, {"begin": 41977, "end": 42004, "target": "#b51", "idx": 71}, {"begin": 43976, "end": 44002, "target": "#b40", "idx": 72}, {"begin": 44216, "end": 44243, "target": "#b39", "idx": 73}, {"begin": 53320, "end": 53345, "target": "#b28", "idx": 74}, {"begin": 66244, "end": 66264, "target": "#b47", "idx": 75}, {"begin": 66350, "end": 66367, "target": "#b19", "idx": 76}, {"begin": 66454, "end": 66473, "target": "#b46", "idx": 77}, {"begin": 70285, "end": 70297, "target": "#b12", "idx": 78}, {"begin": 70298, "end": 70316, "target": "#b13", "idx": 79}, {"begin": 71217, "end": 71254, "idx": 80}, {"begin": 71991, "end": 72013, "idx": 81}, {"begin": 73359, "end": 73381, "target": "#b41", "idx": 82}, {"begin": 77111, "end": 77131, "target": "#b27", "idx": 83}, {"begin": 77142, "end": 77162, "target": "#b16", "idx": 84}, {"begin": 77182, "end": 77204, "target": "#b31", "idx": 85}, {"begin": 77700, "end": 77720, "target": "#b27", "idx": 86}, {"begin": 77891, "end": 77909, "target": "#b65", "idx": 87}, {"begin": 78669, "end": 78689, "target": "#b27", "idx": 88}, {"begin": 78818, "end": 78836, "target": "#b7", "idx": 89}, {"begin": 78847, "end": 78866, "target": "#b16", "idx": 90}, {"begin": 79397, "end": 79416, "target": "#b16", "idx": 91}, {"begin": 79483, "end": 79517, "target": "#b18", "idx": 92}, {"begin": 79886, "end": 79896, "target": "#b26", "idx": 93}, {"begin": 80544, "end": 80568, "target": "#b8", "idx": 94}, {"begin": 80815, "end": 80840, "target": "#b57", "idx": 95}, {"begin": 82286, "end": 82345, "idx": 96}, {"begin": 84809, "end": 84828, "target": "#b44", "idx": 97}], "ReferenceString": [{"begin": 89528, "end": 89687, "id": "b0", "idx": 0}, {"begin": 89689, "end": 89832, "id": "b1", "idx": 1}, {"begin": 89836, "end": 90013, "id": "b2", "idx": 2}, {"begin": 90017, "end": 90164, "id": "b3", "idx": 3}, {"begin": 90168, "end": 90575, "id": "b4", "idx": 4}, {"begin": 90579, "end": 90741, "id": "b5", "idx": 5}, {"begin": 90745, "end": 90855, "id": "b6", "idx": 6}, {"begin": 90859, "end": 91127, "id": "b7", "idx": 7}, {"begin": 91131, "end": 91343, "id": "b8", "idx": 8}, {"begin": 91347, "end": 91538, "id": "b9", "idx": 9}, {"begin": 91542, "end": 91729, "id": "b10", "idx": 10}, {"begin": 91733, "end": 91916, "id": "b11", "idx": 11}, {"begin": 91920, "end": 92022, "id": "b12", "idx": 12}, {"begin": 92026, "end": 92137, "id": "b13", "idx": 13}, {"begin": 92141, "end": 92273, "id": "b14", "idx": 14}, {"begin": 92277, "end": 92373, "id": "b15", "idx": 15}, {"begin": 92377, "end": 92534, "id": "b16", "idx": 16}, {"begin": 92538, "end": 92815, "id": "b17", "idx": 17}, {"begin": 92819, "end": 92932, "id": "b18", "idx": 18}, {"begin": 92936, "end": 93029, "id": "b19", "idx": 19}, {"begin": 93033, "end": 93345, "id": "b20", "idx": 20}, {"begin": 93349, "end": 93528, "id": "b21", "idx": 21}, {"begin": 93532, "end": 93701, "id": "b22", "idx": 22}, {"begin": 93705, "end": 94152, "id": "b23", "idx": 23}, {"begin": 94156, "end": 94300, "id": "b24", "idx": 24}, {"begin": 94304, "end": 94654, "id": "b25", "idx": 25}, {"begin": 94658, "end": 94939, "id": "b26", "idx": 26}, {"begin": 94943, "end": 95167, "id": "b27", "idx": 27}, {"begin": 95171, "end": 95313, "id": "b28", "idx": 28}, {"begin": 95317, "end": 95535, "id": "b29", "idx": 29}, {"begin": 95539, "end": 95718, "id": "b30", "idx": 30}, {"begin": 95722, "end": 95840, "id": "b31", "idx": 31}, {"begin": 95844, "end": 96148, "id": "b32", "idx": 32}, {"begin": 96152, "end": 96486, "id": "b33", "idx": 33}, {"begin": 96490, "end": 96646, "id": "b34", "idx": 34}, {"begin": 96650, "end": 96805, "id": "b35", "idx": 35}, {"begin": 96809, "end": 96924, "id": "b36", "idx": 36}, {"begin": 96928, "end": 97035, "id": "b37", "idx": 37}, {"begin": 97039, "end": 97218, "id": "b38", "idx": 38}, {"begin": 97222, "end": 97364, "id": "b39", "idx": 39}, {"begin": 97368, "end": 97504, "id": "b40", "idx": 40}, {"begin": 97508, "end": 97689, "id": "b41", "idx": 41}, {"begin": 97693, "end": 97801, "id": "b42", "idx": 42}, {"begin": 97805, "end": 98202, "id": "b43", "idx": 43}, {"begin": 98206, "end": 98387, "id": "b44", "idx": 44}, {"begin": 98391, "end": 98567, "id": "b45", "idx": 45}, {"begin": 98571, "end": 98728, "id": "b46", "idx": 46}, {"begin": 98732, "end": 98889, "id": "b47", "idx": 47}, {"begin": 98893, "end": 99040, "id": "b48", "idx": 48}, {"begin": 99044, "end": 99341, "id": "b49", "idx": 49}, {"begin": 99345, "end": 99504, "id": "b50", "idx": 50}, {"begin": 99508, "end": 99691, "id": "b51", "idx": 51}, {"begin": 99695, "end": 99825, "id": "b52", "idx": 52}, {"begin": 99829, "end": 99988, "id": "b53", "idx": 53}, {"begin": 99992, "end": 100095, "id": "b54", "idx": 54}, {"begin": 100099, "end": 100255, "id": "b55", "idx": 55}, {"begin": 100259, "end": 100388, "id": "b56", "idx": 56}, {"begin": 100392, "end": 100619, "id": "b57", "idx": 57}, {"begin": 100623, "end": 100776, "id": "b58", "idx": 58}, {"begin": 100780, "end": 100982, "id": "b59", "idx": 59}, {"begin": 100986, "end": 101228, "id": "b60", "idx": 60}, {"begin": 101232, "end": 101538, "id": "b61", "idx": 61}, {"begin": 101542, "end": 101669, "id": "b62", "idx": 62}, {"begin": 101673, "end": 101890, "id": "b63", "idx": 63}, {"begin": 101894, "end": 102067, "id": "b64", "idx": 64}, {"begin": 102071, "end": 102330, "id": "b65", "idx": 65}], "Sentence": [{"begin": 80, "end": 198, "idx": 0}, {"begin": 199, "end": 398, "idx": 1}, {"begin": 399, "end": 564, "idx": 2}, {"begin": 565, "end": 716, "idx": 3}, {"begin": 717, "end": 889, "idx": 4}, {"begin": 890, "end": 1047, "idx": 5}, {"begin": 1048, "end": 1234, "idx": 6}, {"begin": 1235, "end": 1352, "idx": 7}, {"begin": 1353, "end": 1440, "idx": 8}, {"begin": 1441, "end": 1599, "idx": 9}, {"begin": 1600, "end": 1724, "idx": 10}, {"begin": 1725, "end": 1808, "idx": 11}, {"begin": 1809, "end": 2047, "idx": 12}, {"begin": 2073, "end": 2149, "idx": 13}, {"begin": 2150, "end": 2274, "idx": 14}, {"begin": 2275, "end": 2456, "idx": 15}, {"begin": 2457, "end": 2603, "idx": 16}, {"begin": 2604, "end": 2849, "idx": 17}, {"begin": 2850, "end": 3144, "idx": 18}, {"begin": 3145, "end": 3397, "idx": 19}, {"begin": 3398, "end": 3563, "idx": 20}, {"begin": 3564, "end": 3668, "idx": 21}, {"begin": 3669, "end": 3979, "idx": 22}, {"begin": 3980, "end": 4105, "idx": 23}, {"begin": 4106, "end": 4221, "idx": 24}, {"begin": 4222, "end": 4316, "idx": 25}, {"begin": 4317, "end": 4452, "idx": 26}, {"begin": 4453, "end": 4617, "idx": 27}, {"begin": 4618, "end": 4867, "idx": 28}, {"begin": 4868, "end": 5042, "idx": 29}, {"begin": 5043, "end": 5405, "idx": 30}, {"begin": 5406, "end": 5525, "idx": 31}, {"begin": 5526, "end": 5705, "idx": 32}, {"begin": 5706, "end": 5821, "idx": 33}, {"begin": 5822, "end": 5967, "idx": 34}, {"begin": 5968, "end": 6107, "idx": 35}, {"begin": 6108, "end": 6216, "idx": 36}, {"begin": 6217, "end": 6366, "idx": 37}, {"begin": 6367, "end": 6529, "idx": 38}, {"begin": 6530, "end": 6662, "idx": 39}, {"begin": 6663, "end": 6856, "idx": 40}, {"begin": 6857, "end": 7001, "idx": 41}, {"begin": 7002, "end": 7218, "idx": 42}, {"begin": 7219, "end": 7397, "idx": 43}, {"begin": 7398, "end": 7515, "idx": 44}, {"begin": 7516, "end": 7574, "idx": 45}, {"begin": 7575, "end": 7770, "idx": 46}, {"begin": 7771, "end": 7923, "idx": 47}, {"begin": 7924, "end": 8082, "idx": 48}, {"begin": 8083, "end": 8276, "idx": 49}, {"begin": 8277, "end": 8454, "idx": 50}, {"begin": 8455, "end": 8644, "idx": 51}, {"begin": 8645, "end": 8955, "idx": 52}, {"begin": 8956, "end": 9074, "idx": 53}, {"begin": 9075, "end": 9356, "idx": 54}, {"begin": 9357, "end": 9750, "idx": 55}, {"begin": 9751, "end": 9812, "idx": 56}, {"begin": 9813, "end": 9933, "idx": 57}, {"begin": 9934, "end": 10166, "idx": 58}, {"begin": 10167, "end": 10240, "idx": 59}, {"begin": 10241, "end": 10374, "idx": 60}, {"begin": 10375, "end": 10509, "idx": 61}, {"begin": 10510, "end": 10620, "idx": 62}, {"begin": 10621, "end": 10728, "idx": 63}, {"begin": 10729, "end": 10966, "idx": 64}, {"begin": 10983, "end": 11071, "idx": 65}, {"begin": 11072, "end": 11397, "idx": 66}, {"begin": 11398, "end": 11470, "idx": 67}, {"begin": 11471, "end": 11686, "idx": 68}, {"begin": 11687, "end": 11973, "idx": 69}, {"begin": 11974, "end": 12122, "idx": 70}, {"begin": 12123, "end": 12253, "idx": 71}, {"begin": 12254, "end": 12391, "idx": 72}, {"begin": 12392, "end": 12557, "idx": 73}, {"begin": 12558, "end": 12775, "idx": 74}, {"begin": 12776, "end": 12886, "idx": 75}, {"begin": 12887, "end": 12998, "idx": 76}, {"begin": 12999, "end": 13090, "idx": 77}, {"begin": 13091, "end": 13162, "idx": 78}, {"begin": 13163, "end": 13413, "idx": 79}, {"begin": 13414, "end": 13540, "idx": 80}, {"begin": 13541, "end": 13761, "idx": 81}, {"begin": 13762, "end": 13927, "idx": 82}, {"begin": 13928, "end": 14119, "idx": 83}, {"begin": 14120, "end": 14373, "idx": 84}, {"begin": 14374, "end": 14463, "idx": 85}, {"begin": 14464, "end": 14668, "idx": 86}, {"begin": 14669, "end": 14818, "idx": 87}, {"begin": 14819, "end": 15015, "idx": 88}, {"begin": 15016, "end": 15145, "idx": 89}, {"begin": 15146, "end": 15309, "idx": 90}, {"begin": 15310, "end": 15618, "idx": 91}, {"begin": 15619, "end": 15874, "idx": 92}, {"begin": 15875, "end": 15954, "idx": 93}, {"begin": 15955, "end": 16041, "idx": 94}, {"begin": 16042, "end": 16225, "idx": 95}, {"begin": 16226, "end": 16377, "idx": 96}, {"begin": 16378, "end": 16526, "idx": 97}, {"begin": 16527, "end": 16566, "idx": 98}, {"begin": 16567, "end": 16645, "idx": 99}, {"begin": 16646, "end": 16915, "idx": 100}, {"begin": 16916, "end": 17080, "idx": 101}, {"begin": 17081, "end": 17369, "idx": 102}, {"begin": 17370, "end": 17591, "idx": 103}, {"begin": 17592, "end": 17766, "idx": 104}, {"begin": 17767, "end": 17998, "idx": 105}, {"begin": 17999, "end": 18166, "idx": 106}, {"begin": 18167, "end": 18508, "idx": 107}, {"begin": 18509, "end": 18643, "idx": 108}, {"begin": 18644, "end": 18810, "idx": 109}, {"begin": 18811, "end": 18936, "idx": 110}, {"begin": 18937, "end": 19083, "idx": 111}, {"begin": 19084, "end": 19162, "idx": 112}, {"begin": 19163, "end": 19197, "idx": 113}, {"begin": 19198, "end": 19366, "idx": 114}, {"begin": 19367, "end": 19573, "idx": 115}, {"begin": 19574, "end": 19730, "idx": 116}, {"begin": 19731, "end": 19975, "idx": 117}, {"begin": 19976, "end": 20222, "idx": 118}, {"begin": 20223, "end": 20457, "idx": 119}, {"begin": 20458, "end": 20703, "idx": 120}, {"begin": 20704, "end": 21079, "idx": 121}, {"begin": 21080, "end": 21209, "idx": 122}, {"begin": 21210, "end": 21368, "idx": 123}, {"begin": 21369, "end": 21620, "idx": 124}, {"begin": 21621, "end": 21834, "idx": 125}, {"begin": 21835, "end": 21982, "idx": 126}, {"begin": 21983, "end": 22215, "idx": 127}, {"begin": 22216, "end": 22424, "idx": 128}, {"begin": 22425, "end": 22633, "idx": 129}, {"begin": 22634, "end": 22826, "idx": 130}, {"begin": 22827, "end": 23012, "idx": 131}, {"begin": 23013, "end": 23163, "idx": 132}, {"begin": 23164, "end": 23259, "idx": 133}, {"begin": 23260, "end": 23437, "idx": 134}, {"begin": 23467, "end": 23537, "idx": 135}, {"begin": 23538, "end": 23629, "idx": 136}, {"begin": 23630, "end": 23716, "idx": 137}, {"begin": 23717, "end": 23859, "idx": 138}, {"begin": 23860, "end": 23963, "idx": 139}, {"begin": 23964, "end": 24092, "idx": 140}, {"begin": 24093, "end": 24206, "idx": 141}, {"begin": 24207, "end": 24322, "idx": 142}, {"begin": 24323, "end": 24399, "idx": 143}, {"begin": 24400, "end": 24631, "idx": 144}, {"begin": 24632, "end": 24681, "idx": 145}, {"begin": 24682, "end": 24799, "idx": 146}, {"begin": 24800, "end": 24897, "idx": 147}, {"begin": 24898, "end": 25074, "idx": 148}, {"begin": 25075, "end": 25256, "idx": 149}, {"begin": 25257, "end": 25394, "idx": 150}, {"begin": 25395, "end": 25521, "idx": 151}, {"begin": 25522, "end": 25667, "idx": 152}, {"begin": 25668, "end": 25756, "idx": 153}, {"begin": 25757, "end": 25877, "idx": 154}, {"begin": 25878, "end": 25977, "idx": 155}, {"begin": 25978, "end": 26118, "idx": 156}, {"begin": 26119, "end": 26221, "idx": 157}, {"begin": 26222, "end": 26590, "idx": 158}, {"begin": 26591, "end": 26713, "idx": 159}, {"begin": 26714, "end": 26894, "idx": 160}, {"begin": 26895, "end": 26955, "idx": 161}, {"begin": 26956, "end": 27093, "idx": 162}, {"begin": 27094, "end": 27197, "idx": 163}, {"begin": 27198, "end": 27463, "idx": 164}, {"begin": 27464, "end": 27548, "idx": 165}, {"begin": 27549, "end": 27658, "idx": 166}, {"begin": 27659, "end": 27774, "idx": 167}, {"begin": 27775, "end": 27971, "idx": 168}, {"begin": 27972, "end": 28101, "idx": 169}, {"begin": 28127, "end": 28254, "idx": 170}, {"begin": 28255, "end": 28518, "idx": 171}, {"begin": 28519, "end": 28634, "idx": 172}, {"begin": 28659, "end": 28732, "idx": 173}, {"begin": 28733, "end": 28767, "idx": 174}, {"begin": 28792, "end": 28827, "idx": 175}, {"begin": 28828, "end": 28922, "idx": 176}, {"begin": 28923, "end": 29054, "idx": 177}, {"begin": 29055, "end": 29095, "idx": 178}, {"begin": 29096, "end": 29123, "idx": 179}, {"begin": 29124, "end": 29239, "idx": 180}, {"begin": 29307, "end": 29467, "idx": 181}, {"begin": 29468, "end": 29683, "idx": 182}, {"begin": 29684, "end": 29870, "idx": 183}, {"begin": 29871, "end": 30113, "idx": 184}, {"begin": 30129, "end": 30131, "idx": 185}, {"begin": 30132, "end": 30253, "idx": 186}, {"begin": 30254, "end": 30367, "idx": 187}, {"begin": 30368, "end": 30626, "idx": 188}, {"begin": 30627, "end": 30679, "idx": 189}, {"begin": 30696, "end": 30744, "idx": 190}, {"begin": 30745, "end": 30888, "idx": 191}, {"begin": 30889, "end": 31003, "idx": 192}, {"begin": 31004, "end": 31084, "idx": 193}, {"begin": 31085, "end": 31180, "idx": 194}, {"begin": 31181, "end": 31378, "idx": 195}, {"begin": 31379, "end": 31493, "idx": 196}, {"begin": 31494, "end": 31678, "idx": 197}, {"begin": 31679, "end": 31780, "idx": 198}, {"begin": 31781, "end": 31863, "idx": 199}, {"begin": 31864, "end": 31947, "idx": 200}, {"begin": 31948, "end": 32084, "idx": 201}, {"begin": 32085, "end": 32142, "idx": 202}, {"begin": 32170, "end": 32257, "idx": 203}, {"begin": 32258, "end": 32470, "idx": 204}, {"begin": 32471, "end": 32608, "idx": 205}, {"begin": 32609, "end": 32747, "idx": 206}, {"begin": 32748, "end": 32798, "idx": 207}, {"begin": 32799, "end": 32891, "idx": 208}, {"begin": 32892, "end": 33021, "idx": 209}, {"begin": 33022, "end": 33164, "idx": 210}, {"begin": 33165, "end": 33284, "idx": 211}, {"begin": 33285, "end": 33461, "idx": 212}, {"begin": 33503, "end": 33597, "idx": 213}, {"begin": 33598, "end": 33832, "idx": 214}, {"begin": 33833, "end": 33968, "idx": 215}, {"begin": 33969, "end": 34218, "idx": 216}, {"begin": 34219, "end": 34435, "idx": 217}, {"begin": 34447, "end": 34547, "idx": 218}, {"begin": 34548, "end": 34663, "idx": 219}, {"begin": 34664, "end": 34726, "idx": 220}, {"begin": 34727, "end": 34796, "idx": 221}, {"begin": 34797, "end": 34934, "idx": 222}, {"begin": 34935, "end": 35033, "idx": 223}, {"begin": 35034, "end": 35147, "idx": 224}, {"begin": 35148, "end": 35306, "idx": 225}, {"begin": 35307, "end": 35457, "idx": 226}, {"begin": 35458, "end": 35550, "idx": 227}, {"begin": 35551, "end": 35782, "idx": 228}, {"begin": 35783, "end": 35934, "idx": 229}, {"begin": 35935, "end": 36080, "idx": 230}, {"begin": 36081, "end": 36171, "idx": 231}, {"begin": 36172, "end": 36635, "idx": 232}, {"begin": 36636, "end": 36884, "idx": 233}, {"begin": 36885, "end": 36989, "idx": 234}, {"begin": 36990, "end": 37129, "idx": 235}, {"begin": 37130, "end": 37256, "idx": 236}, {"begin": 37257, "end": 37320, "idx": 237}, {"begin": 37321, "end": 37431, "idx": 238}, {"begin": 37432, "end": 37541, "idx": 239}, {"begin": 37542, "end": 37778, "idx": 240}, {"begin": 37779, "end": 37981, "idx": 241}, {"begin": 37982, "end": 38200, "idx": 242}, {"begin": 38201, "end": 38377, "idx": 243}, {"begin": 38378, "end": 38448, "idx": 244}, {"begin": 38449, "end": 38627, "idx": 245}, {"begin": 38628, "end": 38713, "idx": 246}, {"begin": 38763, "end": 38936, "idx": 247}, {"begin": 38937, "end": 39098, "idx": 248}, {"begin": 39099, "end": 39109, "idx": 249}, {"begin": 39110, "end": 39285, "idx": 250}, {"begin": 39286, "end": 39338, "idx": 251}, {"begin": 39339, "end": 39422, "idx": 252}, {"begin": 39520, "end": 39698, "idx": 253}, {"begin": 39719, "end": 39823, "idx": 254}, {"begin": 39824, "end": 39871, "idx": 255}, {"begin": 39935, "end": 39938, "idx": 256}, {"begin": 39939, "end": 40152, "idx": 257}, {"begin": 40214, "end": 40362, "idx": 258}, {"begin": 40363, "end": 40451, "idx": 259}, {"begin": 40499, "end": 40534, "idx": 260}, {"begin": 40586, "end": 40793, "idx": 261}, {"begin": 40889, "end": 40915, "idx": 262}, {"begin": 40975, "end": 41139, "idx": 263}, {"begin": 41140, "end": 41349, "idx": 264}, {"begin": 41350, "end": 41439, "idx": 265}, {"begin": 41440, "end": 41607, "idx": 266}, {"begin": 41608, "end": 41752, "idx": 267}, {"begin": 41753, "end": 41905, "idx": 268}, {"begin": 41906, "end": 42074, "idx": 269}, {"begin": 42075, "end": 42269, "idx": 270}, {"begin": 42270, "end": 42483, "idx": 271}, {"begin": 42484, "end": 42697, "idx": 272}, {"begin": 42698, "end": 42902, "idx": 273}, {"begin": 42903, "end": 43031, "idx": 274}, {"begin": 43032, "end": 43162, "idx": 275}, {"begin": 43163, "end": 43327, "idx": 276}, {"begin": 43328, "end": 43395, "idx": 277}, {"begin": 43396, "end": 43578, "idx": 278}, {"begin": 43579, "end": 43672, "idx": 279}, {"begin": 43714, "end": 43879, "idx": 280}, {"begin": 43880, "end": 44003, "idx": 281}, {"begin": 44004, "end": 44244, "idx": 282}, {"begin": 44245, "end": 44427, "idx": 283}, {"begin": 44428, "end": 44574, "idx": 284}, {"begin": 44575, "end": 44835, "idx": 285}, {"begin": 44836, "end": 44930, "idx": 286}, {"begin": 44931, "end": 45047, "idx": 287}, {"begin": 45048, "end": 45173, "idx": 288}, {"begin": 45174, "end": 45243, "idx": 289}, {"begin": 45289, "end": 45342, "idx": 290}, {"begin": 45377, "end": 45417, "idx": 291}, {"begin": 45456, "end": 45539, "idx": 292}, {"begin": 45540, "end": 45674, "idx": 293}, {"begin": 45675, "end": 45894, "idx": 294}, {"begin": 45916, "end": 46100, "idx": 295}, {"begin": 46101, "end": 46149, "idx": 296}, {"begin": 46150, "end": 46199, "idx": 297}, {"begin": 46200, "end": 46314, "idx": 298}, {"begin": 46315, "end": 46661, "idx": 299}, {"begin": 46691, "end": 46844, "idx": 300}, {"begin": 46845, "end": 46918, "idx": 301}, {"begin": 46948, "end": 47064, "idx": 302}, {"begin": 47065, "end": 47203, "idx": 303}, {"begin": 47204, "end": 47294, "idx": 304}, {"begin": 47295, "end": 47419, "idx": 305}, {"begin": 47420, "end": 47542, "idx": 306}, {"begin": 47543, "end": 47626, "idx": 307}, {"begin": 47627, "end": 47811, "idx": 308}, {"begin": 47812, "end": 48051, "idx": 309}, {"begin": 48080, "end": 48291, "idx": 310}, {"begin": 48292, "end": 48359, "idx": 311}, {"begin": 48360, "end": 48519, "idx": 312}, {"begin": 48520, "end": 48700, "idx": 313}, {"begin": 48701, "end": 48844, "idx": 314}, {"begin": 48876, "end": 49095, "idx": 315}, {"begin": 49096, "end": 49206, "idx": 316}, {"begin": 49207, "end": 49422, "idx": 317}, {"begin": 49423, "end": 49499, "idx": 318}, {"begin": 49500, "end": 49602, "idx": 319}, {"begin": 49603, "end": 49725, "idx": 320}, {"begin": 49726, "end": 49815, "idx": 321}, {"begin": 49816, "end": 49908, "idx": 322}, {"begin": 49909, "end": 50098, "idx": 323}, {"begin": 50099, "end": 50254, "idx": 324}, {"begin": 50255, "end": 50314, "idx": 325}, {"begin": 50349, "end": 50505, "idx": 326}, {"begin": 50506, "end": 50743, "idx": 327}, {"begin": 50744, "end": 50858, "idx": 328}, {"begin": 50859, "end": 50981, "idx": 329}, {"begin": 50982, "end": 51300, "idx": 330}, {"begin": 51301, "end": 51536, "idx": 331}, {"begin": 51567, "end": 51752, "idx": 332}, {"begin": 51753, "end": 51810, "idx": 333}, {"begin": 51811, "end": 51924, "idx": 334}, {"begin": 51925, "end": 52157, "idx": 335}, {"begin": 52158, "end": 52244, "idx": 336}, {"begin": 52245, "end": 52405, "idx": 337}, {"begin": 52406, "end": 52686, "idx": 338}, {"begin": 52687, "end": 52793, "idx": 339}, {"begin": 52794, "end": 52880, "idx": 340}, {"begin": 52881, "end": 52984, "idx": 341}, {"begin": 52985, "end": 53223, "idx": 342}, {"begin": 53224, "end": 53346, "idx": 343}, {"begin": 53347, "end": 53610, "idx": 344}, {"begin": 53611, "end": 53838, "idx": 345}, {"begin": 53839, "end": 54013, "idx": 346}, {"begin": 54014, "end": 54102, "idx": 347}, {"begin": 54103, "end": 54209, "idx": 348}, {"begin": 54210, "end": 54341, "idx": 349}, {"begin": 54342, "end": 54453, "idx": 350}, {"begin": 54454, "end": 54571, "idx": 351}, {"begin": 54572, "end": 54649, "idx": 352}, {"begin": 54727, "end": 54800, "idx": 353}, {"begin": 54829, "end": 54966, "idx": 354}, {"begin": 54967, "end": 55021, "idx": 355}, {"begin": 55022, "end": 55031, "idx": 356}, {"begin": 55032, "end": 55151, "idx": 357}, {"begin": 55152, "end": 55207, "idx": 358}, {"begin": 55247, "end": 55348, "idx": 359}, {"begin": 55421, "end": 55549, "idx": 360}, {"begin": 55550, "end": 55713, "idx": 361}, {"begin": 55714, "end": 55838, "idx": 362}, {"begin": 55839, "end": 55888, "idx": 363}, {"begin": 55889, "end": 56237, "idx": 364}, {"begin": 56238, "end": 56335, "idx": 365}, {"begin": 56336, "end": 56507, "idx": 366}, {"begin": 56508, "end": 56643, "idx": 367}, {"begin": 56644, "end": 56764, "idx": 368}, {"begin": 56765, "end": 56966, "idx": 369}, {"begin": 56967, "end": 57123, "idx": 370}, {"begin": 57124, "end": 57415, "idx": 371}, {"begin": 57416, "end": 57662, "idx": 372}, {"begin": 57663, "end": 57830, "idx": 373}, {"begin": 57831, "end": 58032, "idx": 374}, {"begin": 58033, "end": 58107, "idx": 375}, {"begin": 58108, "end": 58218, "idx": 376}, {"begin": 58219, "end": 58460, "idx": 377}, {"begin": 58461, "end": 58546, "idx": 378}, {"begin": 58587, "end": 58770, "idx": 379}, {"begin": 58771, "end": 58915, "idx": 380}, {"begin": 58916, "end": 59106, "idx": 381}, {"begin": 59107, "end": 59197, "idx": 382}, {"begin": 59198, "end": 59272, "idx": 383}, {"begin": 59273, "end": 59377, "idx": 384}, {"begin": 59412, "end": 59536, "idx": 385}, {"begin": 59537, "end": 59638, "idx": 386}, {"begin": 59639, "end": 59720, "idx": 387}, {"begin": 59721, "end": 59842, "idx": 388}, {"begin": 59843, "end": 59943, "idx": 389}, {"begin": 59986, "end": 60138, "idx": 390}, {"begin": 60139, "end": 60321, "idx": 391}, {"begin": 60322, "end": 60501, "idx": 392}, {"begin": 60569, "end": 60636, "idx": 393}, {"begin": 60637, "end": 60838, "idx": 394}, {"begin": 60839, "end": 60954, "idx": 395}, {"begin": 61069, "end": 61186, "idx": 396}, {"begin": 61187, "end": 61202, "idx": 397}, {"begin": 61225, "end": 61376, "idx": 398}, {"begin": 61377, "end": 61458, "idx": 399}, {"begin": 61459, "end": 61587, "idx": 400}, {"begin": 61588, "end": 61808, "idx": 401}, {"begin": 61809, "end": 62023, "idx": 402}, {"begin": 62056, "end": 62167, "idx": 403}, {"begin": 62168, "end": 62302, "idx": 404}, {"begin": 62303, "end": 62403, "idx": 405}, {"begin": 62504, "end": 62612, "idx": 406}, {"begin": 62613, "end": 62800, "idx": 407}, {"begin": 62878, "end": 63000, "idx": 408}, {"begin": 63069, "end": 63192, "idx": 409}, {"begin": 63193, "end": 63343, "idx": 410}, {"begin": 63344, "end": 63437, "idx": 411}, {"begin": 63438, "end": 63657, "idx": 412}, {"begin": 63658, "end": 63772, "idx": 413}, {"begin": 63826, "end": 63968, "idx": 414}, {"begin": 63969, "end": 64145, "idx": 415}, {"begin": 64146, "end": 64254, "idx": 416}, {"begin": 64255, "end": 64352, "idx": 417}, {"begin": 64353, "end": 64572, "idx": 418}, {"begin": 64573, "end": 64704, "idx": 419}, {"begin": 64790, "end": 64925, "idx": 420}, {"begin": 64926, "end": 65005, "idx": 421}, {"begin": 65006, "end": 65125, "idx": 422}, {"begin": 65126, "end": 65266, "idx": 423}, {"begin": 65294, "end": 65491, "idx": 424}, {"begin": 65507, "end": 65602, "idx": 425}, {"begin": 65603, "end": 65682, "idx": 426}, {"begin": 65683, "end": 65890, "idx": 427}, {"begin": 65891, "end": 65958, "idx": 428}, {"begin": 65959, "end": 66046, "idx": 429}, {"begin": 66047, "end": 66529, "idx": 430}, {"begin": 66530, "end": 66681, "idx": 431}, {"begin": 66682, "end": 66753, "idx": 432}, {"begin": 66754, "end": 66842, "idx": 433}, {"begin": 66843, "end": 66943, "idx": 434}, {"begin": 66944, "end": 67094, "idx": 435}, {"begin": 67095, "end": 67193, "idx": 436}, {"begin": 67194, "end": 67379, "idx": 437}, {"begin": 67380, "end": 67534, "idx": 438}, {"begin": 67535, "end": 67747, "idx": 439}, {"begin": 67790, "end": 67920, "idx": 440}, {"begin": 67921, "end": 68095, "idx": 441}, {"begin": 68096, "end": 68331, "idx": 442}, {"begin": 68332, "end": 68504, "idx": 443}, {"begin": 68505, "end": 68561, "idx": 444}, {"begin": 68562, "end": 68734, "idx": 445}, {"begin": 68735, "end": 68919, "idx": 446}, {"begin": 68920, "end": 69105, "idx": 447}, {"begin": 69106, "end": 69204, "idx": 448}, {"begin": 69205, "end": 69326, "idx": 449}, {"begin": 69327, "end": 69432, "idx": 450}, {"begin": 69433, "end": 69524, "idx": 451}, {"begin": 69525, "end": 69593, "idx": 452}, {"begin": 69594, "end": 69730, "idx": 453}, {"begin": 69731, "end": 69845, "idx": 454}, {"begin": 69846, "end": 69895, "idx": 455}, {"begin": 69896, "end": 69961, "idx": 456}, {"begin": 69962, "end": 70026, "idx": 457}, {"begin": 70027, "end": 70094, "idx": 458}, {"begin": 70095, "end": 70165, "idx": 459}, {"begin": 70166, "end": 70317, "idx": 460}, {"begin": 70318, "end": 70493, "idx": 461}, {"begin": 70494, "end": 70587, "idx": 462}, {"begin": 70588, "end": 70746, "idx": 463}, {"begin": 70747, "end": 70844, "idx": 464}, {"begin": 70845, "end": 71054, "idx": 465}, {"begin": 71055, "end": 71305, "idx": 466}, {"begin": 71306, "end": 71441, "idx": 467}, {"begin": 71442, "end": 71715, "idx": 468}, {"begin": 71716, "end": 71791, "idx": 469}, {"begin": 71792, "end": 71957, "idx": 470}, {"begin": 71958, "end": 72065, "idx": 471}, {"begin": 72066, "end": 72217, "idx": 472}, {"begin": 72218, "end": 72311, "idx": 473}, {"begin": 72312, "end": 72391, "idx": 474}, {"begin": 72392, "end": 72462, "idx": 475}, {"begin": 72463, "end": 72551, "idx": 476}, {"begin": 72552, "end": 72681, "idx": 477}, {"begin": 72682, "end": 72866, "idx": 478}, {"begin": 72867, "end": 73007, "idx": 479}, {"begin": 73008, "end": 73220, "idx": 480}, {"begin": 73221, "end": 73535, "idx": 481}, {"begin": 73536, "end": 73669, "idx": 482}, {"begin": 73670, "end": 73715, "idx": 483}, {"begin": 73716, "end": 74091, "idx": 484}, {"begin": 74092, "end": 74213, "idx": 485}, {"begin": 74214, "end": 74384, "idx": 486}, {"begin": 74385, "end": 74593, "idx": 487}, {"begin": 74594, "end": 74831, "idx": 488}, {"begin": 74832, "end": 74985, "idx": 489}, {"begin": 74986, "end": 75112, "idx": 490}, {"begin": 75113, "end": 75241, "idx": 491}, {"begin": 75242, "end": 75512, "idx": 492}, {"begin": 75513, "end": 75563, "idx": 493}, {"begin": 75564, "end": 75682, "idx": 494}, {"begin": 75683, "end": 75796, "idx": 495}, {"begin": 75797, "end": 75882, "idx": 496}, {"begin": 75883, "end": 76013, "idx": 497}, {"begin": 76014, "end": 76096, "idx": 498}, {"begin": 76097, "end": 76179, "idx": 499}, {"begin": 76180, "end": 76280, "idx": 500}, {"begin": 76281, "end": 76527, "idx": 501}, {"begin": 76528, "end": 76664, "idx": 502}, {"begin": 76716, "end": 76909, "idx": 503}, {"begin": 76910, "end": 77089, "idx": 504}, {"begin": 77090, "end": 77326, "idx": 505}, {"begin": 77327, "end": 77561, "idx": 506}, {"begin": 77562, "end": 77667, "idx": 507}, {"begin": 77668, "end": 77832, "idx": 508}, {"begin": 77833, "end": 77910, "idx": 509}, {"begin": 77911, "end": 77977, "idx": 510}, {"begin": 77978, "end": 78072, "idx": 511}, {"begin": 78073, "end": 78269, "idx": 512}, {"begin": 78270, "end": 78400, "idx": 513}, {"begin": 78401, "end": 78596, "idx": 514}, {"begin": 78597, "end": 78837, "idx": 515}, {"begin": 78838, "end": 78995, "idx": 516}, {"begin": 78996, "end": 79115, "idx": 517}, {"begin": 79116, "end": 79356, "idx": 518}, {"begin": 79357, "end": 79523, "idx": 519}, {"begin": 79524, "end": 79725, "idx": 520}, {"begin": 79726, "end": 79822, "idx": 521}, {"begin": 79823, "end": 79897, "idx": 522}, {"begin": 79898, "end": 80086, "idx": 523}, {"begin": 80087, "end": 80283, "idx": 524}, {"begin": 80284, "end": 80450, "idx": 525}, {"begin": 80451, "end": 80515, "idx": 526}, {"begin": 80516, "end": 80666, "idx": 527}, {"begin": 80667, "end": 80768, "idx": 528}, {"begin": 80769, "end": 80964, "idx": 529}, {"begin": 80965, "end": 81044, "idx": 530}, {"begin": 81045, "end": 81340, "idx": 531}, {"begin": 81341, "end": 81497, "idx": 532}, {"begin": 81498, "end": 81722, "idx": 533}, {"begin": 81751, "end": 81895, "idx": 534}, {"begin": 81896, "end": 82011, "idx": 535}, {"begin": 82012, "end": 82119, "idx": 536}, {"begin": 82120, "end": 82254, "idx": 537}, {"begin": 82255, "end": 82345, "idx": 538}, {"begin": 82346, "end": 82409, "idx": 539}, {"begin": 82410, "end": 82501, "idx": 540}, {"begin": 82502, "end": 82651, "idx": 541}, {"begin": 82652, "end": 82764, "idx": 542}, {"begin": 82765, "end": 82947, "idx": 543}, {"begin": 82948, "end": 83245, "idx": 544}, {"begin": 83246, "end": 83411, "idx": 545}, {"begin": 83412, "end": 83536, "idx": 546}, {"begin": 83537, "end": 83619, "idx": 547}, {"begin": 83654, "end": 84046, "idx": 548}, {"begin": 84047, "end": 84079, "idx": 549}, {"begin": 84080, "end": 84261, "idx": 550}, {"begin": 84262, "end": 84385, "idx": 551}, {"begin": 84386, "end": 84535, "idx": 552}, {"begin": 84536, "end": 84680, "idx": 553}, {"begin": 84681, "end": 84829, "idx": 554}, {"begin": 84864, "end": 85013, "idx": 555}, {"begin": 85014, "end": 85124, "idx": 556}, {"begin": 85125, "end": 85367, "idx": 557}, {"begin": 85368, "end": 85623, "idx": 558}, {"begin": 85624, "end": 85729, "idx": 559}, {"begin": 85730, "end": 85848, "idx": 560}, {"begin": 85849, "end": 85983, "idx": 561}, {"begin": 85984, "end": 86117, "idx": 562}, {"begin": 86118, "end": 86255, "idx": 563}, {"begin": 86256, "end": 86426, "idx": 564}, {"begin": 86427, "end": 86461, "idx": 565}, {"begin": 86490, "end": 86686, "idx": 566}, {"begin": 86687, "end": 86767, "idx": 567}, {"begin": 86768, "end": 86853, "idx": 568}, {"begin": 86854, "end": 86944, "idx": 569}, {"begin": 86945, "end": 87179, "idx": 570}, {"begin": 87180, "end": 87259, "idx": 571}, {"begin": 87260, "end": 87316, "idx": 572}, {"begin": 87317, "end": 87326, "idx": 573}, {"begin": 87327, "end": 87472, "idx": 574}, {"begin": 87473, "end": 87571, "idx": 575}, {"begin": 87572, "end": 87826, "idx": 576}, {"begin": 87827, "end": 87986, "idx": 577}, {"begin": 88001, "end": 88169, "idx": 578}, {"begin": 88170, "end": 88278, "idx": 579}, {"begin": 88279, "end": 88482, "idx": 580}, {"begin": 88483, "end": 88663, "idx": 581}, {"begin": 88664, "end": 88739, "idx": 582}, {"begin": 88740, "end": 89106, "idx": 583}, {"begin": 89107, "end": 89269, "idx": 584}, {"begin": 89270, "end": 89399, "idx": 585}], "ReferenceToFigure": [{"begin": 54207, "end": 54208, "target": "#fig_4", "idx": 0}, {"begin": 54466, "end": 54467, "target": "#fig_4", "idx": 1}, {"begin": 54763, "end": 54764, "target": "#fig_4", "idx": 2}, {"begin": 54836, "end": 54837, "idx": 3}, {"begin": 55184, "end": 55185, "target": "#fig_4", "idx": 4}, {"begin": 82417, "end": 82418, "target": "#fig_0", "idx": 5}, {"begin": 83045, "end": 83046, "target": "#fig_0", "idx": 6}, {"begin": 83263, "end": 83264, "target": "#fig_0", "idx": 7}, {"begin": 84077, "end": 84078, "target": "#fig_1", "idx": 8}, {"begin": 84274, "end": 84275, "target": "#fig_1", "idx": 9}, {"begin": 86694, "end": 86695, "target": "#fig_2", "idx": 10}, {"begin": 87136, "end": 87137, "target": "#fig_3", "idx": 11}, {"begin": 87176, "end": 87177, "target": "#fig_4", "idx": 12}], "Abstract": [{"begin": 70, "end": 2047, "idx": 0}], "SectionFootnote": [{"begin": 89401, "end": 89511, "idx": 0}], "Footnote": [{"begin": 89412, "end": 89460, "id": "foot_0", "n": "1", "idx": 0}, {"begin": 89461, "end": 89511, "id": "foot_1", "n": "2", "idx": 1}]}}