{"text": "Self-Supervised Learning of Generative Spin-Glasses with Normalizing Flows\n\nAbstract:\nSpin-glasses are universal models that can capture complex behavior of manybody systems at the interface of statistical physics and computer science including discrete optimization, inference in graphical models, and automated reasoning. Computing the underlying structure and dynamics of such complex systems is extremely difficult due to the combinatorial explosion of their state space. Here, we develop deep generative continuous spin-glass distributions with normalizing flows to model correlations in generic discrete problems. We use a self-supervised learning paradigm by automatically generating the data from the spin-glass itself. We demonstrate that key physical and computational properties of the spin-glass phase can be successfully learned, including multi-modal steady-state distributions and topological structures among metastable states. Remarkably, we observe that the learning itself corresponds to a spin-glass phase transition within the layers of the trained normalizing flows. The inverse normalizing flows learns to perform reversible multi-scale coarse-graining operations which are different from the typical irreversible renormalization group techniques.\n\nMain:\n\n\n\n1 Introduction\nDeveloping a deep understanding of the structure and dynamics of collective/emergent many-body phenomena in complex systems has been an elusive goal for decades across many disciplines, including physics, chemistry, biology, and computer science. Spin-glasses provide a prototypical and computationally universal language for such systems [1]. Indeed, there is a direct correspondence between finding the low energy states of spin-glasses and many important computational tasks, such as finding high-quality solutions in NP-hard combinatorial optimization problems [2] and performing sampling and inference in graphical models [3]. Metastable states and non-equilibrium dynamics of spin-glasses can also represent steady-state attractors in dynamical systems [4], associative memory retrieval in neuroscience [4], and the training and inference over energy-based models of neural networks [5].\nUnfortunately, the standard theoretical and computational techniques are intrinsically inadequate to tackle realistic spin-glasses systems of interest that are far from thermodynamic limit, exhibit long-ranged power-law interactions, and have intermediate spatial dimensions. These systems reside in an under-explored intermediate regime between the well-studied limiting cases of the short-range Edwards-Anderson [2] and infinite-range Sherrington-Kirkpatrick models [6]. The state space of these complex systems, which typically have a discrete structure, grows exponentially with the degrees of freedom, rendering brute-force approaches intractable [3]. Moreover, such systems often contain significant non-linearities or higher-order non-local correlations, which induce exotic underlying geometries for the system. Here, the disorders are the essence, or the main characteristic of each problem, not a perturbation over pure/idealized models such as regular lattices. Thus, these systems are not prone to typical analytical approaches such as perturbation theory.\nThere is no universal approach for studying such systems. Mean-field techniques could capture certain properties for some toy models in the thermodynamic limit, such as random energy models or p-spin models [7], but they fail to capture the properties of systems for which large fluctuations cause the mean-field approximation to break down [2]. In principle, the renormalization group (RG) could be used to capture critical or fixed point properties near a phase transition, but these methods are extremely hard to formalize for arbitrary systems [4]. Moreover, RG techniques typically have poor performance for problems of practical interest that tend to be highly inhomogeneous and disordered, and they often miss key computational properties as one has to crudely coarse-grain the microscopic degrees of freedom [4].\nRecent advances in deep learning could open up the possibility that important non-trivial and nonperturbative emergent properties could be machine-learned in an instance-wise fashion. Indeed, deep neural networks have already been used in many-body physics to identify phases and phase transitions for certain classical [8] and quantum critical systems [9, 10] and they have also been used to accelerate Monte Carlo sampling [11, 12, 13, 14]. However, the intrinsic strongly disordered and frustrated nature of spin-glasses defined over discrete variables significantly limits the applicability of machine learning algorithms to such systems.\nIn order to tackle such problem, we have recently developed a continuous probability density theory for spin-glass systems with generic connectivity graph and local fields that could reside in the unexplored regime of intermediate spatial dimensions [15]. Here, we are interested in using such continuous representation for learning low-energy states and critical properties of discrete spin-glass distributions described by the following family of HamiltoniansH = − i h i s i − i<j J ij s i s j ,\nwhere s i ∈ {−1, 1} is an Ising spin, J ij is the coupling matrix, h i is the external magnetic field, and i is an index which runs from 1 to N . The equilibrium properties of these systems at temperature T = 1/β are governed by the usual Boltzmann distributionp(s) = e −βH Z s ,\nwhere Z s is the partition function. This family of spin systems is very broad. It includes systems that are solvable using mean-field techniques as well as systems that continue to elude both theoretical and numerical treatments. Most methods for treating these spin systems aim to exploit some structure contained in the couplings J ij -for example, symmetries due to an underlying lattice structure.\nIn contrast, deep generative models are learned, thus allowing for bespoke methods tailored for a specific system or disorder realization. For this reason, the successful demonstration of deep generative spin-glass models is an important accomplishment which should have broad applications for combinatorial optimization, sampling, and inference.\nIn this work, we perform a first step towards achieving this goal and use normalizing flows [16] to model the well-known spin-glass system known as the Sherrington-Kirkpatrick (SK) model [6].\nThe SK model is a perfect system to test these new methods because it exhibits a spin-glass phase characterized by exponentially many metastable states separated by high energy barriers, and so represents a challenging family of distributions for the normalizing flow to learn. However, despite the complexity of the SK model, it still is amenable to theoretical treatments, and the model has been very thoroughly studied since it was introduced almost half a century ago. The SK model is therefore an excellent candidate for the first numerical experiment of this sort as it presents a formidable challenge, and at the same time the ground truth is known and can be used to verify our spin-glass learning algorithm. In this work, we will show that the SK model can be successfully machine-learned by normalizing flows. In future work, we hope to extend this success to more challenging spin-glasses relevant for computational problems of practical interest.\nThe layout of this paper is as follows. In Sec. 2, we briefly review the continuous formulation of spin-glasses introduced in [15] and use it to recast the SK model in terms of continuous variables. Then, in Sec. 3 we review and discuss normalizing flows from the perspective of statistical physics, and in Sec. 4 we successfully train normalizing flows to approximate the SK model, including in the spin-glass phase. We argue that the internal layers of the flow perform a kind of coarse-graining, and in Sec. 5 we show the evidence for a spin-glass phase transition within the normalizing flow itself. Lastly, we conclude with a discussion and outlook in Sec. 6.\n\n2 Probability density formulation of spin-glasses\nThe spin-glass family represented by Eq. 1 is defined in terms of discrete variables. However, many of the most promising recent algorithms for generative modeling, such as normalizing flows and Generative Adversarial Networks (GANs) [17], are formulated in terms of continuous variables. In many applications this fact is ignored, and the generative algorithm is nonetheless successfully trained on discrete data. In the context of physics-based applications, this was done in [18], in which GANs were trained to simulate the 2d Ising model. However, in this work, we shall make use the probability density formulation of discrete spin-glasses introduced recently in [15] to convert the Boltzmann distribution over discrete spin variables into a probability density defined over continuous variables. A similar approach was used by [14] to study the phase transition of the 2d Ising model using normalizing flows.\nIn the probability density formulation of spin-glasses, discrete Boltzmann distributions of the form p(s) = e −βH /Z s , with H given by Eq. 1, are equivalently described in terms of a continuous random variable x ∈ R N , with probability density p(x). The probability density may also be written as a Boltzmann distribution, i.e. p(x) = e −βH β (x) /Z x , where H β (x) is the Hamiltonian density, and the term density refers to how H β (x) transforms under a change of variables [15]. The Hamiltonian density is given byH β (x) := 1 2 x T Jx − 1 β N i=1 ln 2 cosh β Jx + h i .\nWe have added a subscript to the Hamiltonian density to emphasize its dependence on the inverse temperature.\nHereZ x = d N x e −βH β (x)\nis the partition function of the x-variable, which is related to the original partition function of the s-variable via:Z x = (2π) N/2 (det(β J)) −1/2 e N β∆ / 2 Z s .\nThe Hamiltonian density is written in terms of a shifted coupling matrix J, given byJ := J + ∆ 1 N ×N ,\nwhere ∆ := max(0, − λ 1 (J)) with 0 < 1. The shift ∆ ensures that p(x) is integrable.\nThe variable x may be interpreted as the integration variable in a somewhat non-standard application of the Hubbard-Stratonovich transformation. The probability density formulation of [15] (which builds off of the technique introduced in [19]) treats x and s as random variables with joint distribution p(x, s) and conditional distributions p(x|s), p(s|x). The conditional distribution p(x|s) is simply a multi-variate Gaussian:p(x|s) = N (µ, Σ) ,\nwith mean µ = s and covariance matrix Σ = (β J) −1 . The other conditional distribution is given byp(s|x) = N i=1 exp βs i Jx + h i 2 cosh βs i Jx + h i .\nImportantly, both conditional distributions are relatively easy to sample from. Thus, given a sample of the discrete spins s, a corresponding continuous configuration x may be easily obtained, and vice versa.\n\n2.1 The Sherrington-Kirkpatrick model\nAs mentioned in the introduction, the family of Boltzmann distributions with the Hamiltonian of Eq. 1 is very general. Therefore, as a first step towards answering the broader question of whether normalizing flows can successfully learn complex spin-glass distributions, we shall restrict our attention to one particular spin-glass, the SK model [6]. The SK model is defined by specifying that the couplings J ij be drawn from an iid Gaussian distribution:J ij ∼ N 0, J 2 N , (i < j) ,\nwhere the i > j values are fixed by the symmetry of J to be the same as the i < j values, and the diagonal entries are zero. In order to machine learn this complex distribution, we shall work in terms of the continuous variable x.\nDespite its simple form, the SK model is a toy model with a very rich theoretical structure. In particular, there is a spin-glass phase transition at a critical temperature of T crit = J . Above this temperature the spin-glass exists in a disordered phase. For lower temperatures ergodicity is broken by the appearance of an exponentially large number of metastable states separated by large energy barriers. Thus, the SK model represents an excellent testing ground for modeling complex spin-glass distributions using deep neural networks.\nA key result of [15] regarding the continuous formulation of spin-glass distributions is the existence of a convex/non-convex transition which occurs for the SK model at a temperature of T convex := 4J . (9) Above T convex the Hamiltonian density is convex, and it becomes non-convex as the temperature is lowered past this value. Importantly, T convex is much higher than the spin-glass critical temperature. Thus, it is not obvious a priori whether the continuous formulation will be useful for the task of machine learning the SK model, since p(x) becomes \"complex\" (i.e. has a non-convex energy landscape) well before the spin-glass phase appears.\n\n3 Normalizing flows and statistical physics\nIn this section, we introduce an application of real normalizing flows [16] for modeling statistical many-body systems with real degrees of freedom. Normalizing flows are mappings from a latent random variable z to a physical random variable x: x = G(z). The latent variable is drawn from a simple prior distribution, for example a multivariate Gaussian. The flow G transforms this into a new distribution p G (x), and in most machine learning applications the goal is then to modify the parameters of G such that this induced distribution closely matches some target distribution. In our case, x is the continuous spin variable introduced above, and the target distribution is the Boltzmann distribution p(x) = e −βH β (x) /Z x . We will argue below that the physical interpretation of z is that it provides a coarse-grained description of the system. Denoting the prior as p z (z), the distribution induced by the flow can be obtained using the change of variables formulap G (x) := p z (G −1 (x)) det ∂G −1 (x) ∂x ,\nwhere the second factor on the RHS is just due to the Jacobian of the transformation.\nReal Non-Volume Preserving (NVP) flows [20] are normalizing flows for which the mapping G is composed of multiple simpler invertible functions called affine layers, which we denote by g ( ) , and whose precise definition is given in Appendix A. Letting L denote the number of such layers, the flow may be defined recursively as G ( ) := g ( ) • G ( −1) , for = 1, ..., L, with the understanding that G (0) is the identity and G (L) corresponds to the complete flow. The output of each layer of the flow represents a random variable z( ) := G ( ) (z (0) ), with z (0) = z and z (L) = x.\nThe change of variables formula may be applied to each intermediate variable to obtain an expression for the associated probability density. For applications to statistical physics, it is useful to represent each of these as Boltzmann distributions. In other words, for each layer we introduce an associated Hamiltonian density H G ( ) implicitly defined byp(z ( ) ) := e −H G ( ) (z ( ) ) Z G . ()\nTaking the prior to be an isotropic Gaussian with zero-mean and standard deviation equal to one, the Hamiltonian density of the prior variable z is just the quadratic functionH G (0) (z) = 1 2 z T z . ()\nThe change of variable formula may then be used to obtain H G ( ) (z ( ) ) for any of the intermediate layers:H G ( ) (z ( ) ) := 1 2 G −1 ( ) (z ( ) ) T G −1 ( ) (z ( ) ) − ln det ∂G −1 ( ) (z ( ) ) ∂z ( ) .\nSimilarly, the flow partition function may be expressed as an integral over any of the z ( ) :Z G := d N z ( ) e −H G ( ) (z ( ) ) .\nEvaluating this expression for = 0, it is easily seen thatZ G = (2π) N/2 . 𝑡𝑟𝑎𝑖𝑛𝑖𝑛𝑔 ℋ ( (ℓ) ℋ ( (,) ℋ ( (-)\nℋ . ) serves as a better and better approximation to the physical one. We will first investigate two distinct training methods based on different objective functions, and evaluate how well the trained models are able to capture the key properties of the spin-glass phase. Later, in Sec. 5, we will present evidence that the trained flows implement a reversible coarse-graining on the physical system which is different than irreversible RG techniques.\n\nℋ ( (/)\n4 Self-supervised learning of deep generative spin-glass models\nSelf-Supervised learning generally refers to a machine learning paradigm where all the labels in the training data can be generated autonomously [21]. In this paradigm, the architecture and the learning process could be fully supervised, however one does not need to manually label the training data. For example, the data can be labelled automatically by finding or computing the correlations between different input signals. Self-supervised learning is intrinsically suitable for online learning when there is steady stream of the new data that should be automatically digested on the fly, or whenever robots/agents need to automatically adapting within a changing environment, or whenever new instances of data or partial data can be generated by the future output of the model itself. Here, we use two different self-supervised learning approaches to train our deep generative spin-glass models using forward or backward KL divergence on the data that is automatically generated by either Monte Carlo sampling or by the model itself respectively.\nGenerative models such as normalizing flows are typically trained by maximizing the log likelihood of some training data. Here, a priori we do not have any dataset, thus we need to generate our data; e.g.; through traditional Monte Carlo techniques such as parallel tempering [22]. Another major difference is that a tractable expression for the true probability distribution is known; i.e. the Boltzmann distribution over x ∈ R N with Hamiltonian density H β (x) is given by Eq. 3. This allows for two viable approaches towards training the flow to approximate the true distribution -one based on minimizing the reverse KL divergence and one based on minimizing the forward KL divergence.\n\n4.1 Reverse KL minimization\nIn this approach the loss function is given by the reverse Kullback-Liebler (KL) divergence, plus a constant offset:L reverse := KL (p G (x) || p(x)) − ln Z x . ()\nThe divergence is said to be \"reversed\" because in most machine learning applications the \"forward\" version KL (p(x) || p G (x)) is used. 1 This objective function was introduced as a way to train generative models in probability density distillation [23], and it was also used in [14] to train normalizing flows to approximate the 2d Ising model near criticality. An important requirement for this approach is that both the true density p(x) and the flow density p G (x) should be efficiently computable. The reverse loss function L reverse has an important interpretation in statistical physics; it is proportional to the Gibbs free energy:G x [p G (x)] := β −1 KL (p G (x) || p(x)) + F x ,\nwhere F x := −β −1 ln Z x is the Helmholtz free energy. The x subscript is meant to indicate that these free energies are associated with the continuous spin-glass distribution p(x), rather than the discrete one. Thus, minimization of the reverse KL loss is equivalent to the minimization of the Gibbs free energy. The global minimum is obtained when p G (x) = p(x), in which case the KL divergence vanishes and the Gibbs and Helmholtz free energies agree,G x [p(x)] = F x .\nIn order to employ this loss in a machine learning algorithm, we will make use of the fact that the reverse KL loss may also be written as an expectation over the prior:L reverse = E z∼pz(z) (βH β (G(z)) − H G (G(z))) .\nThus, rather than estimating a loss over a training set, with this training method the model itself generates a number of samples, and the loss is then estimated by computing the difference of the Hamiltonian densities (or equivalently, the log likelihoods). This therefore represents a potentially very powerful learning method, since the training is limited only by computational constraints, and not by the quantity or quality of data. Since the KL divergence is non-negative, this loss provides a lower bound for the loss function/Gibbs free energy:L reverse = β G x [p G (x)] ≥ βF x .\nThe tightness of this bound provides one measure of how well the flow has learned the spin-glass distribution.\n\n4.2 Forward KL minimization\nA more conventional approach towards training the normalizing flow is to first assemble an unlabeled dataset D = {x (i) } i=1,...,|D| consisting of spin-glass configurations distributed according to the Boltzmann distribution. We will generate such a dataset by performing Monte Carlo sampling of the true spin-glass distribution p(x). The loss function will then be taken to be the expectation of the negative log-likelihood over the dataset:L forward := −E x∼p(x) ln p G (x) . ()\nwhich is equivalent to the forward KL divergence plus the Shannon entropy of p(x):L forward = KL (p(x)||p G (x)) + H(p(x)) .\nL forward may also be written as the the cross entropy between p(x) and p G (x). Similar to the reverse KL loss function, the KL loss function is lower-bounded by the Shannon entropy,L forward ≥ H(p(x)) .\n\n4.3 Training deep generative spin-glasses with normalizing flows\nWe considered the problem of training normalizing flows to approximate the SK model for N = 256 spins 2 and 0 < T ≤ 5J , with the range of temperatures chosen to encompass both the spin-glass and paramagnetic phases of the SK model. This range extends far beyond the phase transition temperature of T crit = J so that we may study the effect of the transition between a convex and non-convex Hamiltonian density, which occurs for T convex = 4J . For each temperature, we considered 10 different realizations of the disorder (i.e. 10 random draws of the matrix J ij ). Also, we set = 0.01, so that the smallest eigenvalue of the shifted coupling matrix is λ 1 (J ∆ ) = 0.01 (which effectively adjusts T convex to be 4.01J ).\nWe performed experiments for both training methods discussed above, minimizing either the reverse KL divergence or the forward KL divergence. For the forward KL approach, we first assembled a dataset D of spin configurations using parallel-tempering (PT) (see for example [24]). We simulated 20 parallel systems (called replicas), each at a different temperature. We recorded the spin-configurations throughout the parallel tempering after each sweep of all N spins, until 100,000 samples had been obtained for each temperature. We then repeated this procedure for 10 realizations of the coupling matrix J ij . Lastly, to train the normalizing flow the discrete Ising spin configurations must be converted to continuous configurations. We used each spin configuration s to generate a single x configuration using the joint distribution x ∼ p(x|s) (given by Eq. 6).(p G (x)||p(x)) = β(G x − F x )\nshows that the quality of the normalizing flow approximation to the true Boltzmann distribution nonetheless becomes quite poor at low-temperatures. This is an indication that reverse KL-trained flow is not capturing key properties of the spin-glass phase at low-temperatures.\nIn Fig. 2 (a) we plot the reverse KL loss throughout the course of training. The loss is roughly constant for the first 100 iterations, after which it drops sharply. For T /J < T crit it then continues to decrease slowly with additional training. The magnitude of the drop increases for low temperatures.\nA measure of the quality of the trained flow may be obtained by examining the tightness of the free energy bound in Eq. 18, or equivalently, the smallness of the reverse KL divergence. In order to estimate the KL divergence, we first evaluated the Helmholtz free energy F x using the relation between Z x and Z s in Eq. 4. In the spin-glass phase (T < T crit ) the discrete partition function Z s was estimated using the results of the parallel tempering described above, while in the paramagnetic phase (T > T crit ) we used the replica-symmetric expression F s = −N βJ 2 /4 − N ln 2/β, where F s := −β −1 ln Z s . Importantly, the replica-symmetric expression is exact in the paramagnetic phase and in the large-N limit. Fig. 2 (b) shows that the reverse KL divergence is rather high at low temperatures, and decreases rapidly as the temperature is raised. The inset shows the estimated value of the two free energies, Gibbs and Helmholtz.\nSimilarly, in Fig. 3 (a) we plot the forward KL loss throughout the course of training. In the spin-glass phase, learning proceeds slowly at first 100 iterations or so, and then decreases much more rapidly afterwards. In the paramagnetic phase, the loss decreases quickly with the first 100 iterations, and then decreases much more slowly afterwards. For the critical temperature, T = T crit , the loss curve is essentially flat, and there is not a period of steep decline. Another interesting observation is that the variation in the value of the loss increases as T decreases. The data for the lowest temperature considered, T /J = 0.2, shows that after about 1000 training iterations there are occasionally large fluctuations in the value of the loss.\nAs with the reverse KL loss function, the quality of the learned flow can be measured by estimating the KL divergence and the tightness of the bound Eq. 21. This is depicted in Fig. 3 (b), and the inset compares the asymptotic value of the forward KL loss with the Shannon entropy of the physical distribution p(x), which we evaluated using the results of the parallel tempering simulations.\nCompared to the reverse KL divergence, the forward KL divergence first increases rapidly as the temperature is raised, reaches a peak at about T = 0.5, then decreases rapidly across the spin-glass phase transition, and finally approaches an asymptotic value as the temperature is increased further. The forward KL divergence achieves much smaller values than the reverse KL divergence in the spin-glass phase -the maximum value of the forward KL divergence is an order of magnitude smaller than the maximum value of the reverse KL divergence. One important point is that the estimate of the forward KL divergence actually becomes negative for high temperatures. As the KL divergence is non-negative, this indicates that the error in the estimate is large enough to change the value from positive to negative. We initially observed a similar phenomenon in estimating the reverse KL loss, but we were able to improve our estimate in the paramagnetic phase by using the exact replica symmetric expression for the free energy. We are not aware of an analogous expression for the Shannon entropy H[p(x)]. Correspondingly, the estimated KL divergence is quite small for the entire range of temperatures studied, although it does experience a peak at T = 0.5.\n\n4.4 Order parameter of generative spin-glasses\nSpin-glasses are characterized by the presence of a large number of metastable states. These are typically separated from one another by large energy barriers, and as a result ergodicity is broken at low temperatures and the system will become stuck in one of the many states. The closeness of two such states α and β may be measured by the overlap between them:q αβ := 1 N N i=1 m (α) i m (β) i .\nHere, m (α) i\nis the average per-site magnetization, or marginal probabilities, within the state α, and similarly for m (β) i . As shown by Parisi, the distribution of overlap values P J (q) for a given spin-glass instance may be used as an order parameter for the spin-glass phase [25]. This represents a key distinction from more conventional phases of matter where the order parameter is simply a real number -here, it is an entire function. Equivalently, the order parameter for a spin-glass could be considered to be the infinite collection of real numbers defined by the moments of the overlap distribution. This unique nature of the spin-glass order parameter underscores the complexity of these systems compared to more conventional phases of matter.\nIn order to evaluate the extent to which the trained normalizing flows have successfully approximated the spin-glass phase we examined the overlap distribution. P J (q) may be approximated by sampling the spin-glass and computing the configurational overlaps between two randomly chosen spin configurations s (a) and s (b) :q ab := 1 N N i=1 s\ni .\nAs sample size grows, the distribution of configurational overlaps q ab will approach the overlap distribution P J (q). In Fig. 4 we plot numerical estimates of the non-disorder-averaged overlap distribution P J (q) for the parallel tempering data and samples obtained from both the forward and reverse KL-trained flows. 4 Neither the reverse or forward-trained flow perfectly matches the PT result, although the forward and PT results qualitatively match. The fact that the forward-trained flow is able to produce a bi-modal overlap distribution demonstrates that it has captured an important characteristic of the spin-glass phase. In contrast, the overlap distribution for the reverse KL-trained flow has just a single peak near q = 1 for T < T crit , which indicates that most of the samples are very close to one another. This suggests that the flow has not successfully modeled the key property of the spin-glass phase, namely the existence of many metastable states. Further evidence for this conclusion comes from examining the magnetization, M = i s i . We find that M ≈ 0 for all sampling methods, but the reverse KL-trained flow is unique in that it produces non-zero per-site magnetizations, i.e. s i = 0. This is consistent with the hypothesis that the flow distribution has collapsed onto just a single mode of the true distribution. Indeed, this is a known failure mode of models trained on the reverse KL divergence. 5\n\n4.5 Ultrametricity in generative spin-glasses\nOne of the most remarkable properties of spin-glasses is that their state space can be endowed with highly non-trivial topological structure, which emerges naturally from seemingly unstructured Hamiltonians. For instance, the simple SK model Hamiltonian, with a featureless fully connected underlying graph and iid random couplings, can be shown to generate a simple hierarchical structure in its solution space. Specifically, the low energy states of the SK model obey an interesting relation known as ultrametricity [27]. Given any triplet of states, a, b, and c, the 3 possible overlaps q ab , q ac and q bc may be converted into a set of Hamming distances d ab := (1 − q ab )/2 which form the 3 sides of the triangle connecting the states. The standard triangle inequality is d ac ≤ d ab + d bc , and in the SK model, these distances are known to obey the stronger inequality d ac ≤ max(d ab , d bc ) which defines ultrametric spaces. This condition implies some geometric properties, for example that all triangles are either equilateral or acute isosceles. The distribution of triangles may be computed analytically in the SK model using the the replica approach with Parisi's replica symmetry breaking ansatz. One finds that in the spin-glass phase 1/4 of the triangles are the equilateral, and 3/4 are acute isosceles. 6 herefore, as a final test of the quality of our learned continuous spin-glasses trained with normalizing flows, it would be essential to examine if such models can actually generate the emergent hierarchical/ultrametric structure of the SK Hamiltonian. We plot the distribution of triangle side lengths in Fig. 5. Letting d min , d mid , d max denote the ordered distances, the cluster near the origin of Fig. 5 corresponds to equilateral triangles and the other cluster on the x-axis corresponds to acute isosceles triangles. This same plot was used in [28] in the context of the bipartite SK model.\n\n5 A phase transition within the internal layers of the normalizing flow\nWe have demonstrated that normalizing flows may be successfully trained to learn the spin-glass phase of the SK model. Recall that the flow induces a sequence of Hamiltonian densities H G ( ) (z ( ) ) which interpolate from a Gaussian energy landscape at = 0 to the complex, multi-modal landscape that corresponds to the spin-glass phase for = L. This suggests that there is a phase transition within the flow, e.g., in passing from layer to layer + 1.\nIn order to confirm this conjecture, would ideally be a continuous parameter which would allow for a critical layer c to be found, and then critical exponents could be calculated with respect to ( − c )/L. One way to achieve this scenario would be to take L → ∞, so that the normalizing flow is composed of an infinite number of layers, each of which implements an infinitesimal diffeormorphism. This would allow for additional theoretical analysis but would diminish the practical relevance since it is unclear how the abstracted normalizing flow with infinite layers relates to the finite-L trained models considered above. An interesting alternative would be to use a form of flow based on a 1-parameter diffeomorphism such as Neural Ordinary Differential Equations (Neural ODEs) [29]. In lieu of taking the L → ∞ limit or considering a different class of generative models, we will simply investigate the statistics of the internal layers of our trained flows and establish that, as increases, there appears to be a transition from the paramagnetic phase to the spin-glass phase.\nThe Boltzmann distributions corresponding to the intermediate layers of the flow may be sampled by first sampling the Gaussian prior, and then only partially evolving the flow up to the corresponding The distribution of distances for T /J = 0.2 for samples generated from a single disorder realization using (a) parallel tempering, (b) the forward KL-trained flow, and (c) the reverse KLtrained flow. The cluster at the origin corresponds to equilateral triangles, and the other cluster on the x-axis corresponds to acute isosceles triangles. All triangles in ultrametric spaces are either equilateral or acute isosceles, and so the two well-separated clusters in (a) and (b) indicate that both the PT simulations and the forward KL-trained flows have correctly reproduced the ultrametric property known to be obeyed by the SK model. The requirement of ultrametricity severely restricts the topology of the state space, and this is therefore a non-trivial test of the learned normalizing flow. In contrast, (c) shows that that reverse KL-trained flow has completely failed to capture this property. In the low-temperature, spin-glass phase, the first layers of the flow produce a unimodal overlap distribution, and evolution through the flow transforms the final layers into a bi-modal distribution characteristic of the spin-glass phase. This is the evidence of a spin-glass transition within the layers of the flow itself. In contrast, in temperatures above the spin-glass phase all layers produce a unimodal distribution and there is no spin-glass order. The triangle distance distribution for low energy states for each internal layer of a normalizing flow trained using the forward KL loss function, for T /J = 0.2. (f) The same distribution, plotted for samples generated using parallel tempering applied to the original discrete spin distribution p(s). All the plots correspond to a single disorder realization. The triangle distribution of the final layer (e) matches the distribution obtained from PT sampling (f) (as was shown in Fig. 5). (a) depicts triangle distribution produced by the Gaussian prior, and (b-d) show how forward evolution through the flow transforms this to a triangle distribution that closely resembles that one obtained by PT. intermediate layer. Following this approach, in Fig. 6 we plot the sequence of overlap distributions P J (q) for each internal layer of the flow for 3 distinct temperatures. Fig. 6 (a) shows that deep in the spin-glass phase the overlap distribution is transformed from the uni-modal distribution of the Gaussian prior to a bi-modal distribution in going from = 1 to = 2. Each additional layer then increases the separation of the two modes as the flow distribution becomes a closer approximation to the physical distribution. Fig. 6 (b) shows that increasing the temperature (but keeping within the spin-glass phase) causes the uni-modal to bi-modal transition to occur deeper in the flow. Lastly, Fig. 6 (c) demonstrates that in the paramagnetic phase the overlap distribution of all layers is uni-modal, and there is no sign of a phase transition within the flow.\nTo gain more insight into the nature of the transition that occurs as is increased within the flow, in Fig. 7 we plot the triangle distance distribution for each internal layer for T /J = 0.2. As in Fig. 6, in going from = 1 to = 2 the distribution appears to qualitatively change, and the triangle distribution becomes bi-modal. In this case the two modes correspond to equilateral and acute isosceles triangles. In the paramagnetic phase (and in the strict large-N limit), there are only equilateral triangles, whereas the spin-glass phase is characterized by both equilateral and acute isosceles. Taken together, the results of Fig. 6 and Fig. 7 show that the flow transforms a quadratic energy landscape into a spin-glass landscape via an incremental process, with each affine layer bringing the normalizing flow distribution closer to the true spin-glass distribution.\n\n6 Discussion and outlook\nWe have demonstrated that real NVP flows can be successfully trained to model complex spin-glass distributions. We evaluated two methods for training the flow, one based on minimizing the Gibbs free energy, or reverse KL divergence, and another based on minimizing the forward KL divergence. Although the reverse KL approach led to a relatively tight bound for the free energy, which suggested that the model was successfully trained, the reverse KL divergence is quite large at low temperatures, and moreover the model was found to suffer from serious mode collapse. In contrast, the forward KL-trained model was able to capture the key properties of the spin-glass low-energy distributions, including a bi-modal overlap distribution and topological structure in the state space known as ultrametricity.\nNormalizing flows are composed of a series of continuous changes of variables (i.e. diffeomorphisms), and thus they seem ill-suited for studying discrete systems such as spin-glasses directly. For this reason, as a first step before applying the normalizing flows, we used the probability density formulation recently introduced by us in Ref. [15] to convert the discrete Boltzmann distribution into a physically equivalent continuous one. This dual continuous distribution exhibits an important transition at T convex = 4J for the SK model. As this temperature is crossed from above, the Hamiltonian density H β (x) transitions from being convex to being non-convex. As part of this transition, the critical point at x = 0 becomes unstable and a pair of new critical points with x = 0 appears. Because this transition occurs at temperatures well above the spin-glass transition, one might suspect that the loss of convexity might hinder the learning task for approximating the spin-glass phase. However, as we have showed in [15] the spin-glass transition remains intact under continuous transformation and here we find no signature of any nonphysical effects when we use standard loss function based on forward KL divergence. Thus the continuous formulation can be used for spin-glass density estimation and generative modeling. 7 ompared to traditional machine learning settings, the reverse KL minimization approach seems appealing because it involves minimizing a natural cost function, i.e., the Gibbs free energy, and the amount of training data is essentially unlimited. Unfortunately, as we observed here, the quality of the self-generated \"data\" was not good enough to yield a reliable performance. In the forward KL approach the amount of data was finite (100,000 samples), although this is an artificial bound because we generated the data ourselves through traditional Monte Carlo approaches. This observation suggests an online extension of the forward KL learning where the Monte Carlo data generation occurs in tandem with the gradient-based optimization. Rather than generating a fixed dataset of Monte Carlo samples, a better approach would be to continuously sample from the parallel tempering replicas, and to periodically perform a gradient descent update for the normalizing flow once enough samples have been collected to form a new mini-batch. This would eliminate the potential for over-fitting since for each gradient descent update the mini-batch would consist of previously-unseen Monte Carlo samples.\nReal NVP flows implement a sequence of changes of variables, also known as diffeomorphisms. An important mathematical result along these lines is that any two distributions over R N can be related by a diffeomorphism. However, it is a non-trivial problem to find such a transformation, especially for spin-glasses, which are notoriously complex. Our successfully trained flow implements a very particular sequence of diffeomorphisms -the inverse flow G −1 maps the the energy landscape of a spin-glass to the simple quadratic function 1  2 z T z. Because a rough and multi-modal landscape is mapped to a quadratic one, we can think of G −1 as a coarse-graining. Importantly, the coarse-graining is with respect to the ruggedness of the energy landscape -no degrees of freedom have been integrated out, and no information has been lost because the flow is invertible. This resembles simulated annealing [32] and adiabatic quantum computation [33] for discrete optimization in which one starts with significant thermal or quantum fluctuations, smoothing the energy landscape to be originally convex, and then gradually (adiabatically) transform it to a non-trivial noncovex distribution via very slow (exponential in the worse-case instances) passage through a thermal or quantum phase transition respectively. In the case of adiabatic quantum annealing the process is in principle deterministic and fully reversible. However, in practice one has to deal with finite-temperature dissipations, many-body quantum localization, and Griffiths singularities for strongly disordered quantum spin glasses in low dimensions [34, 35].\nThere is also an apparent strong connection between our work and the renormalization group techniques. One might attempt to formally identify the inverse normalizing flow with a renormalization group flow. However, we are not aware of any formulation of the renormalization group which applies directly to probability densities such as the ones considered here. A possible connection of between RG and normalizing flows can be done through the Neural ODEs representations [29]. The renormalization of spin-glasses appears to be most well-studied for hierarchical models, and thus these would be a natural starting point to develop this connection further. 8 ome years ago an exact mapping between a variational RG transformation and Boltzmann Machines (BMs) with hidden layers was proposed in [37]. There are clearly some similarities between their setup and ours. In our work, the internal layers of the generative model are drawn from Boltzmann distributions with Hamiltonian densities H G ( ) (z ( ) ), and moreover these internal distributions may be easily sampled. In contrast, in Ref. [37] BMs were studied over discrete variables, whose internal layers are hard to sample from. Perhaps the most significant difference between their work and ours is that in our case the marginal distribution of the zeroth layer is constrained to be a simple Gaussian, whereas for BMs the marginal distribution over the final hidden layer is intractable and depends on the weights in a very non-trivial way. The fact that in normalizing flows the distribution over the latent variable is fixed to be a Gaussian means that the inverse flow may be interpreted as a coarse-graining map, since the endpoint of the inverse flow is always a quadratic energy landscape.\nFurther developing the connection between the renormalization group and normalizing flows would be worthwhile since, unlike traditional coarse-graining or renormalization group approaches which often rely on symmetries or other assumptions not likely to be found in systems of practical interest, the coarse-graining G −1 is separately learned for each spin-glass system, making our approach broadly applicable. In particular, it has been shown in Ref. [14] that the coarse-graining performed by the inverse flow may be used to improve Hamiltonian Markov Chain sampling of the system. Normalizing flows have also been recently used to accelerate sampling of a simple lattice quantum field theory [38]. The most important practical application of our work would be to obtain similar improvements in the computational tasks associated with spin-glasses, such as combinatorial optimization, sampling of multi-modal distributions, and inference in graphical models.\nThis equation, used in conjunction with the change of variable formula Eq. 10, allows the likelihood of a sample x to be efficiently determined.\n\nA.1 Implementation details\nThe details of the normalizing flow are as follows. For the prior we used an isotropic Gaussian with unit variance. The flow function G was composed of L = 4 affine coupling layers. For each even layer = 2k, the set of variable indices which the flow acts upon non-trivially, i.e. A (2k) , was chosen randomly. Each index was included in A (2k) with probability 1/2. For each odd layer, the complement was used, A (2k+1) = A (2k)C = B (2k) , so that each variable is acted upon by the flow every 2 layers. Each layer used a separate set of neural networks s ( ) , t ( ) , each with their own set of weights. The neural networks were taken to be multi-layer perceptrons (MLPs) with 3 hidden layers and one final layer, each with N units. 9 Lastly, the activation function for each layer in both networks was taken to be LeakyRelu, except for the final layers. The final activation for s ( ) was tanh, whereas the final activation for t ( ) was the identity.\nFor the reverse KL-based learning we employed a trick introduced by [14], which encouraged the trained flow to approximately respect the Z 2 reflection symmetry of the physical distribution, corresponding to invariance under x → −x. The trick consists of replacing p G (x) in the objective function Eq. 17 with the symmetrized version p In both cases we performed the training by minimizing the corresponding objective with the Adam optimizer [39] with learning rate 10 −4 , and used batch sizes of 50. For the reverse KL training, we chose to perform 250,000 mini-batch updates. 10 For the forward KL training we also performed 250,000 updates, which is equivalent to 125 epochs (entire passes through the data) with each epoch consisting of 100,000/50 = 2000 mini-batch updates.\n\nFootnotes:\n1: The KL divergence of two probability densities p(x) and q(x) is defined to be KL(p(x)||q(x)) := dx p(x) ln p(x) q(x) .\n2: This is a small number of spins by some standards -for example it represents a 16 × 16 square lattice in two dimensions. However, recall that the SK model is defined over a complete graph, which in this case contains\n32: ,640 bonds between spins. For context, a 16 × 16 square lattice with periodic boundary conditions and N = 16 2 = 256 spins contains only 512 bonds. 3 Since the variables s and x are related probabilistically, each s configuration could have been used to generate any number of x configurations. We chose a 1:1 conversion ratio for simplicity.\n4: The flow generates samples of the continuous variable x; samples of the discrete spin configuration s were then obtained by sampling from the conditional distribution s ∼ p(s|x).\n5: A nice discussion on this point may be found in Sec. 21.2.2 of [26].\n6: By isosceles, here we mean those triangles which are isosceles and not also equilateral, since all equilateral triangles are also trivially isosceles.\n7: Other recent approaches for applying normalizing flows to discrete data may be found in [30, 31]. It would be interesting to investigate how these approaches compare to the continuous relaxation approach of [19].\n8: The thesis [36] contains a good overview of the renormalization of these systems.\n9: As described here, the neural networks are functions from R N to R N , whereas in Appendix A we indicated that s ( ) , t ( ) : R |A ( ) | → R |B ( ) | . This discrepancy is due to the fact that for ease of implementation we considered the full set of N variables and used a binary mask to enforce the fact that the flow should only act upon the set of indices A ( ) .\n10: Note that in this case there is no dataset, and so the standard concept of training epochs does not apply.\n\nReferences:\n\n- D. L. Stein and C. M. Newman, Spin Glasses and Complexity. Princeton University Press, 2013.- M. Mezard and A. Montanari, Information, Physics, and Computation. Oxford University Press, Inc., New York, NY, USA, 2009.\n\n- C. Moore and S. Mertens, The Nature of Computation. Oxford University Press, Inc., 2011.\n\n- H. Nishimori and G. Ortiz, Phase transitions and critical phenomena, Elements of Phase Transitions and Critical Phenomena (Feb, 2010) 1-15.\n\n- Y. LeCun, S. Chopra, R. Hadsell, F. J. Huang, and et al., A tutorial on energy-based learning, in PREDICTING STRUCTURED DATA, MIT Press, 2006.\n\n- D. Sherrington and S. Kirkpatrick, Solvable model of a spin-glass, Physical review letters 35 (1975), no. 26 1792.\n\n- T. Castellani and A. Cavagna, Spin-glass theory for pedestrians, Journal of Statistical Mechanics: Theory and Experiment 2005 (may, 2005) P05012.\n\n- J. Carrasquilla and R. G. Melko, Machine learning phases of matter, Nature Physics 13 (2017), no. 5 431.\n\n- J. Biamonte, P. Wittek, N. Pancotti, P. Rebentrost, N. Wiebe, and S. Lloyd, Quantum machine learning, Nature 549 (2017), no. 7671 195-202.\n\n- G. Carleo and M. Troyer, Solving the quantum many-body problem with artificial neural networks, Science 355 (2017), no. 6325 602-606.\n\n- L. Huang and L. Wang, Accelerated monte carlo simulations with restricted boltzmann machines, Physical Review B 95 (2017), no. 3 035105.\n\n- J. Liu, Y. Qi, Z. Y. Meng, and L. Fu, Self-learning monte carlo method, Physical Review B 95 (2017), no. 4 041101.\n\n- H. Shen, J. Liu, and L. Fu, Self-learning monte carlo with deep neural networks, Physical Review B 97 (2018), no. 20 205140.\n\n- S.-H. Li and L. Wang, Neural network renormalization group, Physical review letters 121 (2018), no. 26 260601.\n\n- G. S. Hartnett and M. Mohseni, A probability density theory for spin-glass systems, arXiv preprint arXiv:2001.00927 (2020).\n\n- D. J. Rezende and S. Mohamed, Variational inference with normalizing flows, arXiv preprint arXiv:1505.05770 (2015).\n\n- I. Goodfellow, J. Pouget-Abadie, M. Mirza, B. Xu, D. Warde-Farley, S. Ozair, A. Courville, and Y. Bengio, Generative adversarial nets, in Advances in neural information processing systems, pp. 2672-2680, 2014.\n\n- Z. Liu, S. P. Rodrigues, and W. Cai, Simulating the ising model with a deep convolutional generative adversarial network, arXiv preprint arXiv:1710.04987 (2017).\n\n- Y. Zhang, Z. Ghahramani, A. J. Storkey, and C. A. Sutton, Continuous relaxations for discrete hamiltonian monte carlo, in Advances in Neural Information Processing Systems, pp. 3194-3202, 2012.\n\n- L. Dinh, J. Sohl-Dickstein, and S. Bengio, Density estimation using real nvp, arXiv preprint arXiv:1605.08803 (2016).\n\n- C. Doersch and A. Zisserman, Multi-task self-supervised visual learning, in The IEEE International Conference on Computer Vision (ICCV), Oct, 2017.\n\n- D. J. Earl and M. W. Deem, Parallel tempering: Theory, applications, and new perspectives, Phys. Chem. Chem. Phys. 7 (2005) 3910-3916.\n\n- A. v. d. Oord, Y. Li, I. Babuschkin, K. Simonyan, O. Vinyals, K. Kavukcuoglu, G. v. d. Driessche, E. Lockhart, L. C. Cobo, F. Stimberg, et al., Parallel wavenet: Fast high-fidelity speech synthesis, arXiv preprint arXiv:1711.10433 (2017).\n\n- H. G. Katzgraber, Introduction to monte carlo methods, tech. rep., 2010.\n\n- G. Parisi, The order parameter for spin glasses: a function on the interval 0-1, Journal of Physics A: Mathematical and General 13 (1980), no. 3 1101.\n\n- K. P. Murphy, Machine learning: a probabilistic perspective. MIT press, 2012.\n\n- M. Mézard, G. Parisi, N. Sourlas, G. Toulouse, and M. Virasoro, Nature of the spin-glass phase, Physical review letters 52 (1984), no. 13 1156.\n\n- G. S. Hartnett, E. Parker, and E. Geist, Replica symmetry breaking in bipartite spin glasses and neural networks, Physical Review E 98 (2018), no. 2 022116.\n\n- T. Q. Chen, Y. Rubanova, J. Bettencourt, and D. K. Duvenaud, Neural ordinary differential equations, in Advances in neural information processing systems, pp. 6571-6583, 2018.\n\n- E. Hoogeboom, J. W. Peters, R. v. d. Berg, and M. Welling, Integer discrete flows and lossless compression, arXiv preprint arXiv:1905.07376 (2019).\n\n- D. Tran, K. Vafa, K. Agrawal, L. Dinh, and B. Poole, Discrete flows: Invertible generative models of discrete data, in ICLR 2019 Workshop on Deep Generative Models for Highly Structured Data, 2019.\n\n- S. Kirkpatrick, C. D. Gelatt, and M. P. Vecchi, Optimization by simulated annealing, Science 220 (1983), no. 4598 671-680, [https://science.sciencemag.org/content/220/4598/671.full.pdf].\n\n- T. Albash and D. A. Lidar, Adiabatic quantum computation, Rev. Mod. Phys. 90 (Jan, 2018) 015002.\n\n- S. Boixo et al., Computational multiqubit tunnelling in programmable quantum annealers, Nat. Commun. 7 (01, 2016) 10327 EP -.\n\n- M. Mohseni, J. Strumpfer, and M. M. Rams, Engineering non-equilibrium quantum phase transitions via causally gapped Hamiltonians, New J. Phys. 20 (2018), no. 10 105002.\n\n- M. Castellana, The renormalization group for disordered systems, arXiv preprint arXiv:1307.6891 (2013).\n\n- P. Mehta and D. J. Schwab, An exact mapping between the variational renormalization group and deep learning, arXiv preprint arXiv:1410.3831 (2014).\n\n- M. S. Albergo, G. Kanwar, and P. E. Shanahan, Flow-based generative models for markov chain monte carlo in lattice field theory, Phys. Rev. D 100 (Aug, 2019) 034515.\n\n- D. P. Kingma and J. Ba, Adam: A method for stochastic optimization, arXiv preprint arXiv:1412.6980 (2014).\n\n", "annotations": {"ReferenceToFootnote": [{"begin": 18253, "end": 18254, "target": "#foot_0", "idx": 0}, {"begin": 21213, "end": 21214, "target": "#foot_1", "idx": 1}, {"begin": 28528, "end": 28529, "target": "#foot_3", "idx": 2}, {"begin": 29640, "end": 29641, "target": "#foot_4", "idx": 3}, {"begin": 31016, "end": 31017, "target": "#foot_5", "idx": 4}, {"begin": 39392, "end": 39393, "target": "#foot_6", "idx": 5}, {"begin": 42871, "end": 42872, "target": "#foot_7", "idx": 6}, {"begin": 45841, "end": 45842, "target": "#foot_8", "idx": 7}, {"begin": 46641, "end": 46643, "target": "#foot_9", "idx": 8}], "SectionMain": [{"begin": 1278, "end": 46841, "idx": 0}], "SectionReference": [{"begin": 48735, "end": 54253, "idx": 0}], "SectionHeader": [{"begin": 0, "end": 1278, "idx": 0}], "Div": [{"begin": 86, "end": 1270, "idx": 0}, {"begin": 1281, "end": 8066, "idx": 1}, {"begin": 8068, "end": 10917, "idx": 2}, {"begin": 10919, "end": 12866, "idx": 3}, {"begin": 12868, "end": 16107, "idx": 4}, {"begin": 16109, "end": 17921, "idx": 5}, {"begin": 17923, "end": 20203, "idx": 6}, {"begin": 20205, "end": 21044, "idx": 7}, {"begin": 21046, "end": 26653, "idx": 8}, {"begin": 26655, "end": 29641, "idx": 9}, {"begin": 29643, "end": 31618, "idx": 10}, {"begin": 31620, "end": 37229, "idx": 11}, {"begin": 37231, "end": 45075, "idx": 12}, {"begin": 45077, "end": 46841, "idx": 13}], "Head": [{"begin": 1281, "end": 1295, "n": "1", "idx": 0}, {"begin": 8068, "end": 8117, "n": "2", "idx": 1}, {"begin": 10919, "end": 10956, "n": "2.1", "idx": 2}, {"begin": 12868, "end": 12911, "n": "3", "idx": 3}, {"begin": 16109, "end": 16116, "idx": 4}, {"begin": 17923, "end": 17950, "n": "4.1", "idx": 5}, {"begin": 20205, "end": 20232, "n": "4.2", "idx": 6}, {"begin": 21046, "end": 21110, "n": "4.3", "idx": 7}, {"begin": 26655, "end": 26701, "n": "4.4", "idx": 8}, {"begin": 29643, "end": 29688, "n": "4.5", "idx": 9}, {"begin": 31620, "end": 31691, "n": "5", "idx": 10}, {"begin": 37231, "end": 37255, "n": "6", "idx": 11}, {"begin": 45077, "end": 45103, "idx": 12}], "Paragraph": [{"begin": 86, "end": 1270, "idx": 0}, {"begin": 1296, "end": 2189, "idx": 1}, {"begin": 2190, "end": 3258, "idx": 2}, {"begin": 3259, "end": 4079, "idx": 3}, {"begin": 4080, "end": 4722, "idx": 4}, {"begin": 4723, "end": 5184, "idx": 5}, {"begin": 5221, "end": 5482, "idx": 6}, {"begin": 5501, "end": 5903, "idx": 7}, {"begin": 5904, "end": 6250, "idx": 8}, {"begin": 6251, "end": 6442, "idx": 9}, {"begin": 6443, "end": 7401, "idx": 10}, {"begin": 7402, "end": 8066, "idx": 11}, {"begin": 8118, "end": 9032, "idx": 12}, {"begin": 9033, "end": 9555, "idx": 13}, {"begin": 9612, "end": 9720, "idx": 14}, {"begin": 9721, "end": 9725, "idx": 15}, {"begin": 9749, "end": 9868, "idx": 16}, {"begin": 9916, "end": 10000, "idx": 17}, {"begin": 10020, "end": 10105, "idx": 18}, {"begin": 10106, "end": 10534, "idx": 19}, {"begin": 10554, "end": 10653, "idx": 20}, {"begin": 10709, "end": 10917, "idx": 21}, {"begin": 10957, "end": 11413, "idx": 22}, {"begin": 11443, "end": 11673, "idx": 23}, {"begin": 11674, "end": 12214, "idx": 24}, {"begin": 12215, "end": 12866, "idx": 25}, {"begin": 12912, "end": 13886, "idx": 26}, {"begin": 13931, "end": 14016, "idx": 27}, {"begin": 14017, "end": 14550, "idx": 28}, {"begin": 14603, "end": 14960, "idx": 29}, {"begin": 15002, "end": 15177, "idx": 30}, {"begin": 15206, "end": 15316, "idx": 31}, {"begin": 15415, "end": 15509, "idx": 32}, {"begin": 15548, "end": 15606, "idx": 33}, {"begin": 15656, "end": 16107, "idx": 34}, {"begin": 16117, "end": 16180, "idx": 35}, {"begin": 16181, "end": 17231, "idx": 36}, {"begin": 17232, "end": 17921, "idx": 37}, {"begin": 17951, "end": 18067, "idx": 38}, {"begin": 18115, "end": 18757, "idx": 39}, {"begin": 18808, "end": 19264, "idx": 40}, {"begin": 19283, "end": 19452, "idx": 41}, {"begin": 19503, "end": 20056, "idx": 42}, {"begin": 20093, "end": 20203, "idx": 43}, {"begin": 20233, "end": 20676, "idx": 44}, {"begin": 20715, "end": 20797, "idx": 45}, {"begin": 20840, "end": 21023, "idx": 46}, {"begin": 21111, "end": 21834, "idx": 47}, {"begin": 21835, "end": 22699, "idx": 48}, {"begin": 22731, "end": 23006, "idx": 49}, {"begin": 23007, "end": 23311, "idx": 50}, {"begin": 23312, "end": 24253, "idx": 51}, {"begin": 24254, "end": 25008, "idx": 52}, {"begin": 25009, "end": 25400, "idx": 53}, {"begin": 25401, "end": 26653, "idx": 54}, {"begin": 26702, "end": 27064, "idx": 55}, {"begin": 27100, "end": 27113, "idx": 56}, {"begin": 27114, "end": 27858, "idx": 57}, {"begin": 27859, "end": 28183, "idx": 58}, {"begin": 28203, "end": 28206, "idx": 59}, {"begin": 28207, "end": 29641, "idx": 60}, {"begin": 29689, "end": 31618, "idx": 61}, {"begin": 31692, "end": 32144, "idx": 62}, {"begin": 32145, "end": 33228, "idx": 63}, {"begin": 33229, "end": 36355, "idx": 64}, {"begin": 36356, "end": 37229, "idx": 65}, {"begin": 37256, "end": 38060, "idx": 66}, {"begin": 38061, "end": 40590, "idx": 67}, {"begin": 40591, "end": 42214, "idx": 68}, {"begin": 42215, "end": 43968, "idx": 69}, {"begin": 43969, "end": 44930, "idx": 70}, {"begin": 44931, "end": 45075, "idx": 71}, {"begin": 45104, "end": 46060, "idx": 72}, {"begin": 46061, "end": 46841, "idx": 73}], "ReferenceToBib": [{"begin": 1635, "end": 1638, "target": "#b0", "idx": 0}, {"begin": 1861, "end": 1864, "target": "#b1", "idx": 1}, {"begin": 1923, "end": 1926, "target": "#b2", "idx": 2}, {"begin": 2055, "end": 2058, "target": "#b3", "idx": 3}, {"begin": 2105, "end": 2108, "target": "#b3", "idx": 4}, {"begin": 2185, "end": 2188, "target": "#b4", "idx": 5}, {"begin": 2604, "end": 2607, "target": "#b1", "idx": 6}, {"begin": 2658, "end": 2661, "target": "#b5", "idx": 7}, {"begin": 2842, "end": 2845, "target": "#b2", "idx": 8}, {"begin": 3466, "end": 3469, "target": "#b6", "idx": 9}, {"begin": 3600, "end": 3603, "target": "#b1", "idx": 10}, {"begin": 3807, "end": 3810, "target": "#b3", "idx": 11}, {"begin": 4075, "end": 4078, "target": "#b3", "idx": 12}, {"begin": 4400, "end": 4403, "target": "#b7", "idx": 13}, {"begin": 4433, "end": 4436, "target": "#b8", "idx": 14}, {"begin": 4437, "end": 4440, "target": "#b9", "idx": 15}, {"begin": 4505, "end": 4509, "target": "#b10", "idx": 16}, {"begin": 4510, "end": 4513, "target": "#b11", "idx": 17}, {"begin": 4514, "end": 4517, "target": "#b12", "idx": 18}, {"begin": 4518, "end": 4521, "target": "#b13", "idx": 19}, {"begin": 4973, "end": 4977, "target": "#b14", "idx": 20}, {"begin": 6343, "end": 6347, "target": "#b15", "idx": 21}, {"begin": 6438, "end": 6441, "target": "#b5", "idx": 22}, {"begin": 7528, "end": 7532, "target": "#b14", "idx": 23}, {"begin": 8352, "end": 8356, "target": "#b16", "idx": 24}, {"begin": 8596, "end": 8600, "target": "#b17", "idx": 25}, {"begin": 8786, "end": 8790, "target": "#b14", "idx": 26}, {"begin": 8951, "end": 8955, "target": "#b13", "idx": 27}, {"begin": 9514, "end": 9518, "target": "#b14", "idx": 28}, {"begin": 10290, "end": 10294, "target": "#b14", "idx": 29}, {"begin": 10344, "end": 10348, "target": "#b18", "idx": 30}, {"begin": 11303, "end": 11306, "target": "#b5", "idx": 31}, {"begin": 12231, "end": 12235, "target": "#b14", "idx": 32}, {"begin": 12983, "end": 12987, "target": "#b15", "idx": 33}, {"begin": 14056, "end": 14060, "target": "#b19", "idx": 34}, {"begin": 16326, "end": 16330, "target": "#b20", "idx": 35}, {"begin": 17508, "end": 17512, "target": "#b21", "idx": 36}, {"begin": 18366, "end": 18370, "target": "#b22", "idx": 37}, {"begin": 18396, "end": 18400, "target": "#b13", "idx": 38}, {"begin": 22107, "end": 22111, "target": "#b23", "idx": 39}, {"begin": 27382, "end": 27386, "target": "#b24", "idx": 40}, {"begin": 30207, "end": 30211, "target": "#b26", "idx": 41}, {"begin": 31572, "end": 31576, "target": "#b27", "idx": 42}, {"begin": 32928, "end": 32932, "target": "#b28", "idx": 43}, {"begin": 36021, "end": 36026, "idx": 44}, {"begin": 38404, "end": 38408, "target": "#b14", "idx": 45}, {"begin": 39087, "end": 39091, "target": "#b14", "idx": 46}, {"begin": 41493, "end": 41497, "target": "#b31", "idx": 47}, {"begin": 41532, "end": 41536, "target": "#b32", "idx": 48}, {"begin": 42205, "end": 42209, "target": "#b33", "idx": 49}, {"begin": 42210, "end": 42213, "target": "#b34", "idx": 50}, {"begin": 42687, "end": 42691, "target": "#b28", "idx": 51}, {"begin": 43008, "end": 43012, "target": "#b36", "idx": 52}, {"begin": 43307, "end": 43311, "target": "#b36", "idx": 53}, {"begin": 44422, "end": 44426, "target": "#b13", "idx": 54}, {"begin": 44665, "end": 44669, "target": "#b37", "idx": 55}, {"begin": 46129, "end": 46133, "target": "#b13", "idx": 56}, {"begin": 46504, "end": 46508, "target": "#b38", "idx": 57}, {"begin": 47348, "end": 47349, "target": "#b2", "idx": 58}, {"begin": 47791, "end": 47795, "target": "#b25", "idx": 59}, {"begin": 48042, "end": 48046, "target": "#b29", "idx": 60}, {"begin": 48047, "end": 48050, "target": "#b30", "idx": 61}, {"begin": 48161, "end": 48165, "target": "#b18", "idx": 62}, {"begin": 48181, "end": 48185, "target": "#b35", "idx": 63}], "ReferenceString": [{"begin": 48750, "end": 48842, "id": "b0", "idx": 0}, {"begin": 48844, "end": 48966, "id": "b1", "idx": 1}, {"begin": 48970, "end": 49058, "id": "b2", "idx": 2}, {"begin": 49062, "end": 49201, "id": "b3", "idx": 3}, {"begin": 49205, "end": 49347, "id": "b4", "idx": 4}, {"begin": 49351, "end": 49465, "id": "b5", "idx": 5}, {"begin": 49469, "end": 49614, "id": "b6", "idx": 6}, {"begin": 49618, "end": 49722, "id": "b7", "idx": 7}, {"begin": 49726, "end": 49864, "id": "b8", "idx": 8}, {"begin": 49868, "end": 50001, "id": "b9", "idx": 9}, {"begin": 50005, "end": 50141, "id": "b10", "idx": 10}, {"begin": 50145, "end": 50259, "id": "b11", "idx": 11}, {"begin": 50263, "end": 50387, "id": "b12", "idx": 12}, {"begin": 50391, "end": 50501, "id": "b13", "idx": 13}, {"begin": 50505, "end": 50628, "id": "b14", "idx": 14}, {"begin": 50632, "end": 50747, "id": "b15", "idx": 15}, {"begin": 50751, "end": 50960, "id": "b16", "idx": 16}, {"begin": 50964, "end": 51125, "id": "b17", "idx": 17}, {"begin": 51129, "end": 51322, "id": "b18", "idx": 18}, {"begin": 51326, "end": 51443, "id": "b19", "idx": 19}, {"begin": 51447, "end": 51594, "id": "b20", "idx": 20}, {"begin": 51598, "end": 51732, "id": "b21", "idx": 21}, {"begin": 51736, "end": 51974, "id": "b22", "idx": 22}, {"begin": 51978, "end": 52050, "id": "b23", "idx": 23}, {"begin": 52054, "end": 52204, "id": "b24", "idx": 24}, {"begin": 52208, "end": 52285, "id": "b25", "idx": 25}, {"begin": 52289, "end": 52432, "id": "b26", "idx": 26}, {"begin": 52436, "end": 52592, "id": "b27", "idx": 27}, {"begin": 52596, "end": 52771, "id": "b28", "idx": 28}, {"begin": 52775, "end": 52922, "id": "b29", "idx": 29}, {"begin": 52926, "end": 53123, "id": "b30", "idx": 30}, {"begin": 53127, "end": 53313, "id": "b31", "idx": 31}, {"begin": 53317, "end": 53413, "id": "b32", "idx": 32}, {"begin": 53417, "end": 53542, "id": "b33", "idx": 33}, {"begin": 53546, "end": 53714, "id": "b34", "idx": 34}, {"begin": 53718, "end": 53821, "id": "b35", "idx": 35}, {"begin": 53825, "end": 53972, "id": "b36", "idx": 36}, {"begin": 53976, "end": 54141, "id": "b37", "idx": 37}, {"begin": 54145, "end": 54251, "id": "b38", "idx": 38}], "Sentence": [{"begin": 86, "end": 323, "idx": 0}, {"begin": 324, "end": 475, "idx": 1}, {"begin": 476, "end": 619, "idx": 2}, {"begin": 620, "end": 727, "idx": 3}, {"begin": 728, "end": 943, "idx": 4}, {"begin": 944, "end": 1088, "idx": 5}, {"begin": 1089, "end": 1270, "idx": 6}, {"begin": 1296, "end": 1542, "idx": 7}, {"begin": 1543, "end": 1639, "idx": 8}, {"begin": 1640, "end": 1927, "idx": 9}, {"begin": 1928, "end": 2189, "idx": 10}, {"begin": 2190, "end": 2465, "idx": 11}, {"begin": 2466, "end": 2662, "idx": 12}, {"begin": 2663, "end": 2846, "idx": 13}, {"begin": 2847, "end": 3009, "idx": 14}, {"begin": 3010, "end": 3162, "idx": 15}, {"begin": 3163, "end": 3258, "idx": 16}, {"begin": 3259, "end": 3316, "idx": 17}, {"begin": 3317, "end": 3604, "idx": 18}, {"begin": 3605, "end": 3811, "idx": 19}, {"begin": 3812, "end": 4079, "idx": 20}, {"begin": 4080, "end": 4263, "idx": 21}, {"begin": 4264, "end": 4522, "idx": 22}, {"begin": 4523, "end": 4722, "idx": 23}, {"begin": 4723, "end": 4978, "idx": 24}, {"begin": 4979, "end": 5184, "idx": 25}, {"begin": 5221, "end": 5366, "idx": 26}, {"begin": 5367, "end": 5482, "idx": 27}, {"begin": 5501, "end": 5537, "idx": 28}, {"begin": 5538, "end": 5580, "idx": 29}, {"begin": 5581, "end": 5731, "idx": 30}, {"begin": 5732, "end": 5903, "idx": 31}, {"begin": 5904, "end": 6042, "idx": 32}, {"begin": 6043, "end": 6250, "idx": 33}, {"begin": 6251, "end": 6442, "idx": 34}, {"begin": 6443, "end": 6720, "idx": 35}, {"begin": 6721, "end": 6915, "idx": 36}, {"begin": 6916, "end": 7159, "idx": 37}, {"begin": 7160, "end": 7262, "idx": 38}, {"begin": 7263, "end": 7401, "idx": 39}, {"begin": 7402, "end": 7441, "idx": 40}, {"begin": 7442, "end": 7600, "idx": 41}, {"begin": 7601, "end": 7819, "idx": 42}, {"begin": 7820, "end": 8005, "idx": 43}, {"begin": 8006, "end": 8066, "idx": 44}, {"begin": 8118, "end": 8203, "idx": 45}, {"begin": 8204, "end": 8406, "idx": 46}, {"begin": 8407, "end": 8532, "idx": 47}, {"begin": 8533, "end": 8660, "idx": 48}, {"begin": 8661, "end": 8919, "idx": 49}, {"begin": 8920, "end": 9032, "idx": 50}, {"begin": 9033, "end": 9285, "idx": 51}, {"begin": 9286, "end": 9519, "idx": 52}, {"begin": 9520, "end": 9555, "idx": 53}, {"begin": 9612, "end": 9720, "idx": 54}, {"begin": 9721, "end": 9725, "idx": 55}, {"begin": 9749, "end": 9868, "idx": 56}, {"begin": 9916, "end": 10000, "idx": 57}, {"begin": 10020, "end": 10060, "idx": 58}, {"begin": 10061, "end": 10105, "idx": 59}, {"begin": 10106, "end": 10250, "idx": 60}, {"begin": 10251, "end": 10462, "idx": 61}, {"begin": 10463, "end": 10534, "idx": 62}, {"begin": 10554, "end": 10606, "idx": 63}, {"begin": 10607, "end": 10653, "idx": 64}, {"begin": 10709, "end": 10788, "idx": 65}, {"begin": 10789, "end": 10917, "idx": 66}, {"begin": 10957, "end": 11075, "idx": 67}, {"begin": 11076, "end": 11307, "idx": 68}, {"begin": 11308, "end": 11413, "idx": 69}, {"begin": 11443, "end": 11567, "idx": 70}, {"begin": 11568, "end": 11673, "idx": 71}, {"begin": 11674, "end": 11766, "idx": 72}, {"begin": 11767, "end": 11862, "idx": 73}, {"begin": 11863, "end": 11930, "idx": 74}, {"begin": 11931, "end": 12082, "idx": 75}, {"begin": 12083, "end": 12214, "idx": 76}, {"begin": 12215, "end": 12418, "idx": 77}, {"begin": 12419, "end": 12545, "idx": 78}, {"begin": 12546, "end": 12624, "idx": 79}, {"begin": 12625, "end": 12866, "idx": 80}, {"begin": 12912, "end": 13060, "idx": 81}, {"begin": 13061, "end": 13166, "idx": 82}, {"begin": 13167, "end": 13266, "idx": 83}, {"begin": 13267, "end": 13493, "idx": 84}, {"begin": 13494, "end": 13642, "idx": 85}, {"begin": 13643, "end": 13764, "idx": 86}, {"begin": 13765, "end": 13886, "idx": 87}, {"begin": 13931, "end": 14016, "idx": 88}, {"begin": 14017, "end": 14482, "idx": 89}, {"begin": 14483, "end": 14550, "idx": 90}, {"begin": 14603, "end": 14743, "idx": 91}, {"begin": 14744, "end": 14852, "idx": 92}, {"begin": 14853, "end": 14960, "idx": 93}, {"begin": 15002, "end": 15177, "idx": 94}, {"begin": 15206, "end": 15316, "idx": 95}, {"begin": 15415, "end": 15509, "idx": 96}, {"begin": 15548, "end": 15606, "idx": 97}, {"begin": 15656, "end": 15659, "idx": 98}, {"begin": 15660, "end": 15726, "idx": 99}, {"begin": 15727, "end": 15927, "idx": 100}, {"begin": 15928, "end": 16107, "idx": 101}, {"begin": 16117, "end": 16180, "idx": 102}, {"begin": 16181, "end": 16331, "idx": 103}, {"begin": 16332, "end": 16481, "idx": 104}, {"begin": 16482, "end": 16607, "idx": 105}, {"begin": 16608, "end": 16969, "idx": 106}, {"begin": 16970, "end": 17231, "idx": 107}, {"begin": 17232, "end": 17353, "idx": 108}, {"begin": 17354, "end": 17513, "idx": 109}, {"begin": 17514, "end": 17714, "idx": 110}, {"begin": 17715, "end": 17921, "idx": 111}, {"begin": 17951, "end": 18067, "idx": 112}, {"begin": 18115, "end": 18479, "idx": 113}, {"begin": 18480, "end": 18620, "idx": 114}, {"begin": 18621, "end": 18757, "idx": 115}, {"begin": 18808, "end": 18863, "idx": 116}, {"begin": 18864, "end": 19020, "idx": 117}, {"begin": 19021, "end": 19122, "idx": 118}, {"begin": 19123, "end": 19264, "idx": 119}, {"begin": 19283, "end": 19452, "idx": 120}, {"begin": 19503, "end": 19761, "idx": 121}, {"begin": 19762, "end": 19941, "idx": 122}, {"begin": 19942, "end": 20056, "idx": 123}, {"begin": 20093, "end": 20203, "idx": 124}, {"begin": 20233, "end": 20459, "idx": 125}, {"begin": 20460, "end": 20568, "idx": 126}, {"begin": 20569, "end": 20676, "idx": 127}, {"begin": 20715, "end": 20797, "idx": 128}, {"begin": 20840, "end": 21023, "idx": 129}, {"begin": 21111, "end": 21343, "idx": 130}, {"begin": 21344, "end": 21556, "idx": 131}, {"begin": 21557, "end": 21678, "idx": 132}, {"begin": 21679, "end": 21834, "idx": 133}, {"begin": 21835, "end": 21976, "idx": 134}, {"begin": 21977, "end": 22113, "idx": 135}, {"begin": 22114, "end": 22198, "idx": 136}, {"begin": 22199, "end": 22363, "idx": 137}, {"begin": 22364, "end": 22445, "idx": 138}, {"begin": 22446, "end": 22570, "idx": 139}, {"begin": 22571, "end": 22699, "idx": 140}, {"begin": 22731, "end": 22878, "idx": 141}, {"begin": 22879, "end": 23006, "idx": 142}, {"begin": 23007, "end": 23083, "idx": 143}, {"begin": 23084, "end": 23172, "idx": 144}, {"begin": 23173, "end": 23253, "idx": 145}, {"begin": 23254, "end": 23311, "idx": 146}, {"begin": 23312, "end": 23496, "idx": 147}, {"begin": 23497, "end": 23927, "idx": 148}, {"begin": 23928, "end": 24034, "idx": 149}, {"begin": 24035, "end": 24170, "idx": 150}, {"begin": 24171, "end": 24253, "idx": 151}, {"begin": 24254, "end": 24341, "idx": 152}, {"begin": 24342, "end": 24471, "idx": 153}, {"begin": 24472, "end": 24604, "idx": 154}, {"begin": 24605, "end": 24727, "idx": 155}, {"begin": 24728, "end": 24832, "idx": 156}, {"begin": 24833, "end": 25008, "idx": 157}, {"begin": 25009, "end": 25165, "idx": 158}, {"begin": 25166, "end": 25400, "idx": 159}, {"begin": 25401, "end": 25699, "idx": 160}, {"begin": 25700, "end": 25943, "idx": 161}, {"begin": 25944, "end": 26062, "idx": 162}, {"begin": 26063, "end": 26209, "idx": 163}, {"begin": 26210, "end": 26423, "idx": 164}, {"begin": 26424, "end": 26500, "idx": 165}, {"begin": 26501, "end": 26653, "idx": 166}, {"begin": 26702, "end": 26788, "idx": 167}, {"begin": 26789, "end": 26978, "idx": 168}, {"begin": 26979, "end": 27064, "idx": 169}, {"begin": 27100, "end": 27113, "idx": 170}, {"begin": 27114, "end": 27227, "idx": 171}, {"begin": 27228, "end": 27387, "idx": 172}, {"begin": 27388, "end": 27544, "idx": 173}, {"begin": 27545, "end": 27713, "idx": 174}, {"begin": 27714, "end": 27858, "idx": 175}, {"begin": 27859, "end": 28019, "idx": 176}, {"begin": 28020, "end": 28183, "idx": 177}, {"begin": 28203, "end": 28206, "idx": 178}, {"begin": 28207, "end": 28326, "idx": 179}, {"begin": 28327, "end": 28529, "idx": 180}, {"begin": 28530, "end": 28663, "idx": 181}, {"begin": 28664, "end": 28840, "idx": 182}, {"begin": 28841, "end": 29033, "idx": 183}, {"begin": 29034, "end": 29180, "idx": 184}, {"begin": 29181, "end": 29269, "idx": 185}, {"begin": 29270, "end": 29424, "idx": 186}, {"begin": 29425, "end": 29554, "idx": 187}, {"begin": 29555, "end": 29641, "idx": 188}, {"begin": 29689, "end": 29896, "idx": 189}, {"begin": 29897, "end": 30101, "idx": 190}, {"begin": 30102, "end": 30212, "idx": 191}, {"begin": 30213, "end": 30432, "idx": 192}, {"begin": 30433, "end": 30627, "idx": 193}, {"begin": 30628, "end": 30751, "idx": 194}, {"begin": 30752, "end": 30905, "idx": 195}, {"begin": 30906, "end": 31017, "idx": 196}, {"begin": 31018, "end": 31270, "idx": 197}, {"begin": 31271, "end": 31544, "idx": 198}, {"begin": 31545, "end": 31618, "idx": 199}, {"begin": 31692, "end": 31810, "idx": 200}, {"begin": 31811, "end": 32038, "idx": 201}, {"begin": 32039, "end": 32144, "idx": 202}, {"begin": 32145, "end": 32350, "idx": 203}, {"begin": 32351, "end": 32540, "idx": 204}, {"begin": 32541, "end": 32770, "idx": 205}, {"begin": 32771, "end": 32933, "idx": 206}, {"begin": 32934, "end": 33228, "idx": 207}, {"begin": 33229, "end": 33629, "idx": 208}, {"begin": 33630, "end": 33771, "idx": 209}, {"begin": 33772, "end": 34062, "idx": 210}, {"begin": 34063, "end": 34222, "idx": 211}, {"begin": 34223, "end": 34327, "idx": 212}, {"begin": 34328, "end": 34567, "idx": 213}, {"begin": 34568, "end": 34653, "idx": 214}, {"begin": 34654, "end": 34786, "idx": 215}, {"begin": 34787, "end": 34949, "idx": 216}, {"begin": 34950, "end": 35088, "idx": 217}, {"begin": 35089, "end": 35147, "idx": 218}, {"begin": 35148, "end": 35277, "idx": 219}, {"begin": 35278, "end": 35508, "idx": 220}, {"begin": 35509, "end": 35662, "idx": 221}, {"begin": 35663, "end": 35860, "idx": 222}, {"begin": 35861, "end": 36015, "idx": 223}, {"begin": 36016, "end": 36179, "idx": 224}, {"begin": 36180, "end": 36355, "idx": 225}, {"begin": 36356, "end": 36548, "idx": 226}, {"begin": 36549, "end": 36685, "idx": 227}, {"begin": 36686, "end": 36769, "idx": 228}, {"begin": 36770, "end": 36955, "idx": 229}, {"begin": 36956, "end": 37229, "idx": 230}, {"begin": 37256, "end": 37367, "idx": 231}, {"begin": 37368, "end": 37547, "idx": 232}, {"begin": 37548, "end": 37823, "idx": 233}, {"begin": 37824, "end": 38060, "idx": 234}, {"begin": 38061, "end": 38144, "idx": 235}, {"begin": 38145, "end": 38253, "idx": 236}, {"begin": 38254, "end": 38500, "idx": 237}, {"begin": 38501, "end": 38602, "idx": 238}, {"begin": 38603, "end": 38728, "idx": 239}, {"begin": 38729, "end": 38855, "idx": 240}, {"begin": 38856, "end": 39056, "idx": 241}, {"begin": 39057, "end": 39288, "idx": 242}, {"begin": 39289, "end": 39393, "idx": 243}, {"begin": 39394, "end": 39639, "idx": 244}, {"begin": 39640, "end": 39769, "idx": 245}, {"begin": 39770, "end": 39966, "idx": 246}, {"begin": 39967, "end": 40132, "idx": 247}, {"begin": 40133, "end": 40428, "idx": 248}, {"begin": 40429, "end": 40590, "idx": 249}, {"begin": 40591, "end": 40682, "idx": 250}, {"begin": 40683, "end": 40808, "idx": 251}, {"begin": 40809, "end": 40936, "idx": 252}, {"begin": 40937, "end": 41137, "idx": 253}, {"begin": 41138, "end": 41252, "idx": 254}, {"begin": 41253, "end": 41457, "idx": 255}, {"begin": 41458, "end": 41899, "idx": 256}, {"begin": 41900, "end": 42006, "idx": 257}, {"begin": 42007, "end": 42214, "idx": 258}, {"begin": 42215, "end": 42317, "idx": 259}, {"begin": 42318, "end": 42420, "idx": 260}, {"begin": 42421, "end": 42576, "idx": 261}, {"begin": 42577, "end": 42692, "idx": 262}, {"begin": 42693, "end": 42872, "idx": 263}, {"begin": 42873, "end": 43013, "idx": 264}, {"begin": 43014, "end": 43079, "idx": 265}, {"begin": 43080, "end": 43285, "idx": 266}, {"begin": 43286, "end": 43400, "idx": 267}, {"begin": 43401, "end": 43713, "idx": 268}, {"begin": 43714, "end": 43968, "idx": 269}, {"begin": 43969, "end": 44380, "idx": 270}, {"begin": 44381, "end": 44553, "idx": 271}, {"begin": 44554, "end": 44670, "idx": 272}, {"begin": 44671, "end": 44930, "idx": 273}, {"begin": 44931, "end": 45075, "idx": 274}, {"begin": 45104, "end": 45155, "idx": 275}, {"begin": 45156, "end": 45219, "idx": 276}, {"begin": 45220, "end": 45285, "idx": 277}, {"begin": 45286, "end": 45384, "idx": 278}, {"begin": 45385, "end": 45414, "idx": 279}, {"begin": 45415, "end": 45470, "idx": 280}, {"begin": 45471, "end": 45609, "idx": 281}, {"begin": 45610, "end": 45711, "idx": 282}, {"begin": 45712, "end": 45842, "idx": 283}, {"begin": 45843, "end": 45962, "idx": 284}, {"begin": 45963, "end": 46060, "idx": 285}, {"begin": 46061, "end": 46293, "idx": 286}, {"begin": 46294, "end": 46563, "idx": 287}, {"begin": 46564, "end": 46643, "idx": 288}, {"begin": 46644, "end": 46841, "idx": 289}], "ReferenceToFigure": [{"begin": 23015, "end": 23016, "target": "#fig_2", "idx": 0}, {"begin": 24040, "end": 24041, "target": "#fig_2", "idx": 1}, {"begin": 24273, "end": 24274, "target": "#fig_1", "idx": 2}, {"begin": 25191, "end": 25196, "target": "#fig_3", "idx": 3}, {"begin": 28335, "end": 28336, "idx": 4}, {"begin": 31329, "end": 31330, "target": "#fig_6", "idx": 5}, {"begin": 31428, "end": 31429, "target": "#fig_6", "idx": 6}, {"begin": 35274, "end": 35275, "target": "#fig_6", "idx": 7}, {"begin": 35542, "end": 35543, "target": "#fig_8", "idx": 8}, {"begin": 35668, "end": 35669, "target": "#fig_8", "idx": 9}, {"begin": 36193, "end": 36194, "target": "#fig_8", "idx": 10}, {"begin": 36464, "end": 36465, "target": "#fig_9", "idx": 11}, {"begin": 36560, "end": 36561, "target": "#fig_8", "idx": 12}, {"begin": 36992, "end": 36993, "target": "#fig_8", "idx": 13}, {"begin": 37003, "end": 37004, "target": "#fig_9", "idx": 14}], "Abstract": [{"begin": 76, "end": 1270, "idx": 0}], "SectionFootnote": [{"begin": 46843, "end": 48733, "idx": 0}], "Footnote": [{"begin": 46854, "end": 46975, "id": "foot_0", "n": "1", "idx": 0}, {"begin": 46976, "end": 47195, "id": "foot_1", "n": "2", "idx": 1}, {"begin": 47196, "end": 47542, "id": "foot_2", "n": "32", "idx": 2}, {"begin": 47543, "end": 47724, "id": "foot_3", "n": "4", "idx": 3}, {"begin": 47725, "end": 47796, "id": "foot_4", "n": "5", "idx": 4}, {"begin": 47797, "end": 47950, "id": "foot_5", "n": "6", "idx": 5}, {"begin": 47951, "end": 48166, "id": "foot_6", "n": "7", "idx": 6}, {"begin": 48167, "end": 48251, "id": "foot_7", "n": "8", "idx": 7}, {"begin": 48252, "end": 48622, "id": "foot_8", "n": "9", "idx": 8}, {"begin": 48623, "end": 48733, "id": "foot_9", "n": "10", "idx": 9}]}}