{"text": "Importance of user inputs while using incremental learning to personalize human activity recognition models\n\nAbstract:\nIn this study, importance of user inputs is studied in the context of personalizing human activity recognition models using incremental learning. Inertial sensor data from three body positions are used, and the classification is based on Learn++ ensemble method. Three different approaches to update models are compared: non-supervised, semi-supervised and supervised. Non-supervised approach relies fully on predicted labels, supervised fully on user labeled data, and the proposed method for semisupervised learning, is a combination of these two. In fact, our experiments show that by relying on predicted labels with high confidence, and asking the user to label only uncertain observations (from 12% to 26% of the observations depending on the used base classifier), almost as low error rates can be achieved as by using supervised approach. In fact, the difference was less than 2%-units. Moreover, unlike non-supervised approach, semisupervised approach does not suffer from drastic concept drift, and thus, the error rate of the non-supervised approach is over 5%-units higher than using semi-supervised approach.\n\nMain:\n\n\n\n1 Problem statement and related work\nThis study focuses on human activity recognition based on inertial sensor data collected using smartphone sensors. One of the main challenges of the field is that people are different: they are unique for instance in terms of physical characteristics, health state or gender. Due to this, it is shown that a model that provides accurate results for one person, does not necessarily work accurately with somebody else's data. For instance, user-independent models are not accurate if they are trained with healthy study subjects and tested with subjects who have difficulties to move [1]. Personal recognition models provide better recognition rates, but the challenge is that they normally require personal training data, and therefore, a personal data gathering session [2].\nOur previous study [3] presented for the first time how incremental learning can be used to personalize activity recognition models without a separate data gathering session. The advantage of incremental learning is that models can continuously learn from streaming data, and therefore, adapt to the user's personal moving style. In addition, learning can be done without model retraining, instead, models are updated based on streaming data, and therefore, all the training data does not need to be kept stored. In the article, the idea was to base the recognition in the first place in a user-independent model, and use streaming data and predicted labels related to them to update the model, and therefore, personalize it. While the idea of learning without user-interruption is great from the user experience point-of-view, due to concept drift it can also lead to an unwanted end-result. Microsoft's self-learning Twitter chatbot Tay is a perfect example of what can happen if self-learning artificial intelligence applications learn wrong things. The idea of Tay was to mimic a 19-year-old girl and learn from interactions between other Twitter users. However, due to a drastic concept drift, it quickly learned how to be a racist and act like one because it leaned wrong things from online data [4]. This could have been avoided if, instead of self-learning, developers of Tay would have selected which interactions are used to update Tay's models and which not.\nA different approach to personalize a human activity recognition model incrementally was presented in [5]. The idea of the study was to avoid a drastic concept drift by using active learning: models were updated based on user labeled instances. Moreover, unlike in our previous study, models were not personalized using all the streaming data. Instead, the user was asked to label only uncertain observations, and model update was based on only these. When the method was tested using the leave-one-subject-out -method, the overall accuracy improved only slightly, however: from 88.6% (without personalization) to 89.6% (every other observation labeled by the user and used for personalization). However, it still improved the recognition accuracy of 40 subjects out of 53.\nIn this study, we combine ideas presented in [3] and [5]. We use the whole streaming data to personalize classification models, as done in [3]. However, to avoid a drastic concept drift, we do not completely trust on predicted labels. Instead, we ask the user to label uncertain observations, as done in [5]. This approach is compared to the approach presented in our previous study, and to the approach where the user labels every single instance from the streaming data. Moreover, the experiments done in this study are more comprehensive than the ones done in our previous study, now data from three body positions are studied while our previous study used data from one body position only.\n\n2 Experimental dataset\nIn this study, a publicly open data set presented in [6] was used in the experiments. It contains accelerometer, magnetometer and gyroscope data from seven physical activities (walking, sitting, standing, jogging, biking, walking upstairs and downstairs). The data were collected using a smartphone from ten study subjects using a sampling rate of 50Hz, and five body locations. In this study we selected to use accelerometer and gyroscope data from three positions: waist, wrist, and arm. Moreover, apparently one of the study subjects had a smartphone in different orientation than others making the data totally different to other subjects' data. Thus, only nine persons data were used in the experiments.\nIn the study, features were extracted from windows of size 4.2 second, and 1.4 second slide was used. Used features were the ones that are commonly used in activity recognition studies. These include standard deviation, minimum, maximum, median, and different percentiles (10, 25, 75, and 90). Other used features were the sum of values above or below a given percentile (10, 25, 75, and 90), square sum of values above or below a given percentile (10, 25, 75, and 90), and number of crossings above or below a given percentile (10, 25, 75, and 90), and features from the frequency domain. These were extracted from raw accelerometer and gyroscope signals, as well as from magnitude signals and signals where two out of three accelerometer and gyroscope signals were square summed. Altogether 244 features were extracted.\n\n3 Methods for personalizing the recognition model\nLearn++ algorithm [7] for incremental learning is an ensemble method, which can use any classifier as a base classifier. In this study, three different base classifiers are compared: CART (classification and regression tree), LDA (linear discriminant analysis) and QDA (quadratic discriminant analysis). Learn++ processes incoming streaming data as chunks. For each chunk, a new group of weak base models are trained and combined to a group of previously trained base models as an ensemble model [8]. Because of encouraging experiences obtained in our previous study, Learn++ is used also in this study.\nThere are three different ways to update models: non-supervised, semisupervised, and supervised approach. Our previous article [3] used the nonsupervised approach: only predicted labels were used to update the model. The semi-supervised approach uses both predicted labels and true labels for updating the model. Moreover, in the supervised approach (a.k.a. active learning) each observation is labeled by the user, therefore, only true labels are used.\nA new approach for semi-supervised learning is introduced in this study. The idea is that predicted labels with high priory and data related to them are used in the model update process as they are, but labels with a priori confidence below some threshold, th, are considered as uncertain, and they are labeled by the user before they are used in the model updating process. Moreover, as the studied activities are of long-term [9] nature, it can be assumed that also the windows right before and after have the same class label as the window labeled by the user. In this study, we assume that if the label of window w is a, then also windows w − 2, w − 1, w + 1 and w + 2 belong to class a. This way, one user input gives information to more than one window, improving the accuracy of the labels used to update models.\nWhile non-supervised, semi-supervised, and supervised method use different approaches to label the data, otherwise, they are used to personalizing the human activity recognition models in the same way. These approaches are experimented using the leave-one-subject-out-method which is explained in [3], and it can be divided into three steps. To personalize a model for subject s n , Step 1 is to train a Learn++ based user-independent recognition model by randomly sampling data from subjects s 1 , ..., s n−1 , and select the best features for the model using SFS (sequential forward selection). A new base model is then trained based on them and it is added to the ensemble of models. The ensemble model is then tested using the test data set. Step 1 is repeated n times, in this case n = 3. In Step 2, the personalization of the model starts by extracting features from the first  The first row shows results when the sensor position is arm, second waist, and third wrist. The first column shows results using LDA, second QDA, and third CART. User-independent results are shown using horizontal line, non-supervised using a thick solid line, supervised with a thin solid line, semi-supervised with th = 0.90 using dotted line, and with th = 0.95 using dash-dot line. chunk of subject s n 's data. Depending on the used personalization approach, this data is labeled using the ensemble model, user or combination of these two depending on which approach is used. The data chunks used to personalize the recognition tend to be small, and therefore, the inner-variance of data chunks is small as well, leading easily to over-fitted models. To avoid this, variance and the amount of the data are increased using the noise injection method presented in [10]. Next, the data used in model updating is selected based on random sampling, and best features are selected using SFS. These are then used to train a new base model, which is added to the ensemble.\nStep 2 is repeated n times.\nStep 3 is to be done as in Step 2 but with a new data chunk. Therefore, in this study, in the end the Learn++ conducts of 3 • n = 9 base models. Equal weight is given to each base model.\n\n4 Experiments and discussion\nFor the experiments, each person's s i data are divided into three parts and each part contains the same amount of data from each activity [3]. When a userindependent model is personalized for subject s i , two parts of the data are used for personalizing the model (in Steps 2 & 3) and the last part is used for testing. Non-supervised, semi-supervised (with threshold values 0.95 and 0.90), and supervised approaches to personalize recognition model were experimented. These are compared to user-independent recognition rates. Figure 1 and Table 1 show error rates from the balanced accuracies averaged over all nine study subjects. The benefit of using a personalized model is obvious: in each case, the average error rate using a personalized model is lower than using a user-independent model no matter which personalization approach, body position, or base classifier is studied. In some cases, the difference is more than 10%-units.\nModel update clearly benefits from user inputs as the error rates using semisupervised approach (4.2/4.3%) are much lower than non-supervised (9.5%), no matter which base classifier is used. The difference is especially big in cases where the user-independent model, originally used in the recognition process, is not that accurate, see for instance Figures 1(d) & 1(f). In these cases the error rate of the semi-supervised approach starts to rapidly drop when personal base classifiers are added to the ensemble, while in the non-supervised approach, it does not drop that much. Eventually, the difference in error rates of nonsupervised and semi-supervised (th = 0.95) approaches is 5.7 and 11.4%-unit, respectively. In these cases, a user-independent model cannot detect some of the classes at all, and therefore, the non-supervised model suffers from a drastic concept drift, what is more, it cannot recognize all the activities. However, the semi-supervised model can recover from such a situation because of user inputs. However, when supervised and semi-supervised results are compared, it can be noted that already by replacing a small number of instances with correct labels, almost as high recognition rates can be achieved as by labeling all the instances. On average, the error rate using the semi-supervised approach is less than 2%-units higher than using the supervised approach. Moreover, when semisupervised approach was used, there does not seem to be differences between threshold values th = 0.95 and th = 0.90. This is because the used classifiers tend to give 100% as a priori value or some much lower value. In fact, in both cases, approximately same amount of windows were labeled by the user (26% using CART, 13% using QDA, and 12% using LDA, see Table 1). However, as also two windows before and after uncertain observation was labeled according to this same input, the amount of replaced labels was bigger (47% using CART, 27% using QDA, and 25% using LDA). It can be noted that a priori values are highly dependent on the used classifier, and therefore, the threshold to conclude if the predicted classification is reliable should be selected classifier-wise.\n\n5 Conclusions\nIn this study, Learn++ was applied to human activity recognition data to personalize recognition models, and three different approaches to personalize modes were compared: non-supervised, semi-supervised, and supervised. Three base classifiers were compared: LDA, QDA and CART. Experiments showed that personalized models are more accurate than user-independent models. Moreover, it was noted that without user inputs, personalized models can suffer from a drastic concept drift, as the error rates of non-supervised models were much higher than the one's obtained using the semi-supervised approach (semi-supervised 4.2/4.4% vs. non-supervised 9.5%). However, using the proposed method, already by asking the user to label part of the data (from 12% to 26% depending on the used base classifier), almost as high recognition rates can be achieved as by using only user labeled data. In fact, the average error rate using the semisupervised approach instead of supervised was less than 2%-units. The future work includes experimenting with more extensive data sets.\n\nFootnotes:\n\nReferences:\n\n- M. Albert, S. Toledo, M. Shapiro, and K. Kording. Using mobile phones for activity recognition in parkinson's patients. Frontiers in neurology, 3, 2012.- A. Bulling, U. Blanke, and B. Schiele. A tutorial on human activity recognition using body-worn inertial sensors. ACM Comput. Surv., 46(3):33:1-33:33, January 2014.\n\n- P. Siirtola, H. Koskimäki, and J. Röning. Personalizing human activity recognition models using incremental learning. In European Symposium on Artificial Neural Networks, pages 627-632, April 2018.\n\n- A. Mannini and S. Intille. Classifier personalization for activity recognition using wrist ac- celerometers. IEEE journal of biomedical and health informatics, 2018.\n\n- M. Shoaib, S. Bosch, O. D. Incel, H. Scholten, and P. Havinga. Fusion of smartphone motion sensors for physical activity recognition. Sensors, 14(6):10146-10176, 2014.\n\n- R. Polikar, L. Upda, S. S Upda, and V. Honavar. Learn++: An incremental learning algorithm for supervised neural networks. IEEE transactions on systems, man, and cybernetics, part C (applications and reviews), 31(4):497-508, 2001.\n\n- V. Losing, B. Hammer, and H. Wersing. Choosing the best algorithm for an incremental on-line learning task. In European Symposium on Artificial Neural Networks, April 27-29 2016.\n\n- P. Siirtola, H. Koskimäki, and J. Röning. Periodic quick test for classifying long-term activities. In Computational Intelligence and Data Mining, IEEE Symposium on, pages 135-140, 2011.\n\n- P. Siirtola, H. Koskimäki, and J. Röning. Personal models for ehealth-improving user-dependent human activity recognition models using noise injection. In Computational Intelligence (SSCI), 2016 IEEE Symposium Series on, pages 1-7. IEEE, 2016.\n\n", "annotations": {"ReferenceToTable": [{"begin": 11233, "end": 11234, "target": "#tab_1", "idx": 0}, {"begin": 13403, "end": 13404, "target": "#tab_1", "idx": 1}], "SectionMain": [{"begin": 1248, "end": 14892, "idx": 0}], "SectionReference": [{"begin": 14906, "end": 16635, "idx": 0}], "SectionHeader": [{"begin": 0, "end": 1248, "idx": 0}], "Div": [{"begin": 119, "end": 1240, "idx": 0}, {"begin": 1251, "end": 5001, "idx": 1}, {"begin": 5003, "end": 6556, "idx": 2}, {"begin": 6558, "end": 10654, "idx": 3}, {"begin": 10656, "end": 13812, "idx": 4}, {"begin": 13814, "end": 14892, "idx": 5}], "Head": [{"begin": 1251, "end": 1287, "n": "1", "idx": 0}, {"begin": 5003, "end": 5025, "n": "2", "idx": 1}, {"begin": 6558, "end": 6607, "n": "3", "idx": 2}, {"begin": 10656, "end": 10684, "n": "4", "idx": 3}, {"begin": 13814, "end": 13827, "n": "5", "idx": 4}], "Paragraph": [{"begin": 119, "end": 1240, "idx": 0}, {"begin": 1288, "end": 2063, "idx": 1}, {"begin": 2064, "end": 3533, "idx": 2}, {"begin": 3534, "end": 4307, "idx": 3}, {"begin": 4308, "end": 5001, "idx": 4}, {"begin": 5026, "end": 5734, "idx": 5}, {"begin": 5735, "end": 6556, "idx": 6}, {"begin": 6608, "end": 7211, "idx": 7}, {"begin": 7212, "end": 7665, "idx": 8}, {"begin": 7666, "end": 8485, "idx": 9}, {"begin": 8486, "end": 10439, "idx": 10}, {"begin": 10440, "end": 10467, "idx": 11}, {"begin": 10468, "end": 10654, "idx": 12}, {"begin": 10685, "end": 11624, "idx": 13}, {"begin": 11625, "end": 13812, "idx": 14}, {"begin": 13828, "end": 14892, "idx": 15}], "ReferenceToBib": [{"begin": 1871, "end": 1874, "target": "#b0", "idx": 0}, {"begin": 2059, "end": 2062, "target": "#b1", "idx": 1}, {"begin": 2083, "end": 2086, "target": "#b2", "idx": 2}, {"begin": 3636, "end": 3639, "target": "#b3", "idx": 3}, {"begin": 4353, "end": 4356, "target": "#b2", "idx": 4}, {"begin": 4361, "end": 4364, "target": "#b3", "idx": 5}, {"begin": 4447, "end": 4450, "target": "#b2", "idx": 6}, {"begin": 4612, "end": 4615, "target": "#b3", "idx": 7}, {"begin": 5079, "end": 5082, "target": "#b4", "idx": 8}, {"begin": 6007, "end": 6027, "idx": 9}, {"begin": 6626, "end": 6629, "target": "#b5", "idx": 10}, {"begin": 7104, "end": 7107, "target": "#b6", "idx": 11}, {"begin": 7339, "end": 7342, "target": "#b2", "idx": 12}, {"begin": 8094, "end": 8097, "target": "#b7", "idx": 13}, {"begin": 8783, "end": 8786, "target": "#b2", "idx": 14}, {"begin": 10237, "end": 10241, "target": "#b8", "idx": 15}, {"begin": 10824, "end": 10827, "target": "#b2", "idx": 16}], "Sentence": [{"begin": 119, "end": 264, "idx": 0}, {"begin": 265, "end": 381, "idx": 1}, {"begin": 382, "end": 487, "idx": 2}, {"begin": 488, "end": 668, "idx": 3}, {"begin": 669, "end": 965, "idx": 4}, {"begin": 966, "end": 1013, "idx": 5}, {"begin": 1014, "end": 1240, "idx": 6}, {"begin": 1288, "end": 1402, "idx": 7}, {"begin": 1403, "end": 1563, "idx": 8}, {"begin": 1564, "end": 1712, "idx": 9}, {"begin": 1713, "end": 1875, "idx": 10}, {"begin": 1876, "end": 2063, "idx": 11}, {"begin": 2064, "end": 2238, "idx": 12}, {"begin": 2239, "end": 2393, "idx": 13}, {"begin": 2394, "end": 2576, "idx": 14}, {"begin": 2577, "end": 2789, "idx": 15}, {"begin": 2790, "end": 2956, "idx": 16}, {"begin": 2957, "end": 3116, "idx": 17}, {"begin": 3117, "end": 3221, "idx": 18}, {"begin": 3222, "end": 3370, "idx": 19}, {"begin": 3371, "end": 3533, "idx": 20}, {"begin": 3534, "end": 3640, "idx": 21}, {"begin": 3641, "end": 3778, "idx": 22}, {"begin": 3779, "end": 3877, "idx": 23}, {"begin": 3878, "end": 3985, "idx": 24}, {"begin": 3986, "end": 4229, "idx": 25}, {"begin": 4230, "end": 4307, "idx": 26}, {"begin": 4308, "end": 4365, "idx": 27}, {"begin": 4366, "end": 4451, "idx": 28}, {"begin": 4452, "end": 4542, "idx": 29}, {"begin": 4543, "end": 4616, "idx": 30}, {"begin": 4617, "end": 4780, "idx": 31}, {"begin": 4781, "end": 5001, "idx": 32}, {"begin": 5026, "end": 5111, "idx": 33}, {"begin": 5112, "end": 5281, "idx": 34}, {"begin": 5282, "end": 5404, "idx": 35}, {"begin": 5405, "end": 5515, "idx": 36}, {"begin": 5516, "end": 5675, "idx": 37}, {"begin": 5676, "end": 5734, "idx": 38}, {"begin": 5735, "end": 5836, "idx": 39}, {"begin": 5837, "end": 5920, "idx": 40}, {"begin": 5921, "end": 6028, "idx": 41}, {"begin": 6029, "end": 6324, "idx": 42}, {"begin": 6325, "end": 6516, "idx": 43}, {"begin": 6517, "end": 6556, "idx": 44}, {"begin": 6608, "end": 6728, "idx": 45}, {"begin": 6729, "end": 6911, "idx": 46}, {"begin": 6912, "end": 6964, "idx": 47}, {"begin": 6965, "end": 7108, "idx": 48}, {"begin": 7109, "end": 7211, "idx": 49}, {"begin": 7212, "end": 7317, "idx": 50}, {"begin": 7318, "end": 7428, "idx": 51}, {"begin": 7429, "end": 7524, "idx": 52}, {"begin": 7525, "end": 7569, "idx": 53}, {"begin": 7570, "end": 7665, "idx": 54}, {"begin": 7666, "end": 7738, "idx": 55}, {"begin": 7739, "end": 8040, "idx": 56}, {"begin": 8041, "end": 8229, "idx": 57}, {"begin": 8230, "end": 8357, "idx": 58}, {"begin": 8358, "end": 8485, "idx": 59}, {"begin": 8486, "end": 8687, "idx": 60}, {"begin": 8688, "end": 8827, "idx": 61}, {"begin": 8828, "end": 9082, "idx": 62}, {"begin": 9083, "end": 9172, "idx": 63}, {"begin": 9173, "end": 9231, "idx": 64}, {"begin": 9232, "end": 9279, "idx": 65}, {"begin": 9280, "end": 9461, "idx": 66}, {"begin": 9462, "end": 9531, "idx": 67}, {"begin": 9532, "end": 9755, "idx": 68}, {"begin": 9756, "end": 9785, "idx": 69}, {"begin": 9786, "end": 9950, "idx": 70}, {"begin": 9951, "end": 10125, "idx": 71}, {"begin": 10126, "end": 10242, "idx": 72}, {"begin": 10243, "end": 10360, "idx": 73}, {"begin": 10361, "end": 10439, "idx": 74}, {"begin": 10440, "end": 10467, "idx": 75}, {"begin": 10468, "end": 10528, "idx": 76}, {"begin": 10529, "end": 10612, "idx": 77}, {"begin": 10613, "end": 10654, "idx": 78}, {"begin": 10685, "end": 10828, "idx": 79}, {"begin": 10829, "end": 11006, "idx": 80}, {"begin": 11007, "end": 11155, "idx": 81}, {"begin": 11156, "end": 11213, "idx": 82}, {"begin": 11214, "end": 11319, "idx": 83}, {"begin": 11320, "end": 11570, "idx": 84}, {"begin": 11571, "end": 11624, "idx": 85}, {"begin": 11625, "end": 11815, "idx": 86}, {"begin": 11816, "end": 11995, "idx": 87}, {"begin": 11996, "end": 12204, "idx": 88}, {"begin": 12205, "end": 12343, "idx": 89}, {"begin": 12344, "end": 12558, "idx": 90}, {"begin": 12559, "end": 12651, "idx": 91}, {"begin": 12652, "end": 12892, "idx": 92}, {"begin": 12893, "end": 13019, "idx": 93}, {"begin": 13020, "end": 13156, "idx": 94}, {"begin": 13157, "end": 13255, "idx": 95}, {"begin": 13256, "end": 13406, "idx": 96}, {"begin": 13407, "end": 13609, "idx": 97}, {"begin": 13610, "end": 13812, "idx": 98}, {"begin": 13828, "end": 14048, "idx": 99}, {"begin": 14049, "end": 14105, "idx": 100}, {"begin": 14106, "end": 14197, "idx": 101}, {"begin": 14198, "end": 14479, "idx": 102}, {"begin": 14480, "end": 14710, "idx": 103}, {"begin": 14711, "end": 14822, "idx": 104}, {"begin": 14823, "end": 14892, "idx": 105}], "ReferenceToFigure": [{"begin": 11221, "end": 11222, "target": "#fig_0", "idx": 0}, {"begin": 11983, "end": 11986, "target": "#fig_0", "idx": 1}], "Abstract": [{"begin": 109, "end": 1240, "idx": 0}], "SectionFootnote": [{"begin": 14894, "end": 14904, "idx": 0}], "ReferenceString": [{"begin": 14921, "end": 15073, "id": "b0", "idx": 0}, {"begin": 15075, "end": 15239, "id": "b1", "idx": 1}, {"begin": 15243, "end": 15440, "id": "b2", "idx": 2}, {"begin": 15444, "end": 15609, "id": "b3", "idx": 3}, {"begin": 15613, "end": 15780, "id": "b4", "idx": 4}, {"begin": 15784, "end": 16014, "id": "b5", "idx": 5}, {"begin": 16018, "end": 16196, "id": "b6", "idx": 6}, {"begin": 16200, "end": 16386, "id": "b7", "idx": 7}, {"begin": 16390, "end": 16633, "id": "b8", "idx": 8}]}}