{"text": "Generative Modeling by Estimating Gradients of the Data Distribution\n\nAbstract:\nWe introduce a new generative model where samples are produced via Langevin dynamics using gradients of the data distribution estimated with score matching. Because gradients can be ill-defined and hard to estimate when the data resides on low-dimensional manifolds, we perturb the data with different levels of Gaussian noise, and jointly estimate the corresponding scores, i.e., the vector fields of gradients of the perturbed data distribution for all noise levels. For sampling, we propose an annealed Langevin dynamics where we use gradients corresponding to gradually decreasing noise levels as the sampling process gets closer to the data manifold. Our framework allows flexible model architectures, requires no sampling during training or the use of adversarial methods, and provides a learning objective that can be used for principled model comparisons. Our models produce samples comparable to GANs on MNIST, CelebA and CIFAR-10 datasets, achieving a new state-of-the-art inception score of 8.87 on CIFAR-10. Additionally, we demonstrate that our models learn effective representations via image inpainting experiments.\n\nMain:\n\n\n\n1 Introduction\nGenerative models have many applications in machine learning. To list a few, they have been used to generate high-fidelity images [26, 6], synthesize realistic speech and music fragments [58], improve the performance of semi-supervised learning [28, 10], detect adversarial examples and other anomalous data [54], imitation learning [22], and explore promising states in reinforcement learning [41]. Recent progress is mainly driven by two approaches: likelihood-based methods [17, 29, 11, 60] and generative adversarial networks (GAN [15]). The former uses log-likelihood (or a suitable surrogate) as the training objective, while the latter uses adversarial training to minimize f -divergences [40] or integral probability metrics [2, 55] between model and data distributions.\nAlthough likelihood-based models and GANs have achieved great success, they have some intrinsic limitations. For example, likelihood-based models either have to use specialized architectures to build a normalized probability model (e.g., autoregressive models, flow models), or use surrogate losses (e.g., the evidence lower bound used in variational auto-encoders [29], contrastive divergence in energy-based models [21]) for training. GANs avoid some of the limitations of likelihood-based models, but their training can be unstable due to the adversarial training procedure. In addition, the GAN objective is not suitable for evaluating and comparing different GAN models. While other objectives exist for generative modeling, such as noise contrastive estimation [19] and minimum probability flow [50], these methods typically only work well for low-dimensional data.\nIn this paper, we explore a new principle for generative modeling based on estimating and sampling from the (Stein) score [33] of the logarithmic data density, which is the gradient of the log-density function at the input data point. This is a vector field pointing in the direction where the log data density grows the most. We use a neural network trained with score matching [24] to learn this vector field from data. We then produce samples using Langevin dynamics, which approximately 33rd Conference on Neural Information Processing Systems (NeurIPS 2019), Vancouver, Canada.\n\narXiv:1907.05600v3 [cs.LG] 10 Oct 2020\nworks by gradually moving a random initial sample to high density regions along the (estimated) vector field of scores. However, there are two main challenges with this approach. First, if the data distribution is supported on a low dimensional manifold-as it is often assumed for many real world datasets-the score will be undefined in the ambient space, and score matching will fail to provide a consistent score estimator. Second, the scarcity of training data in low data density regions, e.g., far from the manifold, hinders the accuracy of score estimation and slows down the mixing of Langevin dynamics sampling. Since Langevin dynamics will often be initialized in low-density regions of the data distribution, inaccurate score estimation in these regions will negatively affect the sampling process. Moreover, mixing can be difficult because of the need of traversing low density regions to transition between modes of the distribution.\nTo tackle these two challenges, we propose to perturb the data with random Gaussian noise of various magnitudes. Adding random noise ensures the resulting distribution does not collapse to a low dimensional manifold. Large noise levels will produce samples in low density regions of the original (unperturbed) data distribution, thus improving score estimation. Crucially, we train a single score network conditioned on the noise level and estimate the scores at all noise magnitudes. We then propose an annealed version of Langevin dynamics, where we initially use scores corresponding to the highest noise level, and gradually anneal down the noise level until it is small enough to be indistinguishable from the original data distribution. Our sampling strategy is inspired by simulated annealing [30, 37] which heuristically improves optimization for multimodal landscapes.\nOur approach has several desirable properties. First, our objective is tractable for almost all parameterizations of the score networks without the need of special constraints or architectures, and can be optimized without adversarial training, MCMC sampling, or other approximations during training. The objective can also be used to quantitatively compare different models on the same dataset. Experimentally, we demonstrate the efficacy of our approach on MNIST, CelebA [34], and CIFAR-10 [31]. We show that the samples look comparable to those generated from modern likelihood-based models and GANs. On CIFAR-10, our model sets the new state-of-the-art inception score of 8.87 for unconditional generative models, and achieves a competitive FID score of 25.32. We show that the model learns meaningful representations of the data by image inpainting experiments.\n2 Score-based generative modeling Suppose our dataset consists of i.i.d. samples {x i ∈ R D } N i=1 from an unknown data distribution p data (x). We define the score of a probability density p(x) to be ∇ x log p(x). The score network s θ : R D → R D is a neural network parameterized by θ, which will be trained to approximate the score of p data (x). The goal of generative modeling is to use the dataset to learn a model for generating new samples from p data (x). The framework of score-based generative modeling has two ingredients: score matching and Langevin dynamics.\n\n2.1 Score matching for score estimation\nScore matching [24] is originally designed for learning non-normalized statistical models based on i.i.d. samples from an unknown data distribution. Following [53], we repurpose it for score estimation. Using score matching, we can directly train a score network s θ (x) to estimate ∇ x log p data (x) without training a model to estimate p data (x) first. Different from the typical usage of score matching, we opt not to use the gradient of an energy-based model as the score network to avoid extra computation due to higher-order gradients. The objective minimizes 1  2E pdata [ s θ (x) − ∇ x log p data (x)\n], which can be shown equivalent to the following up to a constantE pdata(x) tr(∇ x s θ (x)) + 1 2 s θ (x) 2 2 ,\nwhere ∇ x s θ (x) denotes the Jacobian of s θ (x). As shown in [53], under some regularity conditions the minimizer of Eq. (3) (denoted as s θ * (x)) satisfies s θ * (x) = ∇ x log p data (x) almost surely.\nIn practice, the expectation over p data (x) in Eq. ( 1) can be quickly estimated using data samples. However, score matching is not scalable to deep networks and high dimensional data [53] due to the computation of tr(∇ x s θ (x)). Below we discuss two popular methods for large scale score matching.\nDenoising score matching Denoising score matching [61] is a variant of score matching that completely circumvents tr(∇ x s θ (x)). It first perturbs the data point x with a pre-specified noise distribution q σ (x | x) and then employs score matching to estimate the score of the perturbed data distribution q σ (x) q σ (x | x)p data (x)dx. The objective was proved equivalent to the following:1 2 E qσ(x|x)pdata(x) [ s θ (x) − ∇ x log q σ (x | x) 2 2 ].\nAs shown in [61], the optimal score network (denoted as s θ * (x)) that minimizes Eq. ( 2) satisfies s θ * (x) = ∇ x log q σ (x) almost surely. However, s θ * (x) = ∇ x log q σ (x) ≈ ∇ x log p data (x) is true only when the noise is small enough such that q σ (x) ≈ p data (x).\nSliced score matching Sliced score matching [53] uses random projections to approximate tr(∇ x s θ (x)) in score matching. The objective isE pv E pdata v ∇ x s θ (x)v + 1 2 s θ (x) 2 2 ,\nwhere p v is a simple distribution of random vectors, e.g., the multivariate standard normal. As shown in [53], the term v ∇ x s θ (x)v can be efficiently computed by forward mode auto-differentiation. Unlike denoising score matching which estimates the scores of perturbed data, sliced score matching provides score estimation for the original unperturbed data distribution, but requires around four times more computations due to the forward mode auto-differentiation.\n\n2.2 Sampling with Langevin dynamics\nLangevin dynamics can produce samples from a probability density p(x) using only the score function ∇ x log p(x). Given a fixed step size > 0, and an initial value x0 ∼ π(x) with π being a prior distribution, the Langevin method recursively computes the followingxt = xt−1 + 2 ∇ x log p(x t−1 ) + √ z t ,\nwhere z t ∼ N (0, I). The distribution of xT equals p(x) when → 0 and T → ∞, in which case xT becomes an exact sample from p(x) under some regularity conditions [62]. When > 0 and T < ∞, a Metropolis-Hastings update is needed to correct the error of Eq. ( 4), but it can often be ignored in practice [9, 12, 39]. In this work, we assume this error is negligible when is small and T is large.\nNote that sampling from Eq. ( 4) only requires the score function ∇ x log p(x). Therefore, in order to obtain samples from p data (x), we can first train our score network such that s θ (x) ≈ ∇ x log p data (x) and then approximately obtain samples with Langevin dynamics using s θ (x). This is the key idea of our framework of score-based generative modeling.\n3 Challenges of score-based generative modeling\nIn this section, we analyze more closely the idea of score-based generative modeling. We argue that there are two major obstacles that prevent a naïve application of this idea. The manifold hypothesis states that data in the real world tend to concentrate on low dimensional manifolds embedded in a high dimensional space (a.k.a., the ambient space). This hypothesis empirically holds for many datasets, and has become the foundation of manifold learning [3, 47]. Under the manifold hypothesis, score-based generative models will face two key difficulties. First, since the score ∇ x log p data (x) is a gradient taken in the ambient space, it is undefined when x is confined to a low dimensional manifold. Second, the score matching objective Eq. ( 1) provides a consistent score estimator only when the support of the data distribution is the whole space (cf ., Theorem 2 in [24]), and will be inconsistent when the data reside on a low-dimensional manifold.\n\n3.1 The manifold hypothesis\nThe negative effect of the manifold hypothesis on score estimation can be seen clearly from Fig. 1, where we train a ResNet (details in Appendix B.1) to estimate the data score on CIFAR-10. For fast training and faithful estimation of the data scores, we use the sliced score matching objective (Eq. ( 3)). As Fig. 1 (left) shows, when trained on the original CIFAR-10 images, the sliced score matching loss first decreases and then fluctuates irregularly. In contrast, if we perturb the data with a small Gaussian noise (such that the perturbed data distribution has full support over R D ), the loss curve will converge (right panel). Note that the Gaussian noise N (0, 0.0001) we impose is very small for images with pixel values in the range [0, 1], and is almost indistinguishable to human eyes.\n\n3.2 Low data density regions\nThe scarcity of data in low density regions can cause difficulties for both score estimation with score matching and MCMC sampling with Langevin dynamics. In regions of low data density, score matching may not have enough evidence to estimate score functions accurately, due to the lack of data samples. To see this, recall from Section 2.1 that score matching minimizes the expected squared error of the score estimates, i.e.,\n\n3.2.1 Inaccurate score estimation with score matching\n1 2 E pdata [ s θ (x) − ∇ x log p data (x)]. In practice, the expectation w.r.t. the data distribution is always estimated using i.i.d. samples{x i } N i=1 i.i.d. ∼ p data (x). Consider any region R ⊂ R D such that p data (R) ≈ 0. In most cases {x i } N i=1 ∩ R = ∅,\nand score matching will not have sufficient data samples to estimate ∇ x log p data (x) accurately for x ∈ R.\nTo demonstrate the negative effect of this, we provide the result of a toy experiment (details in Appendix B.1) in Fig. 2 where we use sliced score matching to estimate scores of a mixture of Gaussians p data = 1  5 N ((−5, −5), I) + 4 5 N ((5, 5), I). As the figure demonstrates, score estimation is only reliable in the immediate vicinity of the modes of p data , where the data density is high.\n\n3.2.2 Slow mixing of Langevin dynamics\nWhen two modes of the data distribution are separated by low density regions, Langevin dynamics will not be able to correctly recover the relative weights of these two modes in reasonable time, and therefore might not converge to the true distribution. Our analyses of this are largely inspired by [63], which analyzed the same phenomenon in the context of density estimation with score matching.\nConsider a mixture distribution p data (x) = πp 1 (x)+(1−π)p 2 (x), where p 1 (x) and p 2 (x) are normalized distributions with disjoint supports, and π ∈ (0, 1). In the support of p 1 (x), ∇ x log p data (x) = ∇ x (log π + log p 1 (x)) = ∇ x log p 1 (x), and in the support of p 2 (x), ∇ x log p data (x) = ∇ x (log(1 − π) + log p 2 (x)) = ∇ x log p 2 (x). In either case, the score ∇ x log p data (x) does not depend on π. Since Langevin dynamics use ∇ x log p data (x) to sample from p data (x), the samples obtained will not depend on π. In practice, this analysis also holds when different modes have approximately disjoint supports-they may share the same support but be connected by regions of small data density. In this case, Langevin dynamics can produce correct samples in theory, but may require a very small step size and a very large number of steps to mix.\nTo verify this analysis, we test Langevin dynamics sampling for the same mixture of Gaussian used in Section 3.2.1 and provide the results in Fig. 3. We use the ground truth scores when sampling with Langevin dynamics. Comparing Fig. 3(b) with (a), it is obvious that the samples from Langevin dynamics have incorrect relative density between the two modes, as predicted by our analysis.\n\n4 Noise Conditional Score Networks: learning and inference\nWe observe that perturbing data with random Gaussian noise makes the data distribution more amenable to score-based generative modeling. First, since the support of our Gaussian noise distribution is the whole space, the perturbed data will not be confined to a low dimensional manifold, which obviates difficulties from the manifold hypothesis and makes score estimation well-defined. Second, large Gaussian noise has the effect of filling low density regions in the original unperturbed data distribution; therefore score matching may get more training signal to improve score estimation. Furthermore, by using multiple noise levels we can obtain a sequence of noise-perturbed distributions that converge to the true data distribution. We can improve the mixing rate of Langevin dynamics on multimodal distributions by leveraging these intermediate distributions in the spirit of simulated annealing [30] and annealed importance sampling [37].\nBuilt upon this intuition, we propose to improve score-based generative modeling by 1) perturbing the data using various levels of noise; and 2) simultaneously estimating scores corresponding to all noise levels by training a single conditional score network. After training, when using Langevin dynamics to generate samples, we initially use scores corresponding to large noise, and gradually anneal down the noise level. This helps smoothly transfer the benefits of large noise levels to low noise levels where the perturbed data are almost indistinguishable from the original ones. In what follows, we will elaborate more on the details of our method, including the architecture of our score networks, the training objective, and the annealing schedule for Langevin dynamics.\n\n4.1 Noise Conditional Score Networks\nLet {σ i } L i=1 be a positive geometric sequence that satisfiesσ1 σ2 = • • • = σ L−1 σ L > 1. Let q σ (x) p data (t)N (x | t, σ\nI)dt denote the perturbed data distribution. We choose the noise levels {σ i } L i=1 such that σ 1 is large enough to mitigate the difficulties discussed in Section 3, and σ L is small enough to minimize the effect on data. We aim to train a conditional score network to jointly estimate the scores of all perturbed data distributions, i.e., ∀σ ∈ {σ i } L i=1 : s θ (x, σ) ≈ ∇ x log q σ (x). Note that s θ (x, σ) ∈ R D when x ∈ R D . We call s θ (x, σ) a Noise Conditional Score Network (NCSN).\nSimilar to likelihood-based generative models and GANs, the design of model architectures plays an important role in generating high quality samples. In this work, we mostly focus on architectures useful for image generation, and leave the architecture design for other domains as future work. Since the output of our noise conditional score network s θ (x, σ) has the same shape as the input image x, we draw inspiration from successful model architectures for dense prediction of images (e.g., semantic segmentation). In the experiments, our model s θ (x, σ) combines the architecture design of U-Net [46] with dilated/atrous convolution [64, 65, 8] -both of which have been proved very successful in semantic segmentation. In addition, we adopt instance normalization in our score network, inspired by its superior performance in some image generation tasks [57, 13, 23], and we use a modified version of conditional instance normalization [13] to provide conditioning on σ i . More details on our architecture can be found in Appendix A.\n\n4.2 Learning NCSNs via score matching\nBoth sliced and denoising score matching can train NCSNs. We adopt denoising score matching as it is slightly faster and naturally fits the task of estimating scores of noise-perturbed data distributions. However, we emphasize that empirically sliced score matching can train NCSNs as well as denoising score matching. We choose the noise distribution to be q σ (x | x) = N (x | x, σ 2 I); therefore ∇ x log q σ (x | x) = − (x−x) /σ 2 . For a given σ, the denoising score matching objective (Eq. ( 2)) is(θ; σ) 1 2 E pdata(x) E x∼N (x,σ 2 I) s θ (x, σ) + x − x σ 2 2 2 .\nThen, we combine Eq. ( 5) for all σ ∈ {σ i } L i=1 to get one unified objectiveL(θ; {σ i } L i=1 ) 1 L L i=1 λ(σ i ) (θ; σ i ),\nwhere λ(σ i ) > 0 is a coefficient function depending on σ i . Assuming s θ (x, σ) has enough capacity, s θ * (x, σ) minimizes Eq. ( 6) if and only if s θ * (x, σ i ) = ∇ x log q σi (x) a.s. for all i ∈ {1, 2, • • • , L}, because Eq. ( 6) is a conical combination of L denoising score matching objectives.\nThere can be many possible choices of λ(•). Ideally, we hope that the values of λ(σ i ) (θ; σ i ) for all {σ i } L i=1 are roughly of the same order of magnitude. Empirically, we observe that when the score networks are trained to optimality, we approximately have s θ (x, σ) 2 ∝ 1 /σ. This inspires us to choose λ(σ) = σ 2 . Because under this choice, we have λ(σ)(θ; σ) = σ 2 (θ; σ) = 1 2 E[ σs θ (x, σ) + x−x σ 2 2 ]. Since x−x\nσ ∼ N (0, I) and σs θ (x, σ) 2 ∝ 1, we can easily conclude that the order of magnitude of λ(σ) (θ; σ) does not depend on σ.\nWe emphasize that our objective Eq. ( 6) requires no adversarial training, no surrogate losses, and no sampling from the score network during training (e.g., unlike contrastive divergence). Also, it does not require s θ (x, σ) to have special architectures in order to be tractable. In addition, when λ(•) and {σ i } L i=1 are fixed, it can be used to quantitatively compare different NCSNs.\n\n4.3 NCSN inference via annealed Langevin dynamics\nAlgorithm 1 Annealed Langevin dynamics.\nRequire:{σ i } L i=1 , , T . 1: Initialize x0 2: for i ← 1 to L do 3: α i ← • σ 2 i /σ 2 L α i is the step size. 4:\nfor t ← 1 to T do 5:\nDraw z t ∼ N (0, I)6: xt ← xt−1 + α i 2 s θ (x t−1 , σ i ) + √ α i z t 7:\nend for 8:\nx0 ← xT 9: end for return xT After the NCSN s θ (x, σ) is trained, we propose a sampling approach-annealed Langevin dynamics (Alg. 1)-to produced samples, inspired by simulated annealing [30] and annealed importance sampling [37]. As shown in Alg. 1, we start annealed Langevin dynamics by initializing the samples from some fixed prior distribution, e.g., uniform noise. Then, we run Langevin dynamics to sample from q σ1 (x) with step size α 1 . Next, we run Langevin dynamics to sample from q σ2 (x), starting from the final samples of the previous simulation and using a reduced step size α 2 . We continue in this fashion, using the final samples of Langevin dynamics for q σi−1 (x) as the initial samples of Langevin dynamic for q σi (x), and tuning down the step size α i gradually with α i = • σ 2 i /σ 2 L . Finally, we run Langevin dynamics to sample from q σ L (x), which is close to p data (x) when σ L ≈ 0.\nSince the distributions {q σi } L i=1 are all perturbed by Gaussian noise, their supports span the whole space and their scores are well-defined, avoiding difficulties from the manifold hypothesis. When σ 1 is sufficiently large, the low density regions of q σ1 (x) become small and the modes become less isolated. As discussed previously, this can make score estimation more accurate, and the mixing of Langevin dynamics faster. We can therefore assume that Langevin dynamics produce good samples for q σ1 (x). These samples are likely to come from high density regions of q σ1 (x), which means  they are also likely to reside in the high density regions of q σ2 (x), given that q σ1 (x) and q σ2 (x) only slightly differ from each other. As score estimation and Langevin dynamics perform better in high density regions, samples from q σ1 (x) will serve as good initial samples for Langevin dynamics of q σ2 (x). Similarly, q σi−1 (x) provides good initial samples for q σi (x), and finally we obtain samples of good quality from q σ L (x).\nThere could be many possible ways of tuning α i according to σ i in Alg. 1. Our choice is α i ∝ σ 2 i . The motivation is to fix the magnitude of the \"signal-to-noise\" ratio αis θ (x,σi) 2√ αi z in Langevin dynam- ics. Note that E[ αis θ (x,σi) 2 √ αi z 2 2 ] ≈ E[ αi s θ (x,σi) 2 2 4 ] ∝ 1 4 E[ σ i s θ (x, σ i ) 2 2 ]\n. Recall that empirically we found s θ (x, σ) 2 ∝ 1 /σ when the score network is trained close to optimal, in which caseE[ σ i s θ (x; σ i ) 2 2 ] ∝ 1. Therefore αis θ (x,σi) 2 √ αi z 2 ∝ 1 4 E[ σ i s θ (x, σ i ) 2 2\n] ∝ 1 4 does not depend on σ i . To demonstrate the efficacy of our annealed Langevin dynamics, we provide a toy example where the goal is to sample from a mixture of Gaussian with two well-separated modes using only scores. We apply Alg. 1 to sample from the mixture of Gausssian used in Section 3.2. In the experiment, we choose {σ i } L i=1 to be a geometric progression, with L = 10, σ 1 = 10 and σ 10 = 0.1. The results are provided in Fig. 3. Comparing Fig. 3 (b) against (c), annealed Langevin dynamics correctly recover the relative weights between the two modes whereas standard Langevin dynamics fail.\n\n5 Experiments\nIn this section, we demonstrate that our NCSNs are able to produce high quality image samples on several commonly used image datasets. In addition, we show that our models learn reasonable image representations by image inpainting experiments.\nSetup We use MNIST, CelebA [34], and CIFAR-10 [31] datasets in our experiments. For CelebA, the images are first center-cropped to 140 × 140 and then resized to 32 × 32. All images are rescaled so that pixel values are in [0, 1]. We choose L = 10 different standard deviations such that {σ i } L i=1 is a geometric sequence with σ 1 = 1 and σ 10 = 0.01. Note that Gaussian noise of σ = 0.01 is almost indistinguishable to human eyes for image data. When using annealed Langevin dynamics for image generation, we choose T = 100 and = 2 × 10 −5 , and use uniform noise as our initial samples. We found the results are robust w.r.t. the choice of T , and between 5 × 10 −6 and 5 × 10 −5 generally works fine. We provide additional details on model architecture and settings in Appendix A and B.\nImage generation In Fig. 5, we show uncurated samples from annealed Langevin dynamics for MNIST, CelebA and CIFAR-10. As shown by the samples, our generated images have higher or comparable quality to those from modern likelihood-based models and GANs. To intuit the procedure of annealed Langevin dynamics, we provide intermediate samples in Fig. 4, where each row shows  how samples evolve from pure random noise to high quality images. More samples from our approach can be found in Appendix C. We also show the nearest neighbors of generated images in the training dataset in Appendix C.2, in order to demonstrate that our model is not simply memorizing training images. To show it is important to learn a conditional score network jointly for many noise levels and use annealed Langevin dynamics, we compare against a baseline approach where we only consider one noise level {σ 1 = 0.01} and use the vanilla Langevin dynamics sampling method. Although this small added noise helps circumvent the difficulty of the manifold hypothesis (as shown by Fig. 1, things will completely fail if no noise is added), it is not large enough to provide information on scores in regions of low data density. As a result, this baseline fails to generate reasonable images, as shown by samples in Appendix C.1.\nFor quantitative evaluation, we report inception [48] and FID [20] scores on CIFAR-10 in Tab. 1. As an unconditional model, we achieve the state-of-the-art inception score of 8.87, which is even better than most reported values for class-conditional generative models. Our FID score 25.32 on CIFAR-10 is also comparable to top existing models, such as SNGAN [36]. We omit scores on MNIST and CelebA as the scores on these two datasets are not widely reported, and different preprocessing (such as the center crop size of CelebA) can lead to numbers not directly comparable.\nImage inpainting In Fig. 6, we demonstrate that our score networks learn generalizable and semantically meaningful image representations that allow it to produce diverse image inpaintings. Note that some previous models such as PixelCNN can only impute images in the raster scan order. In contrast, our method can naturally handle images with occlusions of arbitrary shapes by a simple modification of the annealed Langevin dynamics procedure (details in Appendix B.3). We provide more image inpainting results in Appendix C.5.\n\n6 Related work\nOur approach has some similarities with methods that learn the transition operator of a Markov chain for sample generation [4, 51, 5, 16, 52]. For example, generative stochastic networks (GSN [4, 1]) use denoising autoencoders to train a Markov chain whose equilibrium distribution matches the data distribution. Similarly, our method trains the score function used in Langevin dynamics to sample from the data distribution. However, GSN often starts the chain very close to a training data point, and therefore requires the chain to transition quickly between different modes. In contrast, our annealed Langevin dynamics are initialized from unstructured noise. Nonequilibrium Thermodynamics (NET [51]) used a prescribed diffusion process to slowly transform data into random noise, and then learned to reverse this procedure by training an inverse diffusion. However, NET is not very scalable because it requires the diffusion process to have very small steps, and needs to simulate chains with thousands of steps at training time.\nPrevious approaches such as Infusion Training (IT [5]) and Variational Walkback (VW [16]) also employed different noise levels/temperatures for training transition operators of a Markov chain.\nBoth IT and VW (as well as NET) train their models by maximizing the evidence lower bound of a suitable marginal likelihood. In practice, they tend to produce blurry image samples, similar to variational autoencoders. In contrast, our objective is based on score matching instead of likelihood, and we can produce images comparable to GANs.\nThere are several structural differences that further distinguish our approach from previous methods discussed above. First, we do not need to sample from a Markov chain during training. In contrast, the walkback procedure of GSNs needs multiple runs of the chain to generate \"negative samples\". Other methods including NET, IT, and VW also need to simulate a Markov chain for every input to compute the training loss. This difference makes our approach more efficient and scalable for training deep models. Secondly, our training and sampling methods are decoupled from each other. For score estimation, both sliced and denoising score matching can be used. For sampling, any method based on scores is applicable, including Langevin dynamics and (potentially) Hamiltonian Monte Carlo [38]. Our framework allows arbitrary combinations of score estimators and (gradient-based) sampling approaches, whereas most previous methods tie the model to a specific Markov chain. Finally, our approach can be used to train energy-based models (EBM) by using the gradient of an energy-based model as the score model. In contrast, it is unclear how previous methods that learn transition operators of Markov chains can be directly used for training EBMs.\nScore matching was originally proposed for learning EBMs. However, many existing methods based on score matching are either not scalable [24] or fail to produce samples of comparable quality to VAEs or GANs [27, 49]. To obtain better performance on training deep energy-based models, some recent works have resorted to contrastive divergence [21], and propose to sample with Langevin dynamics for both training and testing [12, 39]. However, unlike our approach, contrastive divergence uses the computationally expensive procedure of Langevin dynamics as an inner loop during training. The idea of combining annealing with denoising score matching has also been investigated in previous work under different contexts. In [14, 7, 66], different annealing schedules on the noise for training denoising autoencoders are proposed. However, their work is on learning representations for improving the performance of classification, instead of generative modeling.\nThe method of denoising score matching can also be derived from the perspective of Bayes least squares [43, 44], using techniques of Stein's Unbiased Risk Estimator [35, 56].\n\n7 Conclusion\nWe propose the framework of score-based generative modeling where we first estimate gradients of data densities via score matching, and then generate samples via Langevin dynamics. We analyze several challenges faced by a naïve application of this approach, and propose to tackle them by training Noise Conditional Score Networks (NCSN) and sampling with annealed Langevin dynamics. Our approach requires no adversarial training, no MCMC sampling during training, and no special model architectures. Experimentally, we show that our approach can generate high quality images that were previously only produced by the best likelihood-based models and GANs. We achieve the new state-of-the-art inception score on CIFAR-10, and an FID score comparable to SNGANs.\n\nA Architectures\nThe architecture of our used in the experiments has three important components: instance normalization, dilated convolutions and U-Net-type architectures. Below we give more background on them and discuss how we modified them to suit our purpose. For more comprehensive details and a reference implementation, we recommend the readers to check our publicly available code base. Our score networks are implemented in PyTorch. Code and checkpoints are available at https://github.com/ermongroup/ncsn.\n\nA.1 Instance normalization\nWe use conditional instance normalization [13] so that s θ (x, σ) takes account of σ when predicting the scores. In conditional instance normalization, a different set of scales and biases is used for different σ ∈ {σ i } L i=1 . More specifically, suppose x is an input with C feature maps. Let µ k and s k denote the mean and standard deviation of the k-th feature map of x, taken along the spatial axes. Conditional instance normalization is achieved byz k = γ[i, k] x k − µ k s k + β[i, k],\nwhere γ ∈ R L×C and β ∈ R L×C are learnable parameters, k denotes the index of feature maps, and i denotes the index of σ in {σ i } L i=1 . However, one downside of instance normalization is that it completely removes the information of µ k for different feature maps. This can lead to shifted colors in the generated images. To fix this issue, we propose a simple modification to conditional instance normalization. First, we compute the mean and standard deviation of µ k 's and denote them as m and v respectively. Then, we add another learnable parameter α ∈ R L×C . The modified conditional instance normalization is defined asz k = γ[i, k] x k − µ k s k + β[i, k] + α[i, k] µ k − m v .\nWe abbreviate this modification of conditional instance normalization as CondInstanceNorm++. In our architecture, we add CondInstanceNorm++ before every convolutional layer and pooling layer.\n\nA.2 Dilated convolutions\nDilated convolutions can be used to increase the size of receptive field while maintaining the resolution of feature maps. It has been shown very effective in semantic segmentation because they preserve the location information better using feature maps of larger resolutions. In our architecture design of NCSNs, we use it to replace all the subsampling layers except the first one.\n\nA.3 U-Net architecture\nU-Net is an architecture with special skip connections. These skip connections help transfer lower level information in shallow layers to deeper layers of the network. Since the shallower layers often contain low level information such as location and shape, these skip connections help improve the result of semantic segmentation. For building s θ (x, σ), we use the architecture of RefineNet [32], a modern variant of U-Net that also incorporates ResNet designs. We refer the readers to [32] for a detailed description of the RefineNet architecture.\nIn our experiments, we use a 4-cascaded RefineNet. We use pre-activation residual blocks. We remove all batch normalizations in the RefineNet architecture, and replace them with CondInstanceNorm++. We replace the max pooling layers in Refine Blocks with average pooling, as average pooling is reported to produce smoother images for image generation tasks such as style transfer. In addition, we also add CondInstanceNorm++ before each convolution and average pooling in the Refine Blocks, although no normalization is used in the original Refine Blocks. All activation functions are chosen to be ELU. As mentioned previously, we use dilated convolutions to replace the subsampling layers in residual blocks, except the first one. Following the common practice, we increase the dilation by a factor of 2 when proceeding to the next cascade. For CelebA and CIFAR-10 experiments, the number of filters for layers corresponding to the first cascade is 128, while the number of filters for other cascades are doubled. For MNIST experiments, the number of filters are halved.α i ← • σ 2 i /σ 2 L\nα i is the step size.\n\nFootnotes:\n\nReferences:\n\n- G. Alain, Y. Bengio, L. Yao, J. Yosinski, E. Thibodeau-Laufer, S. Zhang, and P. Vincent. GSNs: generative stochastic networks. Information and Inference, 2016.- M. Arjovsky, S. Chintala, and L. Bottou. Wasserstein generative adversarial networks. In D. Precup and Y. W. Teh, editors, Proceedings of the 34th International Conference on Ma- chine Learning, volume 70 of Proceedings of Machine Learning Research, pages 214-223, International Convention Centre, Sydney, Australia, 06-11 Aug 2017. PMLR.\n\n- M. Belkin and P. Niyogi. Laplacian eigenmaps for dimensionality reduction and data represen- tation. Neural computation, 15(6):1373-1396, 2003.\n\n- Y. Bengio, L. Yao, G. Alain, and P. Vincent. Generalized denoising auto-encoders as generative models. In Advances in neural information processing systems, pages 899-907, 2013.\n\n- F. Bordes, S. Honari, and P. Vincent. Learning to generate samples from noise through infusion training. arXiv preprint arXiv:1703.06975, 2017.\n\n- A. Brock, J. Donahue, and K. Simonyan. Large scale GAN training for high fidelity natural image synthesis. In International Conference on Learning Representations, 2019.\n\n- B. Chandra and R. K. Sharma. Adaptive noise schedule for denoising autoencoder. In Interna- tional conference on neural information processing, pages 535-542. Springer, 2014.\n\n- L.-C. Chen, G. Papandreou, I. Kokkinos, K. Murphy, and A. L. Yuille. Deeplab: Semantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs. IEEE transactions on pattern analysis and machine intelligence, 40(4):834-848, 2017.\n\n- T. Chen, E. Fox, and C. Guestrin. Stochastic gradient hamiltonian monte carlo. In International conference on machine learning, pages 1683-1691, 2014.\n\n- Z. Dai, Z. Yang, F. Yang, W. W. Cohen, and R. R. Salakhutdinov. Good semi-supervised learning that requires a bad gan. In Advances in neural information processing systems, pages 6510-6520, 2017.\n\n- L. Dinh, D. Krueger, and Y. Bengio. Nice: Non-linear independent components estimation. arXiv preprint arXiv:1410.8516, 2014.\n\n- Y. Du and I. Mordatch. Implicit generation and generalization in energy-based models. arXiv preprint arXiv:1903.08689, 2019.\n\n- V. Dumoulin, J. Shlens, and M. Kudlur. A learned representation for artistic style. In Interna- tional Conference on Learning Representations 2017, 2017.\n\n- K. J. Geras and C. Sutton. Scheduled denoising autoencoders. arXiv preprint arXiv:1406.3269, 2014.\n\n- I. Goodfellow, J. Pouget-Abadie, M. Mirza, B. Xu, D. Warde-Farley, S. Ozair, A. Courville, and Y. Bengio. Generative adversarial nets. In Advances in neural information processing systems, pages 2672-2680, 2014.\n\n- A. G. A. P. Goyal, N. R. Ke, S. Ganguli, and Y. Bengio. Variational walkback: Learning a transition operator as a stochastic recurrent net. In Advances in Neural Information Processing Systems, pages 4392-4402, 2017.\n\n- A. Graves. Generating sequences with recurrent neural networks. arXiv preprint arXiv:1308.0850, 2013.\n\n- I. Gulrajani, F. Ahmed, M. Arjovsky, V. Dumoulin, and A. C. Courville. Improved training of wasserstein gans. In Advances in Neural Information Processing Systems, pages 5767-5777, 2017.\n\n- M. Gutmann and A. Hyvärinen. Noise-contrastive estimation: A new estimation principle for unnormalized statistical models. In Proceedings of the Thirteenth International Conference on Artificial Intelligence and Statistics, pages 297-304, 2010.\n\n- M. Heusel, H. Ramsauer, T. Unterthiner, B. Nessler, and S. Hochreiter. Gans trained by a two time-scale update rule converge to a local nash equilibrium. In Advances in Neural Information Processing Systems, pages 6626-6637, 2017.\n\n- G. E. Hinton. Training products of experts by minimizing contrastive divergence. Neural computation, 14(8):1771-1800, 2002.\n\n- J. Ho and S. Ermon. Generative adversarial imitation learning. In Advances in Neural Informa- tion Processing Systems, pages 4565-4573, 2016.\n\n- X. Huang and S. Belongie. Arbitrary style transfer in real-time with adaptive instance nor- malization. In Proceedings of the IEEE International Conference on Computer Vision, pages 1501-1510, 2017.\n\n- A. Hyvärinen. Estimation of non-normalized statistical models by score matching. Journal of Machine Learning Research, 6(Apr):695-709, 2005.\n\n- T. Karras, T. Aila, S. Laine, and J. Lehtinen. Progressive growing of GANs for improved quality, stability, and variation. In International Conference on Learning Representations, 2018.\n\n- T. Karras, S. Laine, and T. Aila. A style-based generator architecture for generative adversarial networks. arXiv preprint arXiv:1812.04948, 2018.\n\n- D. Kingma and Y. LeCun. Regularized estimation of image statistics by score matching. In Advances in Neural Information Processing Systems 23: 24th Annual Conference on Neural Information Processing Systems 2010, NIPS 2010, 2010.\n\n- D. P. Kingma, S. Mohamed, D. J. Rezende, and M. Welling. Semi-supervised learning with deep generative models. In Advances in neural information processing systems, pages 3581-3589, 2014.\n\n- D. P. Kingma and M. Welling. Auto-encoding variational bayes. In ICLR, 2014.\n\n- S. Kirkpatrick, C. D. Gelatt, and M. P. Vecchi. Optimization by simulated annealing. SCIENCE, 220(4598):671-680, 1983.\n\n- A. Krizhevsky. Learning multiple layers of features from tiny images. Technical report, 2009.\n\n- G. Lin, A. Milan, C. Shen, and I. Reid. Refinenet: Multi-path refinement networks for high- resolution semantic segmentation. In Proceedings of the IEEE conference on computer vision and pattern recognition, pages 1925-1934, 2017.\n\n- Q. Liu, J. Lee, and M. Jordan. A kernelized stein discrepancy for goodness-of-fit tests. In International Conference on Machine Learning, pages 276-284, 2016.\n\n- Z. Liu, P. Luo, X. Wang, and X. Tang. Deep learning face attributes in the wild. In Proceedings of International Conference on Computer Vision (ICCV), 2015.\n\n- K. Miyasawa. An empirical bayes estimator of the mean of a normal population. Bull. Inst. Internat. Statist, 38(181-188):1-2, 1961.\n\n- T. Miyato, T. Kataoka, M. Koyama, and Y. Yoshida. Spectral normalization for generative adversarial networks. In International Conference on Learning Representations, 2018.\n\n- R. M. Neal. Annealed importance sampling. Statistics and computing, 11(2):125-139, 2001.\n\n- R. M. Neal. Mcmc using hamiltonian dynamics. arXiv preprint arXiv:1206.1901, 2012.\n\n- E. Nijkamp, M. Hill, T. Han, S.-C. Zhu, and Y. N. Wu. On the anatomy of mcmc-based maximum likelihood learning of energy-based models. arXiv preprint arXiv:1903.12370, 2019.\n\n- S. Nowozin, B. Cseke, and R. Tomioka. f-gan: Training generative neural samplers using variational divergence minimization. In Advances in neural information processing systems, pages 271-279, 2016.\n\n- G. Ostrovski, M. G. Bellemare, A. van den Oord, and R. Munos. Count-based exploration with neural density models. In Proceedings of the 34th International Conference on Machine Learning-Volume 70, pages 2721-2730. JMLR. org, 2017.\n\n- G. Ostrovski, W. Dabney, and R. Munos. Autoregressive quantile networks for generative modeling. In ICML, volume 80 of Proceedings of Machine Learning Research, pages 3933- 3942. PMLR, 2018.\n\n- M. Raphan and E. P. Simoncelli. Learning to be bayesian without supervision. In Advances in neural information processing systems, pages 1145-1152, 2007.\n\n- M. Raphan and E. P. Simoncelli. Least squares estimation without priors or supervision. Neural computation, 23(2):374-420, 2011.\n\n- S. Ravuri, S. Mohamed, M. Rosca, and O. Vinyals. Learning implicit generative models with the method of learned moments. In J. Dy and A. Krause, editors, Proceedings of the 35th International Conference on Machine Learning, volume 80 of Proceedings of Machine Learning Research, pages 4314-4323, Stockholmsmässan, Stockholm Sweden, 10-15 Jul 2018. PMLR.\n\n- O. Ronneberger, P.Fischer, and T. Brox. U-net: Convolutional networks for biomedical image segmentation. In Medical Image Computing and Computer-Assisted Intervention (MICCAI), volume 9351 of LNCS, pages 234-241. Springer, 2015. (available on arXiv:1505.04597 [cs.CV]).\n\n- S. T. Roweis and L. K. Saul. Nonlinear dimensionality reduction by locally linear embedding. science, 290(5500):2323-2326, 2000.\n\n- T. Salimans, I. Goodfellow, W. Zaremba, V. Cheung, A. Radford, and X. Chen. Improved techniques for training gans. In Advances in neural information processing systems, pages 2234-2242, 2016.\n\n- S. Saremi, A. Mehrjou, B. Schölkopf, and A. Hyvärinen. Deep energy estimator networks. arXiv preprint arXiv:1805.08306, 2018.\n\n- J. Sohl-Dickstein, P. Battaglino, and M. R. DeWeese. Minimum probability flow learning. arXiv preprint arXiv:0906.4779, 2009.\n\n- J. Sohl-Dickstein, E. Weiss, N. Maheswaranathan, and S. Ganguli. Deep unsupervised learning using nonequilibrium thermodynamics. In International Conference on Machine Learning, pages 2256-2265, 2015.\n\n- J. Song, S. Zhao, and S. Ermon. A-nice-mc: Adversarial training for mcmc. In Advances in Neural Information Processing Systems, pages 5140-5150, 2017.\n\n- Y. Song, S. Garg, J. Shi, and S. Ermon. Sliced score matching: A scalable approach to density and score estimation. In Proceedings of the Thirty-Fifth Conference on Uncertainty in Artificial Intelligence, UAI 2019, Tel Aviv, Israel, July 22-25, 2019, page 204, 2019.\n\n- Y. Song, T. Kim, S. Nowozin, S. Ermon, and N. Kushman. Pixeldefend: Leveraging generative models to understand and defend against adversarial examples. In International Conference on Learning Representations, 2018.\n\n- B. K. Sriperumbudur, K. Fukumizu, A. Gretton, B. Schölkopf, and G. R. Lanckriet. On integral probability metrics,\\phi-divergences and binary classification. arXiv preprint arXiv:0901.2698, 2009.\n\n- C. M. Stein. Estimation of the mean of a multivariate normal distribution. The annals of Statistics, pages 1135-1151, 1981.\n\n- D. Ulyanov, A. Vedaldi, and V. Lempitsky. Instance normalization: The missing ingredient for fast stylization. arXiv preprint arXiv:1607.08022, 2016.\n\n- A. van den Oord, S. Dieleman, H. Zen, K. Simonyan, O. Vinyals, A. Graves, N. Kalchbrenner, A. Senior, and K. Kavukcuoglu. Wavenet: A generative model for raw audio. In Arxiv, 2016.\n\n- A. Van den Oord, N. Kalchbrenner, L. Espeholt, O. Vinyals, A. Graves, et al. Conditional image generation with pixelcnn decoders. In Advances in neural information processing systems, pages 4790-4798, 2016.\n\n- A. Van Den Oord, N. Kalchbrenner, and K. Kavukcuoglu. Pixel recurrent neural networks. In Proceedings of the 33rd International Conference on International Conference on Machine Learning -Volume 48, ICML'16, pages 1747-1756. JMLR.org, 2016.\n\n- P. Vincent. A connection between score matching and denoising autoencoders. Neural compu- tation, 23(7):1661-1674, 2011.\n\n- M. Welling and Y. W. Teh. Bayesian learning via stochastic gradient langevin dynamics. In Proceedings of the 28th international conference on machine learning (ICML-11), pages 681-688, 2011.\n\n- L. Wenliang, D. Sutherland, H. Strathmann, and A. Gretton. Learning deep kernels for expo- nential family densities. In International Conference on Machine Learning, pages 6737-6746, 2019.\n\n- F. Yu and V. Koltun. Multi-scale context aggregation by dilated convolutions. In International Conference on Learning Representations (ICLR), 2016.\n\n- F. Yu, V. Koltun, and T. Funkhouser. Dilated residual networks. In Computer Vision and Pattern Recognition (CVPR), 2017.\n\n- Q. Zhang and L. Zhang. Convolutional adaptive denoising autoencoders for hierarchical feature extraction. Frontiers of Computer Science, 12(6):1140-1148, 2018.\n\n", "annotations": {"SectionMain": [{"begin": 1218, "end": 36470, "idx": 0}], "ReferenceToFormula": [{"begin": 7801, "end": 7802, "target": "#formula_1", "idx": 0}, {"begin": 8591, "end": 8592, "target": "#formula_0", "idx": 1}, {"begin": 10037, "end": 10038, "target": "#formula_4", "idx": 2}, {"begin": 10203, "end": 10204, "target": "#formula_4", "idx": 3}, {"begin": 11332, "end": 11333, "target": "#formula_1", "idx": 4}, {"begin": 11874, "end": 11875, "target": "#formula_3", "idx": 5}, {"begin": 19384, "end": 19385, "target": "#formula_0", "idx": 6}, {"begin": 19480, "end": 19481, "target": "#formula_8", "idx": 7}, {"begin": 19718, "end": 19719, "target": "#formula_9", "idx": 8}, {"begin": 19821, "end": 19822, "target": "#formula_9", "idx": 9}, {"begin": 20484, "end": 20485, "target": "#formula_9", "idx": 10}], "SectionReference": [{"begin": 36484, "end": 48123, "idx": 0}], "SectionHeader": [{"begin": 0, "end": 1218, "idx": 0}], "Div": [{"begin": 80, "end": 1210, "idx": 0}, {"begin": 1221, "end": 3469, "idx": 1}, {"begin": 3471, "end": 6775, "idx": 2}, {"begin": 6777, "end": 9438, "idx": 3}, {"begin": 9440, "end": 11542, "idx": 4}, {"begin": 11544, "end": 12372, "idx": 5}, {"begin": 12374, "end": 12830, "idx": 6}, {"begin": 12832, "end": 13660, "idx": 7}, {"begin": 13662, "end": 15357, "idx": 8}, {"begin": 15359, "end": 17142, "idx": 9}, {"begin": 17144, "end": 18846, "idx": 10}, {"begin": 18848, "end": 20837, "idx": 11}, {"begin": 20839, "end": 24261, "idx": 12}, {"begin": 24263, "end": 27714, "idx": 13}, {"begin": 27716, "end": 31674, "idx": 14}, {"begin": 31676, "end": 32448, "idx": 15}, {"begin": 32450, "end": 32964, "idx": 16}, {"begin": 32966, "end": 34371, "idx": 17}, {"begin": 34373, "end": 34781, "idx": 18}, {"begin": 34783, "end": 36470, "idx": 19}], "Head": [{"begin": 1221, "end": 1235, "n": "1", "idx": 0}, {"begin": 3471, "end": 3509, "idx": 1}, {"begin": 6777, "end": 6816, "n": "2.1", "idx": 2}, {"begin": 9440, "end": 9475, "n": "2.2", "idx": 3}, {"begin": 11544, "end": 11571, "n": "3.1", "idx": 4}, {"begin": 12374, "end": 12402, "n": "3.2", "idx": 5}, {"begin": 12832, "end": 12885, "n": "3.2.1", "idx": 6}, {"begin": 13662, "end": 13700, "n": "3.2.2", "idx": 7}, {"begin": 15359, "end": 15417, "n": "4", "idx": 8}, {"begin": 17144, "end": 17180, "n": "4.1", "idx": 9}, {"begin": 18848, "end": 18885, "n": "4.2", "idx": 10}, {"begin": 20839, "end": 20888, "n": "4.3", "idx": 11}, {"begin": 24263, "end": 24276, "n": "5", "idx": 12}, {"begin": 27716, "end": 27730, "n": "6", "idx": 13}, {"begin": 31676, "end": 31688, "n": "7", "idx": 14}, {"begin": 32450, "end": 32465, "idx": 15}, {"begin": 32966, "end": 32992, "idx": 16}, {"begin": 34373, "end": 34397, "idx": 17}, {"begin": 34783, "end": 34805, "idx": 18}], "Paragraph": [{"begin": 80, "end": 1210, "idx": 0}, {"begin": 1236, "end": 2014, "idx": 1}, {"begin": 2015, "end": 2886, "idx": 2}, {"begin": 2887, "end": 3469, "idx": 3}, {"begin": 3510, "end": 4455, "idx": 4}, {"begin": 4456, "end": 5333, "idx": 5}, {"begin": 5334, "end": 6200, "idx": 6}, {"begin": 6201, "end": 6775, "idx": 7}, {"begin": 6817, "end": 7389, "idx": 8}, {"begin": 7428, "end": 7494, "idx": 9}, {"begin": 7541, "end": 7746, "idx": 10}, {"begin": 7747, "end": 8048, "idx": 11}, {"begin": 8049, "end": 8442, "idx": 12}, {"begin": 8503, "end": 8780, "idx": 13}, {"begin": 8781, "end": 8920, "idx": 14}, {"begin": 8968, "end": 9438, "idx": 15}, {"begin": 9476, "end": 9739, "idx": 16}, {"begin": 9781, "end": 10172, "idx": 17}, {"begin": 10173, "end": 10533, "idx": 18}, {"begin": 10534, "end": 10581, "idx": 19}, {"begin": 10582, "end": 11542, "idx": 20}, {"begin": 11572, "end": 12372, "idx": 21}, {"begin": 12403, "end": 12830, "idx": 22}, {"begin": 12928, "end": 13029, "idx": 23}, {"begin": 13153, "end": 13262, "idx": 24}, {"begin": 13263, "end": 13660, "idx": 25}, {"begin": 13701, "end": 14097, "idx": 26}, {"begin": 14098, "end": 14969, "idx": 27}, {"begin": 14970, "end": 15357, "idx": 28}, {"begin": 15418, "end": 16363, "idx": 29}, {"begin": 16364, "end": 17142, "idx": 30}, {"begin": 17181, "end": 17245, "idx": 31}, {"begin": 17310, "end": 17804, "idx": 32}, {"begin": 17805, "end": 18846, "idx": 33}, {"begin": 18886, "end": 19390, "idx": 34}, {"begin": 19457, "end": 19536, "idx": 35}, {"begin": 19585, "end": 19890, "idx": 36}, {"begin": 19891, "end": 20256, "idx": 37}, {"begin": 20322, "end": 20445, "idx": 38}, {"begin": 20446, "end": 20837, "idx": 39}, {"begin": 20889, "end": 20928, "idx": 40}, {"begin": 20929, "end": 20937, "idx": 41}, {"begin": 21045, "end": 21065, "idx": 42}, {"begin": 21066, "end": 21085, "idx": 43}, {"begin": 21140, "end": 21150, "idx": 44}, {"begin": 21151, "end": 22070, "idx": 45}, {"begin": 22071, "end": 23112, "idx": 46}, {"begin": 23113, "end": 23301, "idx": 47}, {"begin": 23433, "end": 23553, "idx": 48}, {"begin": 23650, "end": 24261, "idx": 49}, {"begin": 24277, "end": 24520, "idx": 50}, {"begin": 24521, "end": 25312, "idx": 51}, {"begin": 25313, "end": 26612, "idx": 52}, {"begin": 26613, "end": 27186, "idx": 53}, {"begin": 27187, "end": 27714, "idx": 54}, {"begin": 27731, "end": 28764, "idx": 55}, {"begin": 28765, "end": 28957, "idx": 56}, {"begin": 28958, "end": 29298, "idx": 57}, {"begin": 29299, "end": 30540, "idx": 58}, {"begin": 30541, "end": 31499, "idx": 59}, {"begin": 31500, "end": 31674, "idx": 60}, {"begin": 31689, "end": 32448, "idx": 61}, {"begin": 32466, "end": 32964, "idx": 62}, {"begin": 32993, "end": 33449, "idx": 63}, {"begin": 33488, "end": 34120, "idx": 64}, {"begin": 34180, "end": 34371, "idx": 65}, {"begin": 34398, "end": 34781, "idx": 66}, {"begin": 34806, "end": 35357, "idx": 67}, {"begin": 35358, "end": 36428, "idx": 68}, {"begin": 36449, "end": 36470, "idx": 69}], "ReferenceToBib": [{"begin": 1366, "end": 1370, "target": "#b25", "idx": 0}, {"begin": 1371, "end": 1373, "target": "#b5", "idx": 1}, {"begin": 1423, "end": 1427, "target": "#b57", "idx": 2}, {"begin": 1481, "end": 1485, "target": "#b27", "idx": 3}, {"begin": 1486, "end": 1489, "target": "#b9", "idx": 4}, {"begin": 1544, "end": 1548, "target": "#b53", "idx": 5}, {"begin": 1569, "end": 1573, "target": "#b21", "idx": 6}, {"begin": 1630, "end": 1634, "target": "#b40", "idx": 7}, {"begin": 1713, "end": 1717, "target": "#b16", "idx": 8}, {"begin": 1718, "end": 1721, "target": "#b28", "idx": 9}, {"begin": 1722, "end": 1725, "target": "#b10", "idx": 10}, {"begin": 1726, "end": 1729, "target": "#b59", "idx": 11}, {"begin": 1771, "end": 1775, "target": "#b14", "idx": 12}, {"begin": 1932, "end": 1936, "target": "#b39", "idx": 13}, {"begin": 1969, "end": 1972, "target": "#b1", "idx": 14}, {"begin": 1973, "end": 1976, "target": "#b54", "idx": 15}, {"begin": 2380, "end": 2384, "target": "#b28", "idx": 16}, {"begin": 2432, "end": 2436, "target": "#b20", "idx": 17}, {"begin": 2782, "end": 2786, "target": "#b18", "idx": 18}, {"begin": 2816, "end": 2820, "target": "#b49", "idx": 19}, {"begin": 3009, "end": 3013, "target": "#b32", "idx": 20}, {"begin": 3266, "end": 3270, "target": "#b23", "idx": 21}, {"begin": 5256, "end": 5260, "target": "#b29", "idx": 22}, {"begin": 5261, "end": 5264, "target": "#b36", "idx": 23}, {"begin": 5807, "end": 5811, "target": "#b33", "idx": 24}, {"begin": 5826, "end": 5830, "target": "#b30", "idx": 25}, {"begin": 6832, "end": 6836, "target": "#b23", "idx": 26}, {"begin": 6976, "end": 6980, "target": "#b52", "idx": 27}, {"begin": 7604, "end": 7608, "target": "#b52", "idx": 28}, {"begin": 7932, "end": 7936, "target": "#b52", "idx": 29}, {"begin": 8099, "end": 8103, "target": "#b60", "idx": 30}, {"begin": 8515, "end": 8519, "target": "#b60", "idx": 31}, {"begin": 8825, "end": 8829, "target": "#b52", "idx": 32}, {"begin": 9074, "end": 9078, "target": "#b52", "idx": 33}, {"begin": 9942, "end": 9946, "target": "#b61", "idx": 34}, {"begin": 10081, "end": 10084, "target": "#b8", "idx": 35}, {"begin": 10085, "end": 10088, "target": "#b11", "idx": 36}, {"begin": 10089, "end": 10092, "target": "#b38", "idx": 37}, {"begin": 11037, "end": 11040, "target": "#b2", "idx": 38}, {"begin": 11041, "end": 11044, "target": "#b46", "idx": 39}, {"begin": 11459, "end": 11463, "target": "#b23", "idx": 40}, {"begin": 13999, "end": 14003, "target": "#b62", "idx": 41}, {"begin": 16320, "end": 16324, "target": "#b29", "idx": 42}, {"begin": 16358, "end": 16362, "target": "#b36", "idx": 43}, {"begin": 18408, "end": 18412, "target": "#b45", "idx": 44}, {"begin": 18445, "end": 18449, "target": "#b63", "idx": 45}, {"begin": 18450, "end": 18453, "target": "#b64", "idx": 46}, {"begin": 18454, "end": 18456, "target": "#b7", "idx": 47}, {"begin": 18666, "end": 18670, "target": "#b56", "idx": 48}, {"begin": 18671, "end": 18674, "target": "#b12", "idx": 49}, {"begin": 18675, "end": 18678, "target": "#b22", "idx": 50}, {"begin": 18748, "end": 18752, "target": "#b12", "idx": 51}, {"begin": 21338, "end": 21342, "target": "#b29", "idx": 52}, {"begin": 21376, "end": 21380, "target": "#b36", "idx": 53}, {"begin": 24548, "end": 24552, "target": "#b33", "idx": 54}, {"begin": 24567, "end": 24571, "target": "#b30", "idx": 55}, {"begin": 26662, "end": 26666, "target": "#b47", "idx": 56}, {"begin": 26675, "end": 26679, "target": "#b19", "idx": 57}, {"begin": 26971, "end": 26975, "target": "#b35", "idx": 58}, {"begin": 27854, "end": 27857, "target": "#b3", "idx": 59}, {"begin": 27858, "end": 27861, "target": "#b50", "idx": 60}, {"begin": 27862, "end": 27864, "target": "#b4", "idx": 61}, {"begin": 27865, "end": 27868, "target": "#b15", "idx": 62}, {"begin": 27869, "end": 27872, "target": "#b51", "idx": 63}, {"begin": 27923, "end": 27926, "target": "#b3", "idx": 64}, {"begin": 27927, "end": 27929, "target": "#b0", "idx": 65}, {"begin": 28429, "end": 28433, "target": "#b50", "idx": 66}, {"begin": 28815, "end": 28818, "target": "#b4", "idx": 67}, {"begin": 28849, "end": 28853, "target": "#b15", "idx": 68}, {"begin": 30084, "end": 30088, "target": "#b37", "idx": 69}, {"begin": 30678, "end": 30682, "target": "#b23", "idx": 70}, {"begin": 30748, "end": 30752, "target": "#b26", "idx": 71}, {"begin": 30753, "end": 30756, "target": "#b48", "idx": 72}, {"begin": 30883, "end": 30887, "target": "#b20", "idx": 73}, {"begin": 30964, "end": 30968, "target": "#b11", "idx": 74}, {"begin": 30969, "end": 30972, "target": "#b38", "idx": 75}, {"begin": 31262, "end": 31266, "target": "#b13", "idx": 76}, {"begin": 31267, "end": 31269, "target": "#b6", "idx": 77}, {"begin": 31270, "end": 31273, "target": "#b65", "idx": 78}, {"begin": 31603, "end": 31607, "target": "#b42", "idx": 79}, {"begin": 31608, "end": 31611, "target": "#b43", "idx": 80}, {"begin": 31665, "end": 31669, "target": "#b34", "idx": 81}, {"begin": 31670, "end": 31673, "target": "#b55", "idx": 82}, {"begin": 33035, "end": 33039, "target": "#b12", "idx": 83}, {"begin": 35200, "end": 35204, "target": "#b31", "idx": 84}, {"begin": 35295, "end": 35299, "target": "#b31", "idx": 85}], "Sentence": [{"begin": 80, "end": 236, "idx": 0}, {"begin": 237, "end": 548, "idx": 1}, {"begin": 549, "end": 735, "idx": 2}, {"begin": 736, "end": 943, "idx": 3}, {"begin": 944, "end": 1099, "idx": 4}, {"begin": 1100, "end": 1210, "idx": 5}, {"begin": 1236, "end": 1297, "idx": 6}, {"begin": 1298, "end": 1635, "idx": 7}, {"begin": 1636, "end": 1777, "idx": 8}, {"begin": 1778, "end": 2014, "idx": 9}, {"begin": 2015, "end": 2123, "idx": 10}, {"begin": 2124, "end": 2451, "idx": 11}, {"begin": 2452, "end": 2592, "idx": 12}, {"begin": 2593, "end": 2690, "idx": 13}, {"begin": 2691, "end": 2886, "idx": 14}, {"begin": 2887, "end": 3121, "idx": 15}, {"begin": 3122, "end": 3213, "idx": 16}, {"begin": 3214, "end": 3308, "idx": 17}, {"begin": 3309, "end": 3469, "idx": 18}, {"begin": 3510, "end": 3629, "idx": 19}, {"begin": 3630, "end": 3688, "idx": 20}, {"begin": 3689, "end": 3935, "idx": 21}, {"begin": 3936, "end": 4129, "idx": 22}, {"begin": 4130, "end": 4318, "idx": 23}, {"begin": 4319, "end": 4455, "idx": 24}, {"begin": 4456, "end": 4568, "idx": 25}, {"begin": 4569, "end": 4672, "idx": 26}, {"begin": 4673, "end": 4817, "idx": 27}, {"begin": 4818, "end": 4940, "idx": 28}, {"begin": 4941, "end": 5198, "idx": 29}, {"begin": 5199, "end": 5333, "idx": 30}, {"begin": 5334, "end": 5380, "idx": 31}, {"begin": 5381, "end": 5634, "idx": 32}, {"begin": 5635, "end": 5729, "idx": 33}, {"begin": 5730, "end": 5831, "idx": 34}, {"begin": 5832, "end": 5937, "idx": 35}, {"begin": 5938, "end": 6098, "idx": 36}, {"begin": 6099, "end": 6200, "idx": 37}, {"begin": 6201, "end": 6273, "idx": 38}, {"begin": 6274, "end": 6346, "idx": 39}, {"begin": 6347, "end": 6416, "idx": 40}, {"begin": 6417, "end": 6552, "idx": 41}, {"begin": 6553, "end": 6667, "idx": 42}, {"begin": 6668, "end": 6775, "idx": 43}, {"begin": 6817, "end": 6922, "idx": 44}, {"begin": 6923, "end": 6965, "idx": 45}, {"begin": 6966, "end": 7019, "idx": 46}, {"begin": 7020, "end": 7173, "idx": 47}, {"begin": 7174, "end": 7360, "idx": 48}, {"begin": 7361, "end": 7389, "idx": 49}, {"begin": 7428, "end": 7494, "idx": 50}, {"begin": 7541, "end": 7591, "idx": 51}, {"begin": 7592, "end": 7746, "idx": 52}, {"begin": 7747, "end": 7848, "idx": 53}, {"begin": 7849, "end": 7979, "idx": 54}, {"begin": 7980, "end": 8048, "idx": 55}, {"begin": 8049, "end": 8179, "idx": 56}, {"begin": 8180, "end": 8388, "idx": 57}, {"begin": 8389, "end": 8442, "idx": 58}, {"begin": 8503, "end": 8646, "idx": 59}, {"begin": 8647, "end": 8780, "idx": 60}, {"begin": 8781, "end": 8903, "idx": 61}, {"begin": 8904, "end": 8920, "idx": 62}, {"begin": 8968, "end": 9061, "idx": 63}, {"begin": 9062, "end": 9438, "idx": 64}, {"begin": 9476, "end": 9589, "idx": 65}, {"begin": 9590, "end": 9739, "idx": 66}, {"begin": 9781, "end": 9802, "idx": 67}, {"begin": 9803, "end": 9947, "idx": 68}, {"begin": 9948, "end": 10093, "idx": 69}, {"begin": 10094, "end": 10172, "idx": 70}, {"begin": 10173, "end": 10252, "idx": 71}, {"begin": 10253, "end": 10459, "idx": 72}, {"begin": 10460, "end": 10533, "idx": 73}, {"begin": 10534, "end": 10581, "idx": 74}, {"begin": 10582, "end": 10667, "idx": 75}, {"begin": 10668, "end": 10758, "idx": 76}, {"begin": 10759, "end": 10932, "idx": 77}, {"begin": 10933, "end": 11045, "idx": 78}, {"begin": 11046, "end": 11138, "idx": 79}, {"begin": 11139, "end": 11288, "idx": 80}, {"begin": 11289, "end": 11542, "idx": 81}, {"begin": 11572, "end": 11761, "idx": 82}, {"begin": 11762, "end": 11871, "idx": 83}, {"begin": 11872, "end": 11878, "idx": 84}, {"begin": 11879, "end": 12028, "idx": 85}, {"begin": 12029, "end": 12208, "idx": 86}, {"begin": 12209, "end": 12372, "idx": 87}, {"begin": 12403, "end": 12557, "idx": 88}, {"begin": 12558, "end": 12706, "idx": 89}, {"begin": 12707, "end": 12830, "idx": 90}, {"begin": 12928, "end": 12930, "idx": 91}, {"begin": 12931, "end": 13021, "idx": 92}, {"begin": 13022, "end": 13029, "idx": 93}, {"begin": 13153, "end": 13262, "idx": 94}, {"begin": 13263, "end": 13515, "idx": 95}, {"begin": 13516, "end": 13660, "idx": 96}, {"begin": 13701, "end": 13953, "idx": 97}, {"begin": 13954, "end": 14097, "idx": 98}, {"begin": 14098, "end": 14260, "idx": 99}, {"begin": 14261, "end": 14455, "idx": 100}, {"begin": 14456, "end": 14522, "idx": 101}, {"begin": 14523, "end": 14639, "idx": 102}, {"begin": 14640, "end": 14818, "idx": 103}, {"begin": 14819, "end": 14969, "idx": 104}, {"begin": 14970, "end": 15119, "idx": 105}, {"begin": 15120, "end": 15188, "idx": 106}, {"begin": 15189, "end": 15357, "idx": 107}, {"begin": 15418, "end": 15554, "idx": 108}, {"begin": 15555, "end": 15803, "idx": 109}, {"begin": 15804, "end": 16008, "idx": 110}, {"begin": 16009, "end": 16155, "idx": 111}, {"begin": 16156, "end": 16363, "idx": 112}, {"begin": 16364, "end": 16623, "idx": 113}, {"begin": 16624, "end": 16786, "idx": 114}, {"begin": 16787, "end": 16948, "idx": 115}, {"begin": 16949, "end": 17142, "idx": 116}, {"begin": 17181, "end": 17245, "idx": 117}, {"begin": 17310, "end": 17354, "idx": 118}, {"begin": 17355, "end": 17533, "idx": 119}, {"begin": 17534, "end": 17701, "idx": 120}, {"begin": 17702, "end": 17743, "idx": 121}, {"begin": 17744, "end": 17804, "idx": 122}, {"begin": 17805, "end": 17954, "idx": 123}, {"begin": 17955, "end": 18098, "idx": 124}, {"begin": 18099, "end": 18324, "idx": 125}, {"begin": 18325, "end": 18530, "idx": 126}, {"begin": 18531, "end": 18785, "idx": 127}, {"begin": 18786, "end": 18846, "idx": 128}, {"begin": 18886, "end": 18943, "idx": 129}, {"begin": 18944, "end": 19090, "idx": 130}, {"begin": 19091, "end": 19204, "idx": 131}, {"begin": 19205, "end": 19322, "idx": 132}, {"begin": 19323, "end": 19381, "idx": 133}, {"begin": 19382, "end": 19390, "idx": 134}, {"begin": 19457, "end": 19536, "idx": 135}, {"begin": 19585, "end": 19647, "idx": 136}, {"begin": 19648, "end": 19775, "idx": 137}, {"begin": 19776, "end": 19890, "idx": 138}, {"begin": 19891, "end": 19934, "idx": 139}, {"begin": 19935, "end": 20053, "idx": 140}, {"begin": 20054, "end": 20176, "idx": 141}, {"begin": 20177, "end": 20216, "idx": 142}, {"begin": 20217, "end": 20256, "idx": 143}, {"begin": 20322, "end": 20445, "idx": 144}, {"begin": 20446, "end": 20635, "idx": 145}, {"begin": 20636, "end": 20728, "idx": 146}, {"begin": 20729, "end": 20837, "idx": 147}, {"begin": 20889, "end": 20928, "idx": 148}, {"begin": 20929, "end": 20937, "idx": 149}, {"begin": 21045, "end": 21065, "idx": 150}, {"begin": 21066, "end": 21085, "idx": 151}, {"begin": 21140, "end": 21150, "idx": 152}, {"begin": 21151, "end": 21281, "idx": 153}, {"begin": 21282, "end": 21381, "idx": 154}, {"begin": 21382, "end": 21522, "idx": 155}, {"begin": 21523, "end": 21598, "idx": 156}, {"begin": 21599, "end": 21749, "idx": 157}, {"begin": 21750, "end": 21967, "idx": 158}, {"begin": 21968, "end": 22070, "idx": 159}, {"begin": 22071, "end": 22268, "idx": 160}, {"begin": 22269, "end": 22385, "idx": 161}, {"begin": 22386, "end": 22500, "idx": 162}, {"begin": 22501, "end": 22582, "idx": 163}, {"begin": 22583, "end": 22810, "idx": 164}, {"begin": 22811, "end": 22984, "idx": 165}, {"begin": 22985, "end": 23112, "idx": 166}, {"begin": 23113, "end": 23188, "idx": 167}, {"begin": 23189, "end": 23216, "idx": 168}, {"begin": 23217, "end": 23301, "idx": 169}, {"begin": 23433, "end": 23553, "idx": 170}, {"begin": 23650, "end": 23682, "idx": 171}, {"begin": 23683, "end": 23874, "idx": 172}, {"begin": 23875, "end": 23951, "idx": 173}, {"begin": 23952, "end": 24062, "idx": 174}, {"begin": 24063, "end": 24261, "idx": 175}, {"begin": 24277, "end": 24411, "idx": 176}, {"begin": 24412, "end": 24520, "idx": 177}, {"begin": 24521, "end": 24600, "idx": 178}, {"begin": 24601, "end": 24690, "idx": 179}, {"begin": 24691, "end": 24750, "idx": 180}, {"begin": 24751, "end": 24874, "idx": 181}, {"begin": 24875, "end": 24969, "idx": 182}, {"begin": 24970, "end": 25111, "idx": 183}, {"begin": 25112, "end": 25226, "idx": 184}, {"begin": 25227, "end": 25312, "idx": 185}, {"begin": 25313, "end": 25430, "idx": 186}, {"begin": 25431, "end": 25565, "idx": 187}, {"begin": 25566, "end": 25751, "idx": 188}, {"begin": 25752, "end": 25987, "idx": 189}, {"begin": 25988, "end": 26260, "idx": 190}, {"begin": 26261, "end": 26511, "idx": 191}, {"begin": 26512, "end": 26612, "idx": 192}, {"begin": 26613, "end": 26709, "idx": 193}, {"begin": 26710, "end": 26881, "idx": 194}, {"begin": 26882, "end": 26976, "idx": 195}, {"begin": 26977, "end": 27186, "idx": 196}, {"begin": 27187, "end": 27375, "idx": 197}, {"begin": 27376, "end": 27472, "idx": 198}, {"begin": 27473, "end": 27656, "idx": 199}, {"begin": 27657, "end": 27714, "idx": 200}, {"begin": 27731, "end": 27873, "idx": 201}, {"begin": 27874, "end": 28043, "idx": 202}, {"begin": 28044, "end": 28155, "idx": 203}, {"begin": 28156, "end": 28308, "idx": 204}, {"begin": 28309, "end": 28393, "idx": 205}, {"begin": 28394, "end": 28591, "idx": 206}, {"begin": 28592, "end": 28764, "idx": 207}, {"begin": 28765, "end": 28957, "idx": 208}, {"begin": 28958, "end": 29082, "idx": 209}, {"begin": 29083, "end": 29175, "idx": 210}, {"begin": 29176, "end": 29298, "idx": 211}, {"begin": 29299, "end": 29416, "idx": 212}, {"begin": 29417, "end": 29485, "idx": 213}, {"begin": 29486, "end": 29594, "idx": 214}, {"begin": 29595, "end": 29717, "idx": 215}, {"begin": 29718, "end": 29806, "idx": 216}, {"begin": 29807, "end": 29881, "idx": 217}, {"begin": 29882, "end": 29957, "idx": 218}, {"begin": 29958, "end": 30089, "idx": 219}, {"begin": 30090, "end": 30267, "idx": 220}, {"begin": 30268, "end": 30403, "idx": 221}, {"begin": 30404, "end": 30540, "idx": 222}, {"begin": 30541, "end": 30598, "idx": 223}, {"begin": 30599, "end": 30757, "idx": 224}, {"begin": 30758, "end": 30973, "idx": 225}, {"begin": 30974, "end": 31126, "idx": 226}, {"begin": 31127, "end": 31258, "idx": 227}, {"begin": 31259, "end": 31367, "idx": 228}, {"begin": 31368, "end": 31499, "idx": 229}, {"begin": 31500, "end": 31674, "idx": 230}, {"begin": 31689, "end": 31869, "idx": 231}, {"begin": 31870, "end": 32071, "idx": 232}, {"begin": 32072, "end": 32188, "idx": 233}, {"begin": 32189, "end": 32344, "idx": 234}, {"begin": 32345, "end": 32448, "idx": 235}, {"begin": 32466, "end": 32620, "idx": 236}, {"begin": 32621, "end": 32712, "idx": 237}, {"begin": 32713, "end": 32843, "idx": 238}, {"begin": 32844, "end": 32890, "idx": 239}, {"begin": 32891, "end": 32964, "idx": 240}, {"begin": 32993, "end": 33105, "idx": 241}, {"begin": 33106, "end": 33222, "idx": 242}, {"begin": 33223, "end": 33284, "idx": 243}, {"begin": 33285, "end": 33399, "idx": 244}, {"begin": 33400, "end": 33449, "idx": 245}, {"begin": 33488, "end": 33627, "idx": 246}, {"begin": 33628, "end": 33756, "idx": 247}, {"begin": 33757, "end": 33813, "idx": 248}, {"begin": 33814, "end": 33904, "idx": 249}, {"begin": 33905, "end": 34005, "idx": 250}, {"begin": 34006, "end": 34058, "idx": 251}, {"begin": 34059, "end": 34120, "idx": 252}, {"begin": 34180, "end": 34272, "idx": 253}, {"begin": 34273, "end": 34371, "idx": 254}, {"begin": 34398, "end": 34520, "idx": 255}, {"begin": 34521, "end": 34674, "idx": 256}, {"begin": 34675, "end": 34781, "idx": 257}, {"begin": 34806, "end": 34861, "idx": 258}, {"begin": 34862, "end": 34973, "idx": 259}, {"begin": 34974, "end": 35137, "idx": 260}, {"begin": 35138, "end": 35270, "idx": 261}, {"begin": 35271, "end": 35357, "idx": 262}, {"begin": 35358, "end": 35408, "idx": 263}, {"begin": 35409, "end": 35447, "idx": 264}, {"begin": 35448, "end": 35555, "idx": 265}, {"begin": 35556, "end": 35737, "idx": 266}, {"begin": 35738, "end": 35912, "idx": 267}, {"begin": 35913, "end": 35959, "idx": 268}, {"begin": 35960, "end": 36088, "idx": 269}, {"begin": 36089, "end": 36198, "idx": 270}, {"begin": 36199, "end": 36371, "idx": 271}, {"begin": 36372, "end": 36428, "idx": 272}, {"begin": 36449, "end": 36470, "idx": 273}], "ReferenceToFigure": [{"begin": 11669, "end": 11670, "target": "#fig_0", "idx": 0}, {"begin": 11887, "end": 11888, "target": "#fig_0", "idx": 1}, {"begin": 13383, "end": 13384, "target": "#fig_1", "idx": 2}, {"begin": 15117, "end": 15118, "target": "#fig_2", "idx": 3}, {"begin": 15204, "end": 15207, "target": "#fig_2", "idx": 4}, {"begin": 24096, "end": 24097, "target": "#fig_2", "idx": 5}, {"begin": 24114, "end": 24115, "target": "#fig_2", "idx": 6}, {"begin": 25338, "end": 25339, "target": "#fig_4", "idx": 7}, {"begin": 25661, "end": 25662, "target": "#fig_3", "idx": 8}, {"begin": 26370, "end": 26371, "target": "#fig_0", "idx": 9}, {"begin": 27212, "end": 27213, "target": "#fig_5", "idx": 10}], "Abstract": [{"begin": 70, "end": 1210, "idx": 0}], "SectionFootnote": [{"begin": 36472, "end": 36482, "idx": 0}], "ReferenceString": [{"begin": 36499, "end": 36658, "id": "b0", "idx": 0}, {"begin": 36660, "end": 36998, "id": "b1", "idx": 1}, {"begin": 37002, "end": 37145, "id": "b2", "idx": 2}, {"begin": 37149, "end": 37326, "id": "b3", "idx": 3}, {"begin": 37330, "end": 37473, "id": "b4", "idx": 4}, {"begin": 37477, "end": 37646, "id": "b5", "idx": 5}, {"begin": 37650, "end": 37824, "id": "b6", "idx": 6}, {"begin": 37828, "end": 38094, "id": "b7", "idx": 7}, {"begin": 38098, "end": 38248, "id": "b8", "idx": 8}, {"begin": 38252, "end": 38447, "id": "b9", "idx": 9}, {"begin": 38451, "end": 38576, "id": "b10", "idx": 10}, {"begin": 38580, "end": 38704, "id": "b11", "idx": 11}, {"begin": 38708, "end": 38861, "id": "b12", "idx": 12}, {"begin": 38865, "end": 38963, "id": "b13", "idx": 13}, {"begin": 38967, "end": 39178, "id": "b14", "idx": 14}, {"begin": 39182, "end": 39398, "id": "b15", "idx": 15}, {"begin": 39402, "end": 39503, "id": "b16", "idx": 16}, {"begin": 39507, "end": 39693, "id": "b17", "idx": 17}, {"begin": 39697, "end": 39941, "id": "b18", "idx": 18}, {"begin": 39945, "end": 40175, "id": "b19", "idx": 19}, {"begin": 40179, "end": 40302, "id": "b20", "idx": 20}, {"begin": 40306, "end": 40447, "id": "b21", "idx": 21}, {"begin": 40451, "end": 40649, "id": "b22", "idx": 22}, {"begin": 40653, "end": 40793, "id": "b23", "idx": 23}, {"begin": 40797, "end": 40982, "id": "b24", "idx": 24}, {"begin": 40986, "end": 41132, "id": "b25", "idx": 25}, {"begin": 41136, "end": 41365, "id": "b26", "idx": 26}, {"begin": 41369, "end": 41556, "id": "b27", "idx": 27}, {"begin": 41560, "end": 41636, "id": "b28", "idx": 28}, {"begin": 41640, "end": 41758, "id": "b29", "idx": 29}, {"begin": 41762, "end": 41855, "id": "b30", "idx": 30}, {"begin": 41859, "end": 42089, "id": "b31", "idx": 31}, {"begin": 42093, "end": 42251, "id": "b32", "idx": 32}, {"begin": 42255, "end": 42411, "id": "b33", "idx": 33}, {"begin": 42415, "end": 42546, "id": "b34", "idx": 34}, {"begin": 42550, "end": 42722, "id": "b35", "idx": 35}, {"begin": 42726, "end": 42814, "id": "b36", "idx": 36}, {"begin": 42818, "end": 42900, "id": "b37", "idx": 37}, {"begin": 42904, "end": 43077, "id": "b38", "idx": 38}, {"begin": 43081, "end": 43279, "id": "b39", "idx": 39}, {"begin": 43283, "end": 43513, "id": "b40", "idx": 40}, {"begin": 43517, "end": 43707, "id": "b41", "idx": 41}, {"begin": 43711, "end": 43864, "id": "b42", "idx": 42}, {"begin": 43868, "end": 43996, "id": "b43", "idx": 43}, {"begin": 44000, "end": 44353, "id": "b44", "idx": 44}, {"begin": 44357, "end": 44626, "id": "b45", "idx": 45}, {"begin": 44630, "end": 44758, "id": "b46", "idx": 46}, {"begin": 44762, "end": 44953, "id": "b47", "idx": 47}, {"begin": 44957, "end": 45082, "id": "b48", "idx": 48}, {"begin": 45086, "end": 45211, "id": "b49", "idx": 49}, {"begin": 45215, "end": 45415, "id": "b50", "idx": 50}, {"begin": 45419, "end": 45569, "id": "b51", "idx": 51}, {"begin": 45573, "end": 45839, "id": "b52", "idx": 52}, {"begin": 45843, "end": 46057, "id": "b53", "idx": 53}, {"begin": 46061, "end": 46255, "id": "b54", "idx": 54}, {"begin": 46259, "end": 46382, "id": "b55", "idx": 55}, {"begin": 46386, "end": 46535, "id": "b56", "idx": 56}, {"begin": 46539, "end": 46719, "id": "b57", "idx": 57}, {"begin": 46723, "end": 46929, "id": "b58", "idx": 58}, {"begin": 46933, "end": 47173, "id": "b59", "idx": 59}, {"begin": 47177, "end": 47297, "id": "b60", "idx": 60}, {"begin": 47301, "end": 47491, "id": "b61", "idx": 61}, {"begin": 47495, "end": 47683, "id": "b62", "idx": 62}, {"begin": 47687, "end": 47834, "id": "b63", "idx": 63}, {"begin": 47838, "end": 47958, "id": "b64", "idx": 64}, {"begin": 47962, "end": 48121, "id": "b65", "idx": 65}]}}